{"id": "wyklad1_s11_c1", "lecture": "wyklad1", "slide": 11, "title": "Definicja projektu", "text": "Projekt jest sekwencją niepowtarzalnych, złożonych i powiązanych ze sobą zadań. Zadania te mają wspólny cel oraz są realizowane w określonym terminie. Projekt musi być wykonany bez przekraczania ustalonego budżetu i zgodnie z założonymi wymaganiami.", "enriched_text": "Projekt jest sekwencją niepowtarzalnych, złożonych i powiązanych ze sobą zadań. Zadania te mają wspólny cel oraz są realizowane w określonym terminie. Projekt musi być wykonany bez przekraczania ustalonego budżetu i zgodnie z założonymi wymaganiami. Definicja ta podkreśla jednocześnie tymczasowy charakter projektu, jego wewnętrzną złożoność oraz konieczność koordynacji działań w ramach jasno określonych ograniczeń organizacyjnych."}
{"id": "wyklad1_s12_c1", "lecture": "wyklad1", "slide": 12, "title": "Projekt jako sekwencja i niepowtarzalność", "text": "Projekt ma charakter sekwencyjny, co oznacza uporządkowaną realizację zadań w czasie. Jednocześnie projekty są niepowtarzalne, ponieważ każde przedsięwzięcie realizowane jest w unikalnym kontekście i warunkach.", "enriched_text": "Projekt ma charakter sekwencyjny, co oznacza uporządkowaną realizację zadań w czasie. Jednocześnie projekty są niepowtarzalne, ponieważ każde przedsięwzięcie realizowane jest w unikalnym kontekście i warunkach. Sekwencyjność umożliwia planowanie kolejnych etapów prac, natomiast niepowtarzalność powoduje, że każdy projekt wymaga indywidualnych decyzji zarządczych."}
{"id": "wyklad1_s12_c2", "lecture": "wyklad1", "slide": 12, "title": "Złożoność i powiązania w projekcie", "text": "Projekt charakteryzuje się złożonością oraz istnieniem powiązań pomiędzy zadaniami. Wykonanie jednego zadania często zależy od realizacji innych, co wymaga koordynacji i planowania.", "enriched_text": "Projekt charakteryzuje się złożonością oraz istnieniem powiązań pomiędzy zadaniami. Wykonanie jednego zadania często zależy od realizacji innych, co wymaga koordynacji i planowania. Zależności między zadaniami zwiększają trudność realizacji projektu i powodują, że opóźnienia jednego elementu mogą wpływać na całość przedsięwzięcia."}
{"id": "wyklad1_s12_c3", "lecture": "wyklad1", "slide": 12, "title": "Cel, czas i zasoby projektu", "text": "Projekt posiada jeden jasno określony cel, który determinuje wszystkie podejmowane działania. Jego realizacja odbywa się w określonym czasie i przy ograniczonych zasobach. Kluczowe jest również spełnienie zdefiniowanych wymagań.", "enriched_text": "Projekt posiada jeden jasno określony cel, który determinuje wszystkie podejmowane działania. Jego realizacja odbywa się w określonym czasie i przy ograniczonych zasobach. Kluczowe jest również spełnienie zdefiniowanych wymagań. Cel projektu pełni funkcję nadrzędną wobec harmonogramu, alokacji zasobów oraz kryteriów oceny jego powodzenia."}
{"id": "wyklad1_s13_c1", "lecture": "wyklad1", "slide": 13, "title": "Zakres i jakość jako wymagania", "text": "Wymagania projektowe obejmują zakres projektu, rozumiany jako specyfikacja funkcjonalna. Obejmują one również jakość produktu końcowego oraz jakość procesu realizacji projektu.", "enriched_text": "Wymagania projektowe obejmują zakres projektu, rozumiany jako specyfikacja funkcjonalna. Obejmują one również jakość produktu końcowego oraz jakość procesu realizacji projektu. Zakres i jakość wyznaczają, co dokładnie ma zostać dostarczone oraz na jakim poziomie wykonania, zarówno w odniesieniu do rezultatu, jak i sposobu jego wytworzenia."}
{"id": "wyklad1_s13_c2", "lecture": "wyklad1", "slide": 13, "title": "Koszt, czas i zasoby jako wymagania", "text": "Do kluczowych wymagań projektu należą koszty oraz czas realizacji, często definiowany poprzez kamienie milowe. Istotnym elementem są również dostępne zasoby, które ograniczają sposób realizacji projektu.", "enriched_text": "Do kluczowych wymagań projektu należą koszty oraz czas realizacji, często definiowany poprzez kamienie milowe. Istotnym elementem są również dostępne zasoby, które ograniczają sposób realizacji projektu. Te wymagania wprowadzają ograniczenia decyzyjne, które wymuszają kompromisy pomiędzy zakresem prac, tempem realizacji i wykorzystaniem zasobów."}
{"id": "wyklad1_s14_c1", "lecture": "wyklad1", "slide": 14, "title": "Ryzyko i wartość ekonomiczna projektu", "text": "Każdy projekt wiąże się z określonym poziomem ryzyka. Jednocześnie projekty posiadają wartość ekonomiczną, która uzasadnia ponoszenie kosztów i angażowanie zasobów.", "enriched_text": "Każdy projekt wiąże się z określonym poziomem ryzyka. Jednocześnie projekty posiadają wartość ekonomiczną, która uzasadnia ponoszenie kosztów i angażowanie zasobów. Ryzyko jest nieodłącznym elementem projektów, a jego akceptacja jest uzasadniona oczekiwaną wartością ekonomiczną przedsięwzięcia."}
{"id": "wyklad1_s14_c2", "lecture": "wyklad1", "slide": 14, "title": "Złożoność i technologia w projekcie", "text": "Cechą projektu jest jego złożoność oraz rodzaj wykorzystywanej technologii. Zastosowanie nowych lub nieznanych technologii zwiększa stopień trudności i ryzyka realizacji.", "enriched_text": "Cechą projektu jest jego złożoność oraz rodzaj wykorzystywanej technologii. Zastosowanie nowych lub nieznanych technologii zwiększa stopień trudności i ryzyka realizacji. Dobór technologii wpływa bezpośrednio na poziom niepewności oraz wymagania kompetencyjne zespołu projektowego."}
{"id": "wyklad1_s14_c3", "lecture": "wyklad1", "slide": 14, "title": "Skala organizacyjna i koszty projektu", "text": "Projekt może angażować różną liczbę organizacji, co wpływa na jego złożoność. Istotnym czynnikiem są również całkowite koszty projektu, które determinują sposób zarządzania i kontroli.", "enriched_text": "Projekt może angażować różną liczbę organizacji, co wpływa na jego złożoność. Istotnym czynnikiem są również całkowite koszty projektu, które determinują sposób zarządzania i kontroli. Im większa skala organizacyjna i finansowa projektu, tym większe znaczenie ma formalizacja zarządzania i mechanizmy kontrolne."}
{"id": "wyklad1_s15_c1", "lecture": "wyklad1", "slide": 15, "title": "Typy projektów – wysoka złożoność", "text": "Projekty typu A są długotrwałe, złożone i obarczone wysokim ryzykiem. Wykorzystują nowe lub wcześniej nieużywane technologie, co zwiększa prawdopodobieństwo problemów.", "enriched_text": "Projekty typu A są długotrwałe, złożone i obarczone wysokim ryzykiem. Wykorzystują nowe lub wcześniej nieużywane technologie, co zwiększa prawdopodobieństwo problemów. Ten typ projektów wymaga szczególnej uwagi w zakresie planowania, kontroli oraz zarządzania ryzykiem."}
{"id": "wyklad1_s15_c2", "lecture": "wyklad1", "slide": 15, "title": "Typy projektów – średnia złożoność", "text": "Projekty typu B trwają do dwóch lat i charakteryzują się średnim poziomem złożoności oraz ryzyka. Wykorzystują technologie znane, stosowane jednak w ograniczonym zakresie.", "enriched_text": "Projekty typu B trwają do dwóch lat i charakteryzują się średnim poziomem złożoności oraz ryzyka. Wykorzystują technologie znane, stosowane jednak w ograniczonym zakresie. Są to projekty wymagające równowagi pomiędzy formalnym podejściem a elastycznością realizacji."}
{"id": "wyklad1_s15_c3", "lecture": "wyklad1", "slide": 15, "title": "Typy projektów – niska złożoność", "text": "Projekty typu C są krótkie i opierają się na znanych technologiach. Cechują się niewielką złożonością oraz niskim poziomem ryzyka.", "enriched_text": "Projekty typu C są krótkie i opierają się na znanych technologiach. Cechują się niewielką złożonością oraz niskim poziomem ryzyka. Ich realizacja jest stosunkowo przewidywalna i zwykle nie wymaga rozbudowanych mechanizmów kontroli."}
{"id": "wyklad1_s15_c4", "lecture": "wyklad1", "slide": 15, "title": "Typy projektów – bardzo niska złożoność", "text": "Projekty typu D są bardzo krótkie i realizowane z użyciem sprawdzonych technologii. Ryzyko oraz złożoność takich projektów są znikome.", "enriched_text": "Projekty typu D są bardzo krótkie i realizowane z użyciem sprawdzonych technologii. Ryzyko oraz złożoność takich projektów są znikome. Ten typ projektów zbliża się charakterem do działań rutynowych, choć nadal zachowuje cechy projektu."}
{"id": "wyklad1_s16_c1", "lecture": "wyklad1", "slide": 16, "title": "Definiowanie i planowanie projektu", "text": "Klasyczne zarządzanie projektem rozpoczyna się od definiowania zakresu, celów, kryteriów sukcesu oraz ryzyk. Następnie realizowany jest etap planowania obejmujący analizę, definicję zasobów, strukturę WBS oraz diagram sieciowy.", "enriched_text": "Klasyczne zarządzanie projektem rozpoczyna się od definiowania zakresu, celów, kryteriów sukcesu oraz ryzyk. Następnie realizowany jest etap planowania obejmujący analizę, definicję zasobów, strukturę WBS oraz diagram sieciowy. Etapy te tworzą podstawę logiczną projektu i umożliwiają przygotowanie spójnego planu realizacji."}
{"id": "wyklad1_s16_c2", "lecture": "wyklad1", "slide": 16, "title": "Wykonanie i kontrola projektu", "text": "Etap wykonania obejmuje organizację zespołu, zasady pracy, harmonogramowanie i dokumentowanie. Kontrola polega na zarządzaniu jakością i ryzykiem oraz monitorowaniu postępów i zmian w projekcie.", "enriched_text": "Etap wykonania obejmuje organizację zespołu, zasady pracy, harmonogramowanie i dokumentowanie. Kontrola polega na zarządzaniu jakością i ryzykiem oraz monitorowaniu postępów i zmian w projekcie. Wykonanie i kontrola przebiegają równolegle, co pozwala na bieżące reagowanie na odchylenia od planu."}
{"id": "wyklad1_s16_c3", "lecture": "wyklad1", "slide": 16, "title": "Zamknięcie projektu", "text": "Zamknięcie projektu obejmuje akceptację rezultatów, wdrożenie oraz przygotowanie pełnej dokumentacji. Elementem zamknięcia może być również audyt projektu.", "enriched_text": "Zamknięcie projektu obejmuje akceptację rezultatów, wdrożenie oraz przygotowanie pełnej dokumentacji. Elementem zamknięcia może być również audyt projektu. Faza ta pozwala formalnie zakończyć projekt oraz zebrać doświadczenia przydatne w przyszłych przedsięwzięciach."}
{"id": "wyklad1_s18_c1", "lecture": "wyklad1", "slide": 18, "title": "Istota zarządzania projektami", "text": "Zarządzanie projektami to zbiór zasad, działań, metod i środków. Ich celem jest osiągnięcie równowagi pomiędzy właściwościami projektu a wymaganiami i oczekiwaniami wobec niego.", "enriched_text": "Zarządzanie projektami to zbiór zasad, działań, metod i środków. Ich celem jest osiągnięcie równowagi pomiędzy właściwościami projektu a wymaganiami i oczekiwaniami wobec niego. Istotą zarządzania jest świadome podejmowanie decyzji prowadzących do realizacji celów projektu w danych ograniczeniach."}
{"id": "wyklad1_s18_c2", "lecture": "wyklad1", "slide": 18, "title": "Organizowanie i motywowanie w projekcie", "text": "W ramach zarządzania projektami realizowane jest organizowanie, polegające na przydzielaniu działań i zasobów. Istotnym elementem jest również motywowanie uczestników projektu i interesariuszy.", "enriched_text": "W ramach zarządzania projektami realizowane jest organizowanie, polegające na przydzielaniu działań i zasobów. Istotnym elementem jest również motywowanie uczestników projektu i interesariuszy. Motywowanie wspiera zaangażowanie zespołu i sprzyja skutecznej realizacji powierzonych zadań."}
{"id": "wyklad1_s18_c3", "lecture": "wyklad1", "slide": 18, "title": "Koordynowanie i kontrolowanie w projekcie", "text": "Koordynowanie polega na integracji i synchronizacji działań zespołu projektowego. Kontrolowanie obejmuje sprawdzanie zgodności realizowanych zadań z założeniami projektu.", "enriched_text": "Koordynowanie polega na integracji i synchronizacji działań zespołu projektowego. Kontrolowanie obejmuje sprawdzanie zgodności realizowanych zadań z założeniami projektu. Oba te działania zapewniają spójność realizacji projektu z przyjętym planem i celami."}
{"id": "wyklad1_s19_c1", "lecture": "wyklad1", "slide": 19, "title": "Różnorodność metodyk projektowych", "text": "Istnieje wiele metodyk zarządzania projektami, takich jak PMBOK, PRINCE2, TenStep, Six Sigma, SCRUM czy Agile. Różnią się one podejściem do planowania, kontroli i realizacji projektów.", "enriched_text": "Istnieje wiele metodyk zarządzania projektami, takich jak PMBOK, PRINCE2, TenStep, Six Sigma, SCRUM czy Agile. Różnią się one podejściem do planowania, kontroli i realizacji projektów. Różnorodność metodyk pozwala na dobór podejścia adekwatnego do charakteru i złożoności projektu."}
{"id": "wyklad1_s20_c1", "lecture": "wyklad1", "slide": 20, "title": "Six Sigma – istota", "text": "Six Sigma to metodyka zarządzania jakością rozwinięta w firmie Motorola w latach 80. Koncentruje się na minimalizacji odchyleń w procesach.", "enriched_text": "Six Sigma to metodyka zarządzania jakością rozwinięta w firmie Motorola w latach 80. Koncentruje się na minimalizacji odchyleń w procesach. Podejście to kładzie nacisk na stabilność procesów i systematyczne doskonalenie jakości."}
{"id": "wyklad1_s20_c2", "lecture": "wyklad1", "slide": 20, "title": "Six Sigma – cel jakościowy", "text": "Celem Six Sigma jest zmniejszenie liczby defektów poniżej 3,4 na milion wystąpień. Osiąga się to poprzez kontrolę zmienności procesów.", "enriched_text": "Celem Six Sigma jest zmniejszenie liczby defektów poniżej 3,4 na milion wystąpień. Osiąga się to poprzez kontrolę zmienności procesów. Cel ten obrazuje dążenie do bardzo wysokiego poziomu jakości i przewidywalności procesów."}
{"id": "wyklad1_s21_c1", "lecture": "wyklad1", "slide": 21, "title": "Lean – założenia", "text": "Lean jest metodyką zwinną nastawioną na eliminację strat. Skupia się na elementach, które klient uznaje za wartościowe.", "enriched_text": "Lean jest metodyką zwinną nastawioną na eliminację strat. Skupia się na elementach, które klient uznaje za wartościowe. Podejście Lean koncentruje uwagę na efektywności i maksymalizacji wartości dostarczanej odbiorcy."}
{"id": "wyklad1_s22_c1", "lecture": "wyklad1", "slide": 22, "title": "Cykl życia projektu – definiowanie", "text": "Klasyczny cykl realizacji projektu rozpoczyna się od definiowania problemu i celu głównego. Na tym etapie określa się również cele cząstkowe, kryteria sukcesu oraz potencjalne ryzyka.", "enriched_text": "Klasyczny cykl realizacji projektu rozpoczyna się od definiowania problemu i celu głównego. Na tym etapie określa się również cele cząstkowe, kryteria sukcesu oraz potencjalne ryzyka. Etap definiowania stanowi fundament całego projektu i wpływa na jakość dalszych decyzji."}
{"id": "wyklad1_s22_c2", "lecture": "wyklad1", "slide": 22, "title": "Cykl życia projektu – planowanie", "text": "Planowanie obejmuje określenie działań projektowych, oszacowanie czasu realizacji oraz zdefiniowanie zasobów. Tworzony jest diagram sieciowy oraz propozycja projektu.", "enriched_text": "Planowanie obejmuje określenie działań projektowych, oszacowanie czasu realizacji oraz zdefiniowanie zasobów. Tworzony jest diagram sieciowy oraz propozycja projektu. Planowanie pozwala uporządkować działania i przygotować spójny harmonogram realizacji."}
{"id": "wyklad1_s22_c3", "lecture": "wyklad1", "slide": 22, "title": "Cykl życia projektu – wykonanie i kontrola", "text": "W fazie wykonania organizowany jest zespół projektowy oraz harmonogram pracy. Kontrola obejmuje monitorowanie postępów, raportowanie oraz zarządzanie zmianami.", "enriched_text": "W fazie wykonania organizowany jest zespół projektowy oraz harmonogram pracy. Kontrola obejmuje monitorowanie postępów, raportowanie oraz zarządzanie zmianami. Połączenie wykonania i kontroli umożliwia bieżące reagowanie na problemy pojawiające się w trakcie realizacji."}
{"id": "wyklad1_s22_c4", "lecture": "wyklad1", "slide": 22, "title": "Cykl życia projektu – zamknięcie", "text": "Zamknięcie projektu polega na akceptacji rezultatów przez klienta, wdrożeniu rozwiązania oraz przygotowaniu kompletnej dokumentacji i audytu powdrożeniowego.", "enriched_text": "Zamknięcie projektu polega na akceptacji rezultatów przez klienta, wdrożeniu rozwiązania oraz przygotowaniu kompletnej dokumentacji i audytu powdrożeniowego. Zamknięcie formalizuje zakończenie projektu i umożliwia ocenę jego efektów."}
{"id": "wyklad1_s23_c1", "lecture": "wyklad1", "slide": 23, "title": "TenStep – obszary realizacji", "text": "Metodyka TenStep wyróżnia obszary takie jak budowa planu i budżetu, zarządzanie harmonogramem, ryzykiem, zmianą, komunikacją, ludźmi oraz jakością.", "enriched_text": "Metodyka TenStep wyróżnia obszary takie jak budowa planu i budżetu, zarządzanie harmonogramem, ryzykiem, zmianą, komunikacją, ludźmi oraz jakością. Podział na obszary ułatwia systematyczne podejście do zarządzania projektem."}
{"id": "wyklad1_s24_c1", "lecture": "wyklad1", "slide": 24, "title": "Modele realizacji projektu", "text": "Wyróżnia się różne modele realizacji projektu, m.in. kaskadowy, spiralny, ewolucyjny, przyrostowy oraz model z prototypowaniem.", "enriched_text": "Wyróżnia się różne modele realizacji projektu, m.in. kaskadowy, spiralny, ewolucyjny, przyrostowy oraz model z prototypowaniem. Modele te różnią się sposobem organizacji prac i stopniem elastyczności w reagowaniu na zmiany."}
{"id": "wyklad2_s3_c1", "lecture": "wyklad2", "slide": 3, "title": "Zakres projektu – definicja", "text": "Zakres projektu powstaje w wyniku wymiany informacji pomiędzy klientem a zespołem projektowym lub menadżerem projektu. Celem tej wymiany jest dokładne ustalenie głównego celu projektu.", "enriched_text": "Zakres projektu powstaje w wyniku wymiany informacji pomiędzy klientem a zespołem projektowym lub menadżerem projektu. Celem tej wymiany jest dokładne ustalenie głównego celu projektu. Fragment podkreśla komunikacyjny charakter definiowania zakresu, który opiera się na wspólnym rozumieniu celu projektu przez wszystkie zaangażowane strony."}
{"id": "wyklad2_s3_c2", "lecture": "wyklad2", "slide": 3, "title": "Cele cząstkowe a zakres projektu", "text": "Cele cząstkowe pozwalają precyzyjniej określić cel główny projektu. Połączenie celu głównego i celów cząstkowych definiuje zakres projektu.", "enriched_text": "Cele cząstkowe pozwalają precyzyjniej określić cel główny projektu. Połączenie celu głównego i celów cząstkowych definiuje zakres projektu. Cele cząstkowe uszczegóławiają kierunek działań i ograniczają niejednoznaczność interpretacji zakresu projektu."}
{"id": "wyklad2_s4_c1", "lecture": "wyklad2", "slide": 4, "title": "Zarządzanie oczekiwaniami klienta", "text": "Zakres projektu obejmuje zarządzanie oczekiwaniami klienta. Kluczowe jest odróżnianie rzeczywistych potrzeb od zachcianek oraz wyjaśnianie wszelkich niedomówień pojęciowych.", "enriched_text": "Zakres projektu obejmuje zarządzanie oczekiwaniami klienta. Kluczowe jest odróżnianie rzeczywistych potrzeb od zachcianek oraz wyjaśnianie wszelkich niedomówień pojęciowych. Zarządzanie oczekiwaniami pozwala ograniczyć ryzyko rozszerzania zakresu i konfliktów wynikających z różnych interpretacji pojęć."}
{"id": "wyklad2_s4_c2", "lecture": "wyklad2", "slide": 4, "title": "Warunki satysfakcji i kryteria sukcesu", "text": "Rezultatem analizy potrzeb klienta są warunki satysfakcji oraz zakres działań projektu. Na ich podstawie tworzone są kryteria sukcesu, które muszą być jasne, mierzalne i pozbawione niedomówień.", "enriched_text": "Rezultatem analizy potrzeb klienta są warunki satysfakcji oraz zakres działań projektu. Na ich podstawie tworzone są kryteria sukcesu, które muszą być jasne, mierzalne i pozbawione niedomówień. Kryteria sukcesu stanowią punkt odniesienia do oceny projektu i powinny jednoznacznie wynikać z ustaleń z klientem."}
{"id": "wyklad2_s4_c3", "lecture": "wyklad2", "slide": 4, "title": "Relacja warunków satysfakcji i kryteriów sukcesu", "text": "Nie wszystkie warunki satysfakcji muszą stanowić kryteria sukcesu projektu. Analogicznie, nie każde kryterium sukcesu musi bezpośrednio odpowiadać warunkowi satysfakcji.", "enriched_text": "Nie wszystkie warunki satysfakcji muszą stanowić kryteria sukcesu projektu. Analogicznie, nie każde kryterium sukcesu musi bezpośrednio odpowiadać warunkowi satysfakcji. Fragment pokazuje, że relacja między oczekiwaniami a kryteriami oceny projektu nie zawsze jest jednoznaczna i wymaga świadomych decyzji."}
{"id": "wyklad2_s5_c1", "lecture": "wyklad2", "slide": 5, "title": "Statut projektu – rola", "text": "Statut projektu jest krótkim, formalnym dokumentem napisanym językiem biznesowym. Służy do inicjacji projektu i oceny, czy jego realizacja ma uzasadnienie.", "enriched_text": "Statut projektu jest krótkim, formalnym dokumentem napisanym językiem biznesowym. Służy do inicjacji projektu i oceny, czy jego realizacja ma uzasadnienie. Statut projektu pełni funkcję decyzyjną, umożliwiając podjęcie świadomej decyzji o rozpoczęciu projektu."}
{"id": "wyklad2_s5_c2", "lecture": "wyklad2", "slide": 5, "title": "Zakres informacji w statucie projektu", "text": "Statut projektu opisuje problem, cel główny i cele cząstkowe oraz sposób mierzenia sukcesu. Określa również czynniki wpływające na projekt, jego zakres, typ oraz szacowane zasoby.", "enriched_text": "Statut projektu opisuje problem, cel główny i cele cząstkowe oraz sposób mierzenia sukcesu. Określa również czynniki wpływające na projekt, jego zakres, typ oraz szacowane zasoby. Dokument ten tworzy wspólną ramę odniesienia dla wszystkich stron zaangażowanych w inicjację projektu."}
{"id": "wyklad2_s6_c1", "lecture": "wyklad2", "slide": 6, "title": "Zawartość statutu projektu – cele i kryteria", "text": "Statut projektu zawiera opis głównego celu zgodnie z zasadą SMART oraz cele cząstkowe wraz z miernikami realizacji. Określane są także kryteria sukcesu projektu i oczekiwane korzyści biznesowe.", "enriched_text": "Statut projektu zawiera opis głównego celu zgodnie z zasadą SMART oraz cele cząstkowe wraz z miernikami realizacji. Określane są także kryteria sukcesu projektu i oczekiwane korzyści biznesowe. Takie ujęcie celów i mierników sprzyja jednoznacznej ocenie efektów projektu z perspektywy biznesowej."}
{"id": "wyklad2_s6_c2", "lecture": "wyklad2", "slide": 6, "title": "Ryzyka i formalny charakter statutu", "text": "W statucie projektu opisuje się wątpliwości, obszary ryzyka oraz potencjalne przeszkody. Dokument ma charakter formalny, jest wersjonowany i tworzony z użyciem języka formalnego.", "enriched_text": "W statucie projektu opisuje się wątpliwości, obszary ryzyka oraz potencjalne przeszkody. Dokument ma charakter formalny, jest wersjonowany i tworzony z użyciem języka formalnego. Formalny charakter statutu zwiększa jego wiarygodność i ułatwia kontrolę zmian na wczesnym etapie projektu."}
{"id": "wyklad2_s7_c1", "lecture": "wyklad2", "slide": 7, "title": "Adresaci statutu projektu", "text": "Statut projektu kierowany jest do zarządu, klienta oraz zespołu projektowego. Może być również analizowany przez osoby zarządzające zasobami w organizacji.", "enriched_text": "Statut projektu kierowany jest do zarządu, klienta oraz zespołu projektowego. Może być również analizowany przez osoby zarządzające zasobami w organizacji. Zakres odbiorców statutu odzwierciedla jego rolę jako dokumentu inicjującego i koordynującego projekt."}
{"id": "wyklad2_s7_c2", "lecture": "wyklad2", "slide": 7, "title": "Ocena statutu projektu", "text": "Podczas zatwierdzania statutu analizowana jest ważność problemu, zgodność projektu z celami firmy oraz relacja kosztów do potencjalnych korzyści. Oceniany jest także poziom ryzyka i sposoby jego minimalizacji.", "enriched_text": "Podczas zatwierdzania statutu analizowana jest ważność problemu, zgodność projektu z celami firmy oraz relacja kosztów do potencjalnych korzyści. Oceniany jest także poziom ryzyka i sposoby jego minimalizacji. Ocena statutu pozwala ograniczyć angażowanie zasobów w projekty o niskiej wartości lub nadmiernym ryzyku."}
{"id": "wyklad2_s8_c1", "lecture": "wyklad2", "slide": 8, "title": "Definicja projektu (PDS) – charakter", "text": "Project Definition Statement to dokument bardziej szczegółowy niż statut projektu. Jest przeznaczony do użytku wewnętrznego przez menadżera projektu i zespół.", "enriched_text": "Project Definition Statement to dokument bardziej szczegółowy niż statut projektu. Jest przeznaczony do użytku wewnętrznego przez menadżera projektu i zespół. PDS stanowi rozwinięcie założeń statutu i wspiera operacyjne przygotowanie projektu."}
{"id": "wyklad2_s8_c2", "lecture": "wyklad2", "slide": 8, "title": "Zawartość PDS", "text": "PDS rozwija cele cząstkowe projektu, opisuje szczegóły realizacji, aspekty techniczne oraz listę zadań operacyjnych. Zawiera także pełną listę ryzyk i potencjalnych problemów.", "enriched_text": "PDS rozwija cele cząstkowe projektu, opisuje szczegóły realizacji, aspekty techniczne oraz listę zadań operacyjnych. Zawiera także pełną listę ryzyk i potencjalnych problemów. Dokument ten umożliwia zespołowi lepsze zrozumienie sposobu realizacji projektu i potencjalnych trudności."}
{"id": "wyklad2_s9_c1", "lecture": "wyklad2", "slide": 9, "title": "Plan projektu – rola", "text": "Plan projektu powstaje jako efekt sesji planowania z udziałem kluczowych interesariuszy. Stanowi model projektu opisujący wszystkie działania niezbędne do jego realizacji.", "enriched_text": "Plan projektu powstaje jako efekt sesji planowania z udziałem kluczowych interesariuszy. Stanowi model projektu opisujący wszystkie działania niezbędne do jego realizacji. Plan projektu integruje ustalenia strategiczne z operacyjnym obrazem realizacji przedsięwzięcia."}
{"id": "wyklad2_s9_c2", "lecture": "wyklad2", "slide": 9, "title": "Zakres planu projektu", "text": "Plan projektu określa zasoby potrzebne do realizacji działań, wstępny harmonogram, prognozę kosztów oraz planowaną datę zakończenia projektu.", "enriched_text": "Plan projektu określa zasoby potrzebne do realizacji działań, wstępny harmonogram, prognozę kosztów oraz planowaną datę zakończenia projektu. Elementy planu umożliwiają ocenę wykonalności projektu jeszcze przed rozpoczęciem jego realizacji."}
{"id": "wyklad2_s9_c3", "lecture": "wyklad2", "slide": 9, "title": "Analiza wariantów w planie projektu", "text": "Na etapie planu projektu analizuje się wpływ zmian terminów i dostępności zasobów. Pozwala to ocenić możliwość skracania harmonogramu lub konieczność zmian w alokacji zasobów.", "enriched_text": "Na etapie planu projektu analizuje się wpływ zmian terminów i dostępności zasobów. Pozwala to ocenić możliwość skracania harmonogramu lub konieczność zmian w alokacji zasobów. Analiza wariantów wspiera podejmowanie decyzji dotyczących optymalizacji czasu i wykorzystania zasobów."}
{"id": "wyklad2_s10_c1", "lecture": "wyklad2", "slide": 10, "title": "WBS – definicja", "text": "Struktura podziału pracy (WBS) to hierarchiczny wykaz wszystkich zadań realizowanych w projekcie. Jej celem jest osiągnięcie celu głównego projektu.", "enriched_text": "Struktura podziału pracy (WBS) to hierarchiczny wykaz wszystkich zadań realizowanych w projekcie. Jej celem jest osiągnięcie celu głównego projektu. WBS porządkuje zakres projektu, dzieląc go na zarządzalne elementy pracy."}
{"id": "wyklad2_s10_c2", "lecture": "wyklad2", "slide": 10, "title": "Tworzenie WBS", "text": "Zadania w WBS definiowane są hierarchicznie, od ogólnych do szczegółowych. Podział prac realizują osoby, które będą wykonywać projekt, a struktura musi obejmować wszystkie zadania.", "enriched_text": "Zadania w WBS definiowane są hierarchicznie, od ogólnych do szczegółowych. Podział prac realizują osoby, które będą wykonywać projekt, a struktura musi obejmować wszystkie zadania. Zaangażowanie wykonawców w tworzenie WBS sprzyja kompletności i realności podziału prac."}
{"id": "wyklad2_s12_c1", "lecture": "wyklad2", "slide": 12, "title": "Podejścia do tworzenia WBS", "text": "WBS może być tworzona podejściem z góry na dół, z dołu do góry lub zespołowo. Stosowane są również mapy myśli oraz reprezentacje graficzne i tekstowe.", "enriched_text": "WBS może być tworzona podejściem z góry na dół, z dołu do góry lub zespołowo. Stosowane są również mapy myśli oraz reprezentacje graficzne i tekstowe. Różne podejścia do budowy WBS pozwalają dostosować sposób pracy do charakteru projektu i zespołu."}
{"id": "wyklad2_s13_c1", "lecture": "wyklad2", "slide": 13, "title": "Podejścia merytoryczne w WBS", "text": "Wyróżnia się podejście przedmiotowe, czynnościowe oraz organizacyjne do budowy WBS. Różnią się one sposobem definiowania rezultatów pracy.", "enriched_text": "Wyróżnia się podejście przedmiotowe, czynnościowe oraz organizacyjne do budowy WBS. Różnią się one sposobem definiowania rezultatów pracy. Wybór podejścia wpływa na sposób postrzegania rezultatów i strukturę planowanych działań."}
{"id": "wyklad2_s14_c1", "lecture": "wyklad2", "slide": 14, "title": "Kryteria kompletności WBS", "text": "Kompletność WBS ocenia się poprzez mierzalność działań oraz jasne zdefiniowanie początku i końca każdego zadania. Ważne jest, aby każde działanie miało konkretny rezultat oraz dało się oszacować jego czas i koszt. Dodatkowym kryterium jest wewnętrzna niezależność działań, czyli możliwie małe nakładanie się zadań na siebie.", "enriched_text": "Kompletność WBS ocenia się poprzez mierzalność działań oraz jasne zdefiniowanie początku i końca każdego zadania. Ważne jest, aby każde działanie miało konkretny rezultat oraz dało się oszacować jego czas i koszt. Dodatkowym kryterium jest wewnętrzna niezależność działań, czyli możliwie małe nakładanie się zadań na siebie. Kryteria te pomagają upewnić się, że struktura WBS jest spójna, kompletna i użyteczna w dalszym planowaniu projektu."}
{"id": "wyklad2_s15_c1", "lecture": "wyklad2", "slide": 15, "title": "OBS – definicja", "text": "Struktura organizacyjna projektu (OBS) określa stanowiska, role oraz zależności hierarchiczne i funkcjonalne. Umożliwia koordynację działań i projektowanie zespołów.", "enriched_text": "Struktura organizacyjna projektu (OBS) określa stanowiska, role oraz zależności hierarchiczne i funkcjonalne. Umożliwia koordynację działań i projektowanie zespołów. OBS porządkuje odpowiedzialności i relacje organizacyjne w projekcie."}
{"id": "wyklad2_s16_c1", "lecture": "wyklad2", "slide": 16, "title": "Rodzaje struktur organizacyjnych", "text": "W projektach stosowane są struktury liniowe, funkcjonalne, konglomeratowe, macierzowe oraz hybrydowe. Różnią się one stopniem centralizacji i elastyczności.", "enriched_text": "W projektach stosowane są struktury liniowe, funkcjonalne, konglomeratowe, macierzowe oraz hybrydowe. Różnią się one stopniem centralizacji i elastyczności. Dobór struktury organizacyjnej wpływa na sposób podejmowania decyzji i przepływ informacji w projekcie."}
{"id": "wyklad2_s18_c1", "lecture": "wyklad2", "slide": 18, "title": "Struktura liniowa – cechy", "text": "Struktura liniowa charakteryzuje się jasną hierarchią i jednoznaczną odpowiedzialnością. Ułatwia kontrolę i szybkie podejmowanie decyzji, ale prowadzi do centralizacji uprawnień.", "enriched_text": "Struktura liniowa charakteryzuje się jasną hierarchią i jednoznaczną odpowiedzialnością. Ułatwia kontrolę i szybkie podejmowanie decyzji, ale prowadzi do centralizacji uprawnień. Centralizacja władzy sprzyja kontroli, lecz może ograniczać elastyczność działania zespołów."}
{"id": "wyklad2_s20_c1", "lecture": "wyklad2", "slide": 20, "title": "Struktura funkcjonalna – cechy", "text": "Struktura funkcjonalna umożliwia efektywne wykorzystanie wyspecjalizowanych zasobów. Jednocześnie utrudnia przepływ informacji i definiowanie odpowiedzialności.", "enriched_text": "Struktura funkcjonalna umożliwia efektywne wykorzystanie wyspecjalizowanych zasobów. Jednocześnie utrudnia przepływ informacji i definiowanie odpowiedzialności. Tego typu struktura sprzyja specjalizacji, ale może komplikować realizację projektów przekrojowych."}
{"id": "wyklad2_s23_c1", "lecture": "wyklad2", "slide": 23, "title": "Struktura macierzowa – charakterystyka", "text": "Struktura macierzowa łączy podział funkcjonalny i projektowy. Sprzyja elastyczności i lepszemu wykorzystaniu zasobów, ale może powodować niejasność podporządkowania.", "enriched_text": "Struktura macierzowa łączy podział funkcjonalny i projektowy. Sprzyja elastyczności i lepszemu wykorzystaniu zasobów, ale może powodować niejasność podporządkowania. Macierz wymaga świadomego zarządzania odpowiedzialnością i komunikacją."}
{"id": "wyklad2_s26_c1", "lecture": "wyklad2", "slide": 26, "title": "Macierz odpowiedzialności RAM", "text": "Macierz RAM służy do definiowania odpowiedzialności członków zespołu projektowego. Pozwala powiązać zadania z osobami odpowiedzialnymi za ich realizację.", "enriched_text": "Macierz RAM służy do definiowania odpowiedzialności członków zespołu projektowego. Pozwala powiązać zadania z osobami odpowiedzialnymi za ich realizację. RAM wspiera przejrzystość odpowiedzialności i ogranicza ryzyko pominięcia zadań."}
{"id": "wyklad2_s27_c1", "lecture": "wyklad2", "slide": 27, "title": "Zasoby projektu", "text": "Zasoby projektu obejmują czas, finanse, sprzęt, materiały oraz ludzi wraz z ich umiejętnościami. Definiuje się zarówno zasoby dostępne, jak i te wymagane do realizacji projektu.", "enriched_text": "Zasoby projektu obejmują czas, finanse, sprzęt, materiały oraz ludzi wraz z ich umiejętnościami. Definiuje się zarówno zasoby dostępne, jak i te wymagane do realizacji projektu. Świadome zarządzanie zasobami umożliwia realistyczne planowanie i kontrolę projektu."}
{"id": "wyklad3_s3_c1", "lecture": "wyklad3", "slide": 3, "title": "Prognozowanie – podejście przez doświadczenie", "text": "Jednym z mechanizmów prognozowania jest wykorzystanie podobieństwa do innych działań i projektów. Opiera się ono na doświadczeniu zespołu oraz wcześniejszych realizacjach.", "enriched_text": "Jednym z mechanizmów prognozowania jest wykorzystanie podobieństwa do innych działań i projektów. Opiera się ono na doświadczeniu zespołu oraz wcześniejszych realizacjach. Podejście to zakłada, że wiedza zdobyta w poprzednich projektach może być wiarygodnym punktem odniesienia przy szacowaniu nowych przedsięwzięć."}
{"id": "wyklad3_s3_c2", "lecture": "wyklad3", "slide": 3, "title": "Technika trzech punktów", "text": "Technika trzech punktów polega na określeniu wariantu optymistycznego, pesymistycznego oraz najbardziej prawdopodobnego. Na ich podstawie szacowany jest czas lub koszt realizacji zadania.", "enriched_text": "Technika trzech punktów polega na określeniu wariantu optymistycznego, pesymistycznego oraz najbardziej prawdopodobnego. Na ich podstawie szacowany jest czas lub koszt realizacji zadania. Uwzględnienie różnych scenariuszy pozwala lepiej odzwierciedlić niepewność towarzyszącą planowaniu projektu."}
{"id": "wyklad3_s3_c3", "lecture": "wyklad3", "slide": 3, "title": "Prognozowanie eksperckie", "text": "Prognozowanie może opierać się na analizie danych historycznych oraz dokumentacji innych projektów. Wykorzystuje się również rady ekspertów oraz technikę delficką, polegającą na zbieraniu i uzasadnianiu opinii panelu uczestników.", "enriched_text": "Prognozowanie może opierać się na analizie danych historycznych oraz dokumentacji innych projektów. Wykorzystuje się również rady ekspertów oraz technikę delficką, polegającą na zbieraniu i uzasadnianiu opinii panelu uczestników. Łączenie danych historycznych z opiniami ekspertów zwiększa trafność prognoz w sytuacjach o wysokiej niepewności."}
{"id": "wyklad3_s3_c4", "lecture": "wyklad3", "slide": 3, "title": "Planning Poker", "text": "Planning Poker to technika zespołowego prognozowania (szacowania), stosowana przy ustalaniu czasu lub złożoności zadań. Uczestnicy przedstawiają swoje estymacje niezależnie, a następnie omawiają rozbieżności i dążą do uzgodnienia wspólnego oszacowania. Technika ma wspierać szybkie dojście do zrozumiałej dla zespołu prognozy.", "enriched_text": "Planning Poker to technika zespołowego prognozowania (szacowania), stosowana przy ustalaniu czasu lub złożoności zadań. Uczestnicy przedstawiają swoje estymacje niezależnie, a następnie omawiają rozbieżności i dążą do uzgodnienia wspólnego oszacowania. Technika ma wspierać szybkie dojście do zrozumiałej dla zespołu prognozy. Metoda ta wspiera wspólne rozumienie zadań i ogranicza wpływ dominujących opinii pojedynczych osób."}
{"id": "wyklad3_s4_c1", "lecture": "wyklad3", "slide": 4, "title": "Zarządzanie czasem – wczesne etapy", "text": "Wstępne zarządzanie czasem realizowane jest już na etapie statutu projektu, planu projektu oraz struktury WBS. Obejmuje ono wstępne szacowanie czasów realizacji i zależności pomiędzy zadaniami.", "enriched_text": "Wstępne zarządzanie czasem realizowane jest już na etapie statutu projektu, planu projektu oraz struktury WBS. Obejmuje ono wstępne szacowanie czasów realizacji i zależności pomiędzy zadaniami. Wczesne oszacowania czasowe tworzą ramy dalszego planowania i identyfikacji ryzyk harmonogramowych."}
{"id": "wyklad3_s4_c2", "lecture": "wyklad3", "slide": 4, "title": "Kompletny harmonogram projektu", "text": "Projekt wymaga kompletnego harmonogramu zawierającego czasy realizacji zadań, ich zależności, kolejność wykonywania oraz potrzebne zasoby. Harmonogram powinien uwzględniać daty rozpoczęcia i zakończenia zadań, najlepiej w wariancie minimalnym i maksymalnym.", "enriched_text": "Projekt wymaga kompletnego harmonogramu zawierającego czasy realizacji zadań, ich zależności, kolejność wykonywania oraz potrzebne zasoby. Harmonogram powinien uwzględniać daty rozpoczęcia i zakończenia zadań, najlepiej w wariancie minimalnym i maksymalnym. Kompletny harmonogram stanowi podstawowe narzędzie koordynacji prac i monitorowania postępów projektu."}
{"id": "wyklad3_s5_c1", "lecture": "wyklad3", "slide": 5, "title": "Prognozowanie czasu projektu", "text": "Prognozowanie czasu trwania projektu obejmuje definiowanie kamieni milowych oraz całkowitego czasu realizacji z uwzględnieniem rezerw. Rezerwy są istotnym elementem zarządzania niepewnością.", "enriched_text": "Prognozowanie czasu trwania projektu obejmuje definiowanie kamieni milowych oraz całkowitego czasu realizacji z uwzględnieniem rezerw. Rezerwy są istotnym elementem zarządzania niepewnością. Rezerwy czasowe zwiększają odporność harmonogramu na nieprzewidziane zdarzenia."}
{"id": "wyklad3_s5_c2", "lecture": "wyklad3", "slide": 5, "title": "Czas pracy a czas działania", "text": "Rzeczywisty czas pracy różni się od czasu działania zadania. Zazwyczaj stanowi on od 50 do 75 procent czasu działania, a dodatkowo należy uwzględnić nieplanowane przerwy w pracy.", "enriched_text": "Rzeczywisty czas pracy różni się od czasu działania zadania. Zazwyczaj stanowi on od 50 do 75 procent czasu działania, a dodatkowo należy uwzględnić nieplanowane przerwy w pracy. Rozróżnienie to pomaga realistyczniej szacować obciążenie zasobów i harmonogram."}
{"id": "wyklad3_s6_c1", "lecture": "wyklad3", "slide": 6, "title": "Margines bezpieczeństwa czasowego", "text": "W zarządzaniu czasem zaleca się stosowanie marginesu bezpieczeństwa. Margines ten może zostać utracony w wyniku prokrastynacji, prawa Parkinsona, zależności pomiędzy zadaniami oraz oczekiwania na założony termin.", "enriched_text": "W zarządzaniu czasem zaleca się stosowanie marginesu bezpieczeństwa. Margines ten może zostać utracony w wyniku prokrastynacji, prawa Parkinsona, zależności pomiędzy zadaniami oraz oczekiwania na założony termin. Margines bezpieczeństwa chroni projekt przed opóźnieniami, ale wymaga świadomego zarządzania."}
{"id": "wyklad3_s7_c1", "lecture": "wyklad3", "slide": 7, "title": "Prokrastynacja w projektach", "text": "Prokrastynacja objawia się negocjowaniem jak najdłuższego czasu realizacji oraz odkładaniem pracy na ostatnią chwilę. Prowadzi to często do przekraczania terminów i opóźnień w projekcie.", "enriched_text": "Prokrastynacja objawia się negocjowaniem jak najdłuższego czasu realizacji oraz odkładaniem pracy na ostatnią chwilę. Prowadzi to często do przekraczania terminów i opóźnień w projekcie. Zjawisko to obniża efektywność wykorzystania dostępnego czasu projektowego."}
{"id": "wyklad3_s7_c2", "lecture": "wyklad3", "slide": 7, "title": "Prawo Parkinsona", "text": "Prawo Parkinsona opisuje zjawisko, w którym praca rozszerza się tak, aby wypełnić cały dostępny czas. Skutkuje to brakiem motywacji do wcześniejszego zakończenia zadań.", "enriched_text": "Prawo Parkinsona opisuje zjawisko, w którym praca rozszerza się tak, aby wypełnić cały dostępny czas. Skutkuje to brakiem motywacji do wcześniejszego zakończenia zadań. Prawo to wyjaśnia, dlaczego nadmiernie długie terminy nie zawsze poprawiają realizację zadań."}
{"id": "wyklad3_s7_c3", "lecture": "wyklad3", "slide": 7, "title": "Zależności i kumulacja opóźnień", "text": "Zależności pomiędzy zadaniami powodują akumulację opóźnień w projekcie. Dodatkowo pojawiają się problemy ze współdzieleniem zasobów pomiędzy zadaniami.", "enriched_text": "Zależności pomiędzy zadaniami powodują akumulację opóźnień w projekcie. Dodatkowo pojawiają się problemy ze współdzieleniem zasobów pomiędzy zadaniami. Złożona sieć zależności zwiększa ryzyko przesunięć terminów w całym projekcie."}
{"id": "wyklad3_s8_c1", "lecture": "wyklad3", "slide": 8, "title": "Planowanie kolejności zadań", "text": "Zarządzanie czasem obejmuje definiowanie kolejności realizacji zadań oraz zależności pomiędzy nimi. Pozwala to na identyfikację zadań krytycznych i kamieni milowych.", "enriched_text": "Zarządzanie czasem obejmuje definiowanie kolejności realizacji zadań oraz zależności pomiędzy nimi. Pozwala to na identyfikację zadań krytycznych i kamieni milowych. Kolejność zadań wpływa bezpośrednio na długość projektu i możliwość kontroli postępów."}
{"id": "wyklad3_s8_c2", "lecture": "wyklad3", "slide": 8, "title": "Przydział zasobów i narzędzia", "text": "Na etapie planowania określa się wykonawców, czasy realizacji oraz przydział zasobów. Do wizualizacji harmonogramu stosuje się diagram Gantta oraz diagram sieciowy.", "enriched_text": "Na etapie planowania określa się wykonawców, czasy realizacji oraz przydział zasobów. Do wizualizacji harmonogramu stosuje się diagram Gantta oraz diagram sieciowy. Narzędzia wizualne ułatwiają analizę harmonogramu i komunikację planu projektu."}
{"id": "wyklad3_s13_c1", "lecture": "wyklad3", "slide": 13, "title": "Analiza harmonogramu", "text": "Harmonogram służy do identyfikacji kolizji zasobów i wykonawców. Umożliwia również definiowanie punktów kontroli realizacji oraz kamieni milowych.", "enriched_text": "Harmonogram służy do identyfikacji kolizji zasobów i wykonawców. Umożliwia również definiowanie punktów kontroli realizacji oraz kamieni milowych. Analiza harmonogramu wspiera wczesne wykrywanie problemów organizacyjnych."}
{"id": "wyklad3_s13_c2", "lecture": "wyklad3", "slide": 13, "title": "Wyznaczanie ścieżki krytycznej", "text": "Na podstawie harmonogramu wyznacza się ścieżkę krytyczną projektu. Pozwala to określić, które zadania mają kluczowy wpływ na termin zakończenia projektu.", "enriched_text": "Na podstawie harmonogramu wyznacza się ścieżkę krytyczną projektu. Pozwala to określić, które zadania mają kluczowy wpływ na termin zakończenia projektu. Ścieżka krytyczna koncentruje uwagę na zadaniach decydujących o czasie trwania projektu."}
{"id": "wyklad3_s15_c1", "lecture": "wyklad3", "slide": 15, "title": "Ścieżka krytyczna – definicja", "text": "Ścieżka krytyczna to ciąg zadań, w którym opóźnienie któregokolwiek zadania powoduje opóźnienie zakończenia całego projektu.", "enriched_text": "Ścieżka krytyczna to ciąg zadań, w którym opóźnienie któregokolwiek zadania powoduje opóźnienie zakończenia całego projektu. Zadania na ścieżce krytycznej nie posiadają zapasu czasu."}
{"id": "wyklad3_s15_c2", "lecture": "wyklad3", "slide": 15, "title": "Planowanie w przód i wstecz", "text": "Wyznaczanie ścieżki krytycznej obejmuje planowanie w przód, określające wczesne starty i zakończenia, oraz planowanie wstecz, określające późne starty i zakończenia zadań.", "enriched_text": "Wyznaczanie ścieżki krytycznej obejmuje planowanie w przód, określające wczesne starty i zakończenia, oraz planowanie wstecz, określające późne starty i zakończenia zadań. Oba kierunki planowania umożliwiają identyfikację zapasów czasu w harmonogramie."}
{"id": "wyklad3_s16_c1", "lecture": "wyklad3", "slide": 16, "title": "Właściwości ścieżki krytycznej", "text": "Ścieżka krytyczna występuje wtedy, gdy dla zadań zachodzi równość wczesnych i późnych terminów. Zadania spoza ścieżki krytycznej posiadają określony luz czasowy.", "enriched_text": "Ścieżka krytyczna występuje wtedy, gdy dla zadań zachodzi równość wczesnych i późnych terminów. Zadania spoza ścieżki krytycznej posiadają określony luz czasowy. Luz czasowy daje możliwość elastycznego zarządzania zadaniami niekrytycznymi."}
{"id": "wyklad3_s16_c2", "lecture": "wyklad3", "slide": 16, "title": "Obciążenie zadań krytycznych", "text": "Zadania na ścieżce krytycznej mają obciążenie, czyli wpływ na całkowity czas trwania projektu. Zmniejszenie obciążenia poniżej zera powoduje usunięcie zadania ze ścieżki krytycznej.", "enriched_text": "Zadania na ścieżce krytycznej mają obciążenie, czyli wpływ na całkowity czas trwania projektu. Zmniejszenie obciążenia poniżej zera powoduje usunięcie zadania ze ścieżki krytycznej. Zmiany w obciążeniu zadań mogą modyfikować strukturę ścieżki krytycznej."}
{"id": "wyklad3_s20_c1", "lecture": "wyklad3", "slide": 20, "title": "Czynniki sukcesu projektu", "text": "Na sukces projektu wpływają m.in. zaangażowanie klienta, wsparcie kierownictwa, jasno określone wymagania oraz właściwe planowanie. Istotne są również kompetencje zespołu i odpowiedzialność.", "enriched_text": "Na sukces projektu wpływają m.in. zaangażowanie klienta, wsparcie kierownictwa, jasno określone wymagania oraz właściwe planowanie. Istotne są również kompetencje zespołu i odpowiedzialność. Czynniki te wzajemnie się uzupełniają i decydują o stabilności realizacji projektu."}
{"id": "wyklad3_s21_c1", "lecture": "wyklad3", "slide": 21, "title": "Cele zarządzania zmianami", "text": "Celem zarządzania zmianami jest bezkonfliktowe wprowadzanie zmian w projekcie. Obejmuje ono przewidywanie, zapobieganie oraz łagodzenie negatywnych skutków zmian.", "enriched_text": "Celem zarządzania zmianami jest bezkonfliktowe wprowadzanie zmian w projekcie. Obejmuje ono przewidywanie, zapobieganie oraz łagodzenie negatywnych skutków zmian. Zarządzanie zmianami ma na celu ochronę spójności projektu."}
{"id": "wyklad3_s21_c2", "lecture": "wyklad3", "slide": 21, "title": "Źródła zmian w projekcie", "text": "Źródłami zmian mogą być klienci, interesariusze oraz członkowie zespołu projektowego. Zmiany mogą wynikać również z wcześniejszych błędów, reakcji na ryzyko lub innych projektów.", "enriched_text": "Źródłami zmian mogą być klienci, interesariusze oraz członkowie zespołu projektowego. Zmiany mogą wynikać również z wcześniejszych błędów, reakcji na ryzyko lub innych projektów. Różnorodność źródeł zmian wymaga jasnego procesu ich obsługi."}
{"id": "wyklad3_s22_c1", "lecture": "wyklad3", "slide": 22, "title": "Proces zarządzania zmianami", "text": "Zarządzanie zmianami obejmuje identyfikację, zgłaszanie oraz ocenę skutków zmian. Następnie realizowane jest wdrożenie, monitorowanie i kontrola zmian.", "enriched_text": "Zarządzanie zmianami obejmuje identyfikację, zgłaszanie oraz ocenę skutków zmian. Następnie realizowane jest wdrożenie, monitorowanie i kontrola zmian. Proces ten zapewnia kontrolowane i uporządkowane wprowadzanie zmian."}
{"id": "wyklad3_s23_c1", "lecture": "wyklad3", "slide": 23, "title": "Wpływ zmian na projekt", "text": "Zmiany wpływają na zakres, koszt oraz harmonogram projektu. Po ich wprowadzeniu konieczna jest aktualizacja parametrów projektu oraz stosowanie sformalizowanego systemu kontroli zmian.", "enriched_text": "Zmiany wpływają na zakres, koszt oraz harmonogram projektu. Po ich wprowadzeniu konieczna jest aktualizacja parametrów projektu oraz stosowanie sformalizowanego systemu kontroli zmian. Każda zmiana wymaga ponownej oceny jej konsekwencji dla całego projektu."}
{"id": "wyklad4_s3_c1", "lecture": "wyklad4", "slide": 3, "title": "Definicja ryzyka w projekcie", "text": "Ryzyko w projekcie to przyszłe, nieplanowane zdarzenie, którego rezultatem może być zarówno negatywna, jak i pozytywna zmiana w projekcie. Ryzyko obejmuje zatem nie tylko zagrożenia, ale również szanse.", "enriched_text": "Ryzyko w projekcie to przyszłe, nieplanowane zdarzenie, którego rezultatem może być zarówno negatywna, jak i pozytywna zmiana w projekcie. Ryzyko obejmuje zatem nie tylko zagrożenia, ale również szanse. Definicja ta rozszerza tradycyjne postrzeganie ryzyka, pokazując je jako źródło zarówno zagrożeń, jak i potencjalnych korzyści dla projektu."}
{"id": "wyklad4_s3_c2", "lecture": "wyklad4", "slide": 3, "title": "Ocena powagi ryzyka", "text": "Powagę ryzyka szacuje się zazwyczaj na podstawie dwóch czynników: prawdopodobieństwa jego wystąpienia oraz potencjalnego wpływu na projekt. Oba te elementy muszą być analizowane łącznie.", "enriched_text": "Powagę ryzyka szacuje się zazwyczaj na podstawie dwóch czynników: prawdopodobieństwa jego wystąpienia oraz potencjalnego wpływu na projekt. Oba te elementy muszą być analizowane łącznie. Łączna analiza prawdopodobieństwa i wpływu pozwala na racjonalne porównywanie ryzyk i ustalanie priorytetów działań."}
{"id": "wyklad4_s4_c1", "lecture": "wyklad4", "slide": 4, "title": "Proces zarządzania ryzykiem", "text": "Zarządzanie ryzykiem obejmuje identyfikowanie ryzyk, ich ocenę oraz opracowanie działań mitygujących. Integralną częścią procesu jest także monitorowanie i kontrola ryzyk.", "enriched_text": "Zarządzanie ryzykiem obejmuje identyfikowanie ryzyk, ich ocenę oraz opracowanie działań mitygujących. Integralną częścią procesu jest także monitorowanie i kontrola ryzyk. Proces ten ma charakter ciągły i towarzyszy projektowi przez cały jego cykl życia."}
{"id": "wyklad4_s4_c2", "lecture": "wyklad4", "slide": 4, "title": "Monitorowanie ryzyka", "text": "Monitorowanie i kontrola ryzyka realizowane są m.in. poprzez prowadzenie dziennika ryzyka. Pozwala on na bieżące śledzenie stanu ryzyk w projekcie.", "enriched_text": "Monitorowanie i kontrola ryzyka realizowane są m.in. poprzez prowadzenie dziennika ryzyka. Pozwala on na bieżące śledzenie stanu ryzyk w projekcie. Systematyczne monitorowanie umożliwia szybką reakcję na zmiany poziomu ryzyka."}
{"id": "wyklad4_s5_c1", "lecture": "wyklad4", "slide": 5, "title": "Identyfikacja i analiza ryzyka", "text": "Identyfikacja ryzyka polega na analizie potencjalnych zagrożeń i szans w projekcie. Obejmuje pytania o możliwe ryzyka, ich źródła, typy oraz to, czy zespół ma na nie wpływ.", "enriched_text": "Identyfikacja ryzyka polega na analizie potencjalnych zagrożeń i szans w projekcie. Obejmuje pytania o możliwe ryzyka, ich źródła, typy oraz to, czy zespół ma na nie wpływ. Na tym etapie kluczowe jest szerokie spojrzenie na projekt i jego otoczenie."}
{"id": "wyklad4_s5_c2", "lecture": "wyklad4", "slide": 5, "title": "Skutki i powiązania ryzyk", "text": "W analizie ryzyka rozważa się przewidywane skutki ryzyk, w tym scenariusze najgorszego przypadku. Istotne jest także badanie powiązań pomiędzy ryzykami oraz efektu kuli śnieżnej.", "enriched_text": "W analizie ryzyka rozważa się przewidywane skutki ryzyk, w tym scenariusze najgorszego przypadku. Istotne jest także badanie powiązań pomiędzy ryzykami oraz efektu kuli śnieżnej. Powiązania między ryzykami mogą prowadzić do eskalacji problemów w projekcie."}
{"id": "wyklad4_s5_c3", "lecture": "wyklad4", "slide": 5, "title": "Klasyfikacja ryzyka", "text": "Ryzyka w projekcie mogą być klasyfikowane, m.in. z wykorzystaniem drzewa ryzyka. Klasyfikacja ułatwia dalszą analizę oraz planowanie reakcji na ryzyka.", "enriched_text": "Ryzyka w projekcie mogą być klasyfikowane, m.in. z wykorzystaniem drzewa ryzyka. Klasyfikacja ułatwia dalszą analizę oraz planowanie reakcji na ryzyka. Uporządkowanie ryzyk sprzyja ich lepszemu zrozumieniu i zarządzaniu nimi."}
{"id": "wyklad4_s6_c1", "lecture": "wyklad4", "slide": 6, "title": "Kategorie ryzyka", "text": "Ryzyka projektowe mogą mieć charakter wewnętrzny lub zewnętrzny. Wyróżnia się m.in. ryzyka technologiczne, techniczne, finansowe, prawne, kontraktowe, czasowe, zasobowe, ludzkie oraz organizacyjne.", "enriched_text": "Ryzyka projektowe mogą mieć charakter wewnętrzny lub zewnętrzny. Wyróżnia się m.in. ryzyka technologiczne, techniczne, finansowe, prawne, kontraktowe, czasowe, zasobowe, ludzkie oraz organizacyjne. Podział na kategorie pomaga systematycznie identyfikować źródła ryzyka w projekcie."}
{"id": "wyklad4_s7_c1", "lecture": "wyklad4", "slide": 7, "title": "Ocena ryzyka – podejście ilościowe", "text": "Ryzyka oceniane są na podstawie ich wpływu na projekt oraz prawdopodobieństwa wystąpienia. Iloczyn tych dwóch czynników stanowi wartość ryzyka.", "enriched_text": "Ryzyka oceniane są na podstawie ich wpływu na projekt oraz prawdopodobieństwa wystąpienia. Iloczyn tych dwóch czynników stanowi wartość ryzyka. Podejście ilościowe umożliwia porównywanie ryzyk na wspólnej skali."}
{"id": "wyklad4_s7_c2", "lecture": "wyklad4", "slide": 7, "title": "Ocena ryzyka – podejście jakościowe", "text": "W analizie jakościowej ocenia się zależności pomiędzy ryzykami, w tym ryzyka wtórne, oraz ich hierarchię. Istotne jest, aby metoda oceny była zrozumiała dla wszystkich interesariuszy.", "enriched_text": "W analizie jakościowej ocenia się zależności pomiędzy ryzykami, w tym ryzyka wtórne, oraz ich hierarchię. Istotne jest, aby metoda oceny była zrozumiała dla wszystkich interesariuszy. Analiza jakościowa wspiera komunikację ryzyka w projekcie."}
{"id": "wyklad4_s7_c3", "lecture": "wyklad4", "slide": 7, "title": "Podejście pragmatyczne do ryzyka", "text": "W praktyce zarządzania ryzykiem ignoruje się absurdalne ryzyka o minimalnym prawdopodobieństwie wystąpienia. Pozwala to skupić się na ryzykach istotnych dla projektu.", "enriched_text": "W praktyce zarządzania ryzykiem ignoruje się absurdalne ryzyka o minimalnym prawdopodobieństwie wystąpienia. Pozwala to skupić się na ryzykach istotnych dla projektu. Selekcja ryzyk zwiększa efektywność procesu zarządzania ryzykiem."}
{"id": "wyklad4_s8_c1", "lecture": "wyklad4", "slide": 8, "title": "Mitygacja ryzyka", "text": "Mitygacja ryzyka polega na opracowaniu planów reakcji dla ryzyk uznanych za istotne. Celem jest ograniczenie negatywnych skutków zagrożeń.", "enriched_text": "Mitygacja ryzyka polega na opracowaniu planów reakcji dla ryzyk uznanych za istotne. Celem jest ograniczenie negatywnych skutków zagrożeń. Działania mitygujące powinny być adekwatne do poziomu ryzyka."}
{"id": "wyklad4_s8_c2", "lecture": "wyklad4", "slide": 8, "title": "Sposoby reakcji na ryzyko", "text": "Wyróżnia się cztery podstawowe sposoby reakcji na ryzyko: zmniejszenie prawdopodobieństwa wystąpienia, zmniejszenie wpływu na projekt, przeniesienie ryzyka oraz akceptację ryzyka.", "enriched_text": "Wyróżnia się cztery podstawowe sposoby reakcji na ryzyko: zmniejszenie prawdopodobieństwa wystąpienia, zmniejszenie wpływu na projekt, przeniesienie ryzyka oraz akceptację ryzyka. Dobór reakcji zależy od charakteru i znaczenia danego ryzyka."}
{"id": "wyklad4_s9_c1", "lecture": "wyklad4", "slide": 9, "title": "Dziennik ryzyka – zawartość", "text": "Dziennik ryzyka zawiera opis ryzyka, jego kategorię, wpływ na projekt, symptomy oraz zależności. Określa się w nim również osobę odpowiedzialną za monitorowanie i reakcję na ryzyko.", "enriched_text": "Dziennik ryzyka zawiera opis ryzyka, jego kategorię, wpływ na projekt, symptomy oraz zależności. Określa się w nim również osobę odpowiedzialną za monitorowanie i reakcję na ryzyko. Dziennik ryzyka jest centralnym narzędziem dokumentowania ryzyk."}
{"id": "wyklad4_s9_c2", "lecture": "wyklad4", "slide": 9, "title": "Zarządzanie dziennikiem ryzyka", "text": "Dziennik ryzyka jest aktualizowany na bieżąco wraz z pojawianiem się nowych ryzyk. W ramach zarządzania ryzykiem prowadzi się także okresowe przeglądy i audyty reakcji na ryzyka.", "enriched_text": "Dziennik ryzyka jest aktualizowany na bieżąco wraz z pojawianiem się nowych ryzyk. W ramach zarządzania ryzykiem prowadzi się także okresowe przeglądy i audyty reakcji na ryzyka. Regularne przeglądy pozwalają utrzymać aktualność informacji o ryzykach."}
{"id": "wyklad4_s10_c1", "lecture": "wyklad4", "slide": 10, "title": "Koszty zarządzania ryzykiem", "text": "Zarządzanie i mitygacja ryzyka wiążą się z ponoszeniem dodatkowych kosztów. Działania te są uzasadnione tak długo, jak długo przynoszą korzyści dla projektu.", "enriched_text": "Zarządzanie i mitygacja ryzyka wiążą się z ponoszeniem dodatkowych kosztów. Działania te są uzasadnione tak długo, jak długo przynoszą korzyści dla projektu. Koszty te należy traktować jako inwestycję w stabilność projektu."}
{"id": "wyklad4_s10_c2", "lecture": "wyklad4", "slide": 10, "title": "Znaczenie zarządzania ryzykiem", "text": "Efektywne zarządzanie ryzykiem zwiększa szanse powodzenia projektu. Polega ono na maksymalizacji czynników pozytywnych i minimalizacji czynników negatywnych.", "enriched_text": "Efektywne zarządzanie ryzykiem zwiększa szanse powodzenia projektu. Polega ono na maksymalizacji czynników pozytywnych i minimalizacji czynników negatywnych. Zarządzanie ryzykiem wspiera osiąganie celów projektu w niepewnym otoczeniu."}
{"id": "wyklad4_s11_c1", "lecture": "wyklad4", "slide": 11, "title": "Jakość produktu", "text": "Jakość produktu obejmuje m.in. funkcjonalność, praktyczność, niezawodność, trwałość oraz bezpieczeństwo użytkowania. Jest ona powiązana z jakością rynkową i satysfakcją użytkownika.", "enriched_text": "Jakość produktu obejmuje m.in. funkcjonalność, praktyczność, niezawodność, trwałość oraz bezpieczeństwo użytkowania. Jest ona powiązana z jakością rynkową i satysfakcją użytkownika. Jakość produktu wpływa bezpośrednio na jego odbiór przez użytkowników."}
{"id": "wyklad4_s11_c2", "lecture": "wyklad4", "slide": 11, "title": "Wielowymiarowość jakości produktu", "text": "Definiując jakość produktu należy uwzględnić cechy techniczne, technologiczne, użytkowe, estetyczne, ekonomiczne, ergonomiczne, ekologiczne, logistyczne oraz prawne.", "enriched_text": "Definiując jakość produktu należy uwzględnić cechy techniczne, technologiczne, użytkowe, estetyczne, ekonomiczne, ergonomiczne, ekologiczne, logistyczne oraz prawne. Jakość ma charakter wielowymiarowy i nie ogranicza się do cech technicznych."}
{"id": "wyklad4_s12_c1", "lecture": "wyklad4", "slide": 12, "title": "Ciągłe zarządzanie jakością (CQMM)", "text": "Ciągłe zarządzanie jakością polega na usprawnianiu procesów biznesowych poprzez analizę luk i identyfikację obszarów do poprawy. Model ten ma charakter cykliczny i adaptacyjny, ze sprzężeniem zwrotnym.", "enriched_text": "Ciągłe zarządzanie jakością polega na usprawnianiu procesów biznesowych poprzez analizę luk i identyfikację obszarów do poprawy. Model ten ma charakter cykliczny i adaptacyjny, ze sprzężeniem zwrotnym. Model ten zakłada systematyczne doskonalenie organizacji."}
{"id": "wyklad4_s12_c2", "lecture": "wyklad4", "slide": 12, "title": "Procesowe zarządzanie jakością (PQMM)", "text": "Procesowe zarządzanie jakością opiera się na misji, wizji oraz krytycznych czynnikach sukcesu. Na tej podstawie identyfikuje się kluczowe procesy i ustala priorytety usprawnień.", "enriched_text": "Procesowe zarządzanie jakością opiera się na misji, wizji oraz krytycznych czynnikach sukcesu. Na tej podstawie identyfikuje się kluczowe procesy i ustala priorytety usprawnień. Podejście procesowe koncentruje się na długofalowych celach organizacji."}
{"id": "wyklad4_s13_c1", "lecture": "wyklad4", "slide": 13, "title": "Model i metryki jakości", "text": "Zarządzanie jakością obejmuje wybór i dopasowanie modelu jakości do projektu. Stosuje się mierzalne metryki jakości oraz jasno zdefiniowane sposoby pomiaru.", "enriched_text": "Zarządzanie jakością obejmuje wybór i dopasowanie modelu jakości do projektu. Stosuje się mierzalne metryki jakości oraz jasno zdefiniowane sposoby pomiaru. Mierniki jakości umożliwiają obiektywną ocenę rezultatów."}
{"id": "wyklad4_s13_c2", "lecture": "wyklad4", "slide": 13, "title": "Plan zarządzania jakością", "text": "Plan zarządzania jakością określa sposób kontroli jakości produktu, procesu i projektu. Obejmuje on również audyty jakości.", "enriched_text": "Plan zarządzania jakością określa sposób kontroli jakości produktu, procesu i projektu. Obejmuje on również audyty jakości. Plan ten porządkuje działania związane z zapewnieniem jakości."}
{"id": "wyklad4_s16_c1", "lecture": "wyklad4", "slide": 16, "title": "Diagram Gantta – możliwości", "text": "Diagram Gantta przedstawia kolejność działań w projekcie, zależności pomiędzy nimi oraz przydział pracy. Umożliwia czytelną prezentację stopnia ukończenia i opóźnień.", "enriched_text": "Diagram Gantta przedstawia kolejność działań w projekcie, zależności pomiędzy nimi oraz przydział pracy. Umożliwia czytelną prezentację stopnia ukończenia i opóźnień. Jest to narzędzie wspierające komunikację harmonogramu projektu."}
{"id": "wyklad4_s16_c2", "lecture": "wyklad4", "slide": 16, "title": "Ograniczenia diagramu Gantta", "text": "Diagram Gantta nie zawiera wszystkich informacji dotyczących sekwencjonowania działań. Nie pokazuje również, czy zasoby są wykorzystywane w najbardziej efektywny sposób.", "enriched_text": "Diagram Gantta nie zawiera wszystkich informacji dotyczących sekwencjonowania działań. Nie pokazuje również, czy zasoby są wykorzystywane w najbardziej efektywny sposób. Ograniczenia te powodują konieczność stosowania narzędzi uzupełniających."}
{"id": "wyklad4_s17_c1", "lecture": "wyklad4", "slide": 17, "title": "Zależności w diagramie sieciowym", "text": "W diagramie sieciowym wyróżnia się zależności KP, PP, PK oraz KK. KP oznacza, że pierwsze działanie musi być ukończone, aby można było rozpocząć drugie; PP oznacza, że działanie drugie nie może zacząć się wcześniej niż działanie pierwsze. PK oznacza, że działanie drugie nie może skończyć się wcześniej niż rozpocznie się działanie pierwsze, a KK oznacza, że działanie drugie nie może zakończyć się wcześniej niż zakończy się działanie pierwsze. Zależności typu KP są najmniej ryzykowne, dlatego budowę bazowego diagramu często zaczyna się od nich, a pozostałe relacje dodaje później w celu uszczegółowienia.", "enriched_text": "W diagramie sieciowym wyróżnia się zależności KP, PP, PK oraz KK. KP oznacza, że pierwsze działanie musi być ukończone, aby można było rozpocząć drugie; PP oznacza, że działanie drugie nie może zacząć się wcześniej niż działanie pierwsze. PK oznacza, że działanie drugie nie może skończyć się wcześniej niż rozpocznie się działanie pierwsze, a KK oznacza, że działanie drugie nie może zakończyć się wcześniej niż zakończy się działanie pierwsze. Zależności typu KP są najmniej ryzykowne, dlatego budowę bazowego diagramu często zaczyna się od nich, a pozostałe relacje dodaje później w celu uszczegółowienia. Rodzaje zależności determinują sposób sekwencjonowania zadań w projekcie."}
{"id": "wyklad4_s18_c1", "lecture": "wyklad4", "slide": 18, "title": "Ograniczenia w diagramie sieciowym", "text": "Diagram sieciowy uwzględnia różne typy ograniczeń, m.in. logiczne, czasowe, zasobowe, zarządcze oraz międzyprojektowe. Ograniczenia te wpływają na kolejność i sposób realizacji zadań.", "enriched_text": "Diagram sieciowy uwzględnia różne typy ograniczeń, m.in. logiczne, czasowe, zasobowe, zarządcze oraz międzyprojektowe. Ograniczenia te wpływają na kolejność i sposób realizacji zadań. Ograniczenia definiują ramy możliwych harmonogramów projektu."}
{"id": "wyklad4_s19_c1", "lecture": "wyklad4", "slide": 19, "title": "Skracanie harmonogramu projektu", "text": "Skracanie harmonogramu polega m.in. na realizacji działań równoległych, dzieleniu zadań oraz przesuwaniu marginesów bezpieczeństwa. Ścieżka krytyczna może zmieniać się w trakcie realizacji projektu.", "enriched_text": "Skracanie harmonogramu polega m.in. na realizacji działań równoległych, dzieleniu zadań oraz przesuwaniu marginesów bezpieczeństwa. Ścieżka krytyczna może zmieniać się w trakcie realizacji projektu. Działania skracające harmonogram wymagają ostrożnej analizy ryzyka."}
{"id": "wyklad4_s20_c1", "lecture": "wyklad4", "slide": 20, "title": "Role w zarządzaniu zespołem", "text": "Menadżer projektu odpowiada za realizację projektu w określonym czasie, budżecie i zgodnie z warunkami satysfakcji. Kierownik liniowy odpowiada za zarządzanie pracownikami oraz dostarczenie odpowiednich zasobów ludzkich.", "enriched_text": "Menadżer projektu odpowiada za realizację projektu w określonym czasie, budżecie i zgodnie z warunkami satysfakcji. Kierownik liniowy odpowiada za zarządzanie pracownikami oraz dostarczenie odpowiednich zasobów ludzkich. Rozdział ról wpływa na sposób podejmowania decyzji w projekcie."}
{"id": "wyklad4_s20_c2", "lecture": "wyklad4", "slide": 20, "title": "Relacja celów w organizacji", "text": "Cele menadżera projektu, kierownika liniowego oraz organizacji mogą się różnić. Skuteczne zarządzanie zespołem wymaga ich wzajemnego dopasowania.", "enriched_text": "Cele menadżera projektu, kierownika liniowego oraz organizacji mogą się różnić. Skuteczne zarządzanie zespołem wymaga ich wzajemnego dopasowania. Spójność celów ogranicza konflikty i wspiera efektywną współpracę."}
{"id": "wyklad5_s3_c1", "lecture": "wyklad5", "slide": 3, "title": "Czynniki motywacyjne i higieniczne", "text": "W zarządzaniu zespołem wyróżnia się czynniki motywacyjne oraz czynniki higieniczne. Podział ten opisuje różnicę pomiędzy elementami, które zwiększają zaangażowanie pracowników, a tymi, których brak prowadzi do spadku wydajności pracy.", "enriched_text": "W zarządzaniu zespołem wyróżnia się czynniki motywacyjne oraz czynniki higieniczne. Podział ten opisuje różnicę pomiędzy elementami, które zwiększają zaangażowanie pracowników, a tymi, których brak prowadzi do spadku wydajności pracy. Podział ten pozwala lepiej zrozumieć, dlaczego nie wszystkie działania menadżerskie wpływają na wzrost motywacji w ten sam sposób."}
{"id": "wyklad5_s3_c2", "lecture": "wyklad5", "slide": 3, "title": "Czynniki motywacyjne", "text": "Czynniki motywacyjne to zachowania i sytuacje mające pozytywny wpływ na pracownika. Zachęcają one do większego zaangażowania oraz wyższej wydajności pracy.", "enriched_text": "Czynniki motywacyjne to zachowania i sytuacje mające pozytywny wpływ na pracownika. Zachęcają one do większego zaangażowania oraz wyższej wydajności pracy. Czynniki te odnoszą się głównie do treści pracy i poczucia sensu wykonywanych zadań."}
{"id": "wyklad5_s3_c3", "lecture": "wyklad5", "slide": 3, "title": "Czynniki higieniczne", "text": "Czynniki higieniczne to elementy środowiska pracy, których brak wpływa negatywnie na wydajność. Ich obecność nie zawsze zwiększa motywację, ale ich niespełnienie prowadzi do demotywacji pracowników.", "enriched_text": "Czynniki higieniczne to elementy środowiska pracy, których brak wpływa negatywnie na wydajność. Ich obecność nie zawsze zwiększa motywację, ale ich niespełnienie prowadzi do demotywacji pracowników. Zapewnienie czynników higienicznych jest warunkiem koniecznym, choć niewystarczającym, do utrzymania efektywności zespołu."}
{"id": "wyklad5_s4_c1", "lecture": "wyklad5", "slide": 4, "title": "Motywacja zespołu według Herzberga – czynniki motywacyjne", "text": "Według Herzberga do czynników motywacyjnych należą osiągnięcia, uznanie, ścieżka kariery, odpowiedzialność oraz sama praca. Czynniki te związane są bezpośrednio z treścią wykonywanych zadań.", "enriched_text": "Według Herzberga do czynników motywacyjnych należą osiągnięcia, uznanie, ścieżka kariery, odpowiedzialność oraz sama praca. Czynniki te związane są bezpośrednio z treścią wykonywanych zadań. Czynniki motywacyjne Herzberga wzmacniają wewnętrzną motywację pracowników."}
{"id": "wyklad5_s4_c2", "lecture": "wyklad5", "slide": 4, "title": "Motywacja zespołu według Herzberga – czynniki higieniczne", "text": "Czynniki higieniczne według Herzberga obejmują politykę firmy, praktyki zarządzania, warunki pracy, nadzór techniczny, relacje międzyludzkie, pewność zatrudnienia oraz wynagrodzenie. Ich rola polega na zapobieganiu niezadowoleniu pracowników.", "enriched_text": "Czynniki higieniczne według Herzberga obejmują politykę firmy, praktyki zarządzania, warunki pracy, nadzór techniczny, relacje międzyludzkie, pewność zatrudnienia oraz wynagrodzenie. Ich rola polega na zapobieganiu niezadowoleniu pracowników. Braki w obszarze czynników higienicznych szybko prowadzą do spadku satysfakcji z pracy."}
{"id": "wyklad5_s5_c1", "lecture": "wyklad5", "slide": 5, "title": "Motywacja zespołu według Cougera", "text": "Model Cougera porządkuje czynniki motywacyjne od najbardziej związanych z charakterem pracy do najbardziej środowiskowych. Czynniki z górnej części listy działają motywująco, natomiast te z dolnej części mogą pełnić funkcję demotywacyjną.", "enriched_text": "Model Cougera porządkuje czynniki motywacyjne od najbardziej związanych z charakterem pracy do najbardziej środowiskowych. Czynniki z górnej części listy działają motywująco, natomiast te z dolnej części mogą pełnić funkcję demotywacyjną. Model ten pokazuje, że nie wszystkie bodźce mają taki sam wpływ na długoterminową motywację."}
{"id": "wyklad5_s6_c1", "lecture": "wyklad5", "slide": 6, "title": "Czynniki motywacyjne możliwe do kształtowania w projekcie", "text": "W ramach projektu menadżer może wpływać na motywację zespołu poprzez stawianie wyzwań, okazywanie uznania oraz urozmaicanie pracy. Istotne jest również umożliwianie zdobywania nowych umiejętności.", "enriched_text": "W ramach projektu menadżer może wpływać na motywację zespołu poprzez stawianie wyzwań, okazywanie uznania oraz urozmaicanie pracy. Istotne jest również umożliwianie zdobywania nowych umiejętności. Działania te wzmacniają zaangażowanie zespołu bez konieczności stosowania bodźców materialnych."}
{"id": "wyklad5_s6_c2", "lecture": "wyklad5", "slide": 6, "title": "Autonomia i informacja zwrotna", "text": "Motywację zespołu zwiększa autonomia w zakresie czasu pracy i sposobu rozwiązywania problemów. Ważnym elementem są także regularne informacje zwrotne, zarówno pozytywne, jak i negatywne.", "enriched_text": "Motywację zespołu zwiększa autonomia w zakresie czasu pracy i sposobu rozwiązywania problemów. Ważnym elementem są także regularne informacje zwrotne, zarówno pozytywne, jak i negatywne. Autonomia i feedback wspierają poczucie odpowiedzialności i rozwoju pracowników."}
{"id": "wyklad5_s7_c1", "lecture": "wyklad5", "slide": 7, "title": "Uprawnienia i odpowiedzialność w zespole", "text": "Organizacja zespołu obejmuje jasne określenie uprawnień i odpowiedzialności jego członków. Pozwala to uniknąć nieporozumień i zwiększa skuteczność współpracy.", "enriched_text": "Organizacja zespołu obejmuje jasne określenie uprawnień i odpowiedzialności jego członków. Pozwala to uniknąć nieporozumień i zwiększa skuteczność współpracy. Jasny podział ról sprzyja sprawnej realizacji zadań projektowych."}
{"id": "wyklad5_s7_c2", "lecture": "wyklad5", "slide": 7, "title": "Style uczenia i równoważenie zespołu", "text": "W zespole wyróżnia się różne style uczenia, takie jak asymilacyjny, dywergencyjny, akomodacyjny oraz konwergencyjny. Dążenie do zrównoważonego zespołu polega na łączeniu tych stylów lub rozwijaniu brakujących kompetencji.", "enriched_text": "W zespole wyróżnia się różne style uczenia, takie jak asymilacyjny, dywergencyjny, akomodacyjny oraz konwergencyjny. Dążenie do zrównoważonego zespołu polega na łączeniu tych stylów lub rozwijaniu brakujących kompetencji. Zróżnicowanie stylów uczenia zwiększa zdolność zespołu do rozwiązywania problemów."}
{"id": "wyklad5_s8_c1", "lecture": "wyklad5", "slide": 8, "title": "Rozwiązywanie problemów w zespole", "text": "Rozwiązywanie problemów może być realizowane według modelu Creative Problem Solving. Proces obejmuje definiowanie problemu, generowanie pomysłów, ich ocenę, tworzenie planu wdrożenia oraz działanie.", "enriched_text": "Rozwiązywanie problemów może być realizowane według modelu Creative Problem Solving. Proces obejmuje definiowanie problemu, generowanie pomysłów, ich ocenę, tworzenie planu wdrożenia oraz działanie. Model ten porządkuje pracę zespołu nad problemem w logiczną sekwencję kroków."}
{"id": "wyklad5_s8_c2", "lecture": "wyklad5", "slide": 8, "title": "Modele podejmowania decyzji", "text": "W pracy zespołowej stosuje się różne modele podejmowania decyzji, takie jak dyrektywny, partycypacyjny oraz konsultacyjny. Różnią się one szybkością decyzji oraz poziomem zaangażowania zespołu.", "enriched_text": "W pracy zespołowej stosuje się różne modele podejmowania decyzji, takie jak dyrektywny, partycypacyjny oraz konsultacyjny. Różnią się one szybkością decyzji oraz poziomem zaangażowania zespołu. Dobór modelu decyzji zależy od sytuacji oraz charakteru problemu."}
{"id": "wyklad5_s8_c3", "lecture": "wyklad5", "slide": 8, "title": "Rozwiązywanie konfliktów", "text": "Konflikty w zespole mogą być rozwiązywane poprzez unikanie, walkę lub współpracę. Współpraca polega na otwartej wymianie opinii i poszukiwaniu wspólnego rozwiązania.", "enriched_text": "Konflikty w zespole mogą być rozwiązywane poprzez unikanie, walkę lub współpracę. Współpraca polega na otwartej wymianie opinii i poszukiwaniu wspólnego rozwiązania. Współpraca sprzyja trwałym rozwiązaniom i budowaniu zaufania w zespole."}
{"id": "wyklad5_s9_c1", "lecture": "wyklad5", "slide": 9, "title": "Budowanie konsensusu", "text": "Budowanie konsensusu polega na wspólnej dyskusji nad rozwiązaniami i opiniami członków zespołu. Porozumienie osiąga się poprzez argumenty merytoryczne, a nie głosowanie.", "enriched_text": "Budowanie konsensusu polega na wspólnej dyskusji nad rozwiązaniami i opiniami członków zespołu. Porozumienie osiąga się poprzez argumenty merytoryczne, a nie głosowanie. Konsensus zwiększa akceptację decyzji przez zespół."}
{"id": "wyklad5_s9_c2", "lecture": "wyklad5", "slide": 9, "title": "Burza mózgów", "text": "Burza mózgów polega na swobodnym zgłaszaniu pomysłów bez ich oceniania. Następnie pomysły są dyskutowane i rozwijane w sposób prowadzący do efektu synergii.", "enriched_text": "Burza mózgów polega na swobodnym zgłaszaniu pomysłów bez ich oceniania. Następnie pomysły są dyskutowane i rozwijane w sposób prowadzący do efektu synergii. Metoda ta sprzyja kreatywności i generowaniu innowacyjnych rozwiązań."}
{"id": "wyklad5_s9_c3", "lecture": "wyklad5", "slide": 9, "title": "Organizacja spotkań zespołu", "text": "Efektywna praca zespołu wymaga regularnych spotkań z jasno określoną agendą. Ważne są także role koordynatora spotkania oraz prowadzenie i udostępnianie protokołów.", "enriched_text": "Efektywna praca zespołu wymaga regularnych spotkań z jasno określoną agendą. Ważne są także role koordynatora spotkania oraz prowadzenie i udostępnianie protokołów. Dobra organizacja spotkań zwiększa efektywność komunikacji zespołowej."}
{"id": "wyklad5_s11_c1", "lecture": "wyklad5", "slide": 11, "title": "Komunikacja w projekcie", "text": "Komunikacja w projekcie jest procesem wymiany informacji pomiędzy jego uczestnikami. Może mieć charakter wewnętrzny, określany jako komunikacja twarda, oraz zewnętrzny, związany z interesariuszami.", "enriched_text": "Komunikacja w projekcie jest procesem wymiany informacji pomiędzy jego uczestnikami. Może mieć charakter wewnętrzny, określany jako komunikacja twarda, oraz zewnętrzny, związany z interesariuszami. Sprawna komunikacja wspiera koordynację działań projektowych."}
{"id": "wyklad5_s11_c2", "lecture": "wyklad5", "slide": 11, "title": "Protokół komunikacyjny", "text": "Protokół komunikacyjny określa sposób wymiany informacji, organizację danych oraz format wypowiedzi. Najczęściej obejmuje on powitanie, właściwą informację oraz kontrolę poprawności przekazu.", "enriched_text": "Protokół komunikacyjny określa sposób wymiany informacji, organizację danych oraz format wypowiedzi. Najczęściej obejmuje on powitanie, właściwą informację oraz kontrolę poprawności przekazu. Protokół komunikacyjny zwiększa jednoznaczność i spójność przekazywanych informacji."}
{"id": "wyklad5_s12_c1", "lecture": "wyklad5", "slide": 12, "title": "Zasady dobrej komunikacji projektowej", "text": "Dobra komunikacja projektowa wymaga planu, sprawnego sposobu dystrybucji informacji oraz odpowiednich narzędzi i metod. Istotne jest także określenie odpowiedzialności za przygotowanie i przekazywanie informacji.", "enriched_text": "Dobra komunikacja projektowa wymaga planu, sprawnego sposobu dystrybucji informacji oraz odpowiednich narzędzi i metod. Istotne jest także określenie odpowiedzialności za przygotowanie i przekazywanie informacji. Plan komunikacji porządkuje przepływ informacji w projekcie."}
{"id": "wyklad5_s13_c1", "lecture": "wyklad5", "slide": 13, "title": "Cele zarządzania komunikacją", "text": "Celem zarządzania komunikacją jest wymiana informacji i wiedzy, podsumowanie prac na danym etapie oraz wspieranie rozwiązywania problemów i podejmowania decyzji.", "enriched_text": "Celem zarządzania komunikacją jest wymiana informacji i wiedzy, podsumowanie prac na danym etapie oraz wspieranie rozwiązywania problemów i podejmowania decyzji. Zarządzanie komunikacją wspiera efektywność pracy zespołu."}
{"id": "wyklad5_s13_c2", "lecture": "wyklad5", "slide": 13, "title": "Sposoby komunikacji w projekcie", "text": "W projekcie stosuje się różne sposoby komunikacji, takie jak spotkania, prezentacje wyników, repozytoria dokumentów, rozmowy bezpośrednie oraz komunikację pisemną i elektroniczną.", "enriched_text": "W projekcie stosuje się różne sposoby komunikacji, takie jak spotkania, prezentacje wyników, repozytoria dokumentów, rozmowy bezpośrednie oraz komunikację pisemną i elektroniczną. Dobór kanału komunikacji wpływa na skuteczność przekazu."}
{"id": "wyklad5_s15_c1", "lecture": "wyklad5", "slide": 15, "title": "Kanały dystrybucji informacji", "text": "W praktyce konieczne jest opracowanie formalnych kanałów dystrybucji informacji w projekcie. Pozwala to zaangażować wszystkich uczestników i usprawnić obieg informacji.", "enriched_text": "W praktyce konieczne jest opracowanie formalnych kanałów dystrybucji informacji w projekcie. Pozwala to zaangażować wszystkich uczestników i usprawnić obieg informacji. Formalizacja kanałów ogranicza ryzyko utraty istotnych informacji."}
{"id": "wyklad5_s16_c1", "lecture": "wyklad5", "slide": 16, "title": "Problemy komunikacyjne w projektach", "text": "Problemy komunikacyjne obejmują m.in. niejasną terminologię, ograniczoną perspektywę uczestników oraz opóźnienia w przekazywaniu informacji. Mogą one prowadzić do powielania pracy, błędnych decyzji i braku uczenia się na doświadczeniach.", "enriched_text": "Problemy komunikacyjne obejmują m.in. niejasną terminologię, ograniczoną perspektywę uczestników oraz opóźnienia w przekazywaniu informacji. Mogą one prowadzić do powielania pracy, błędnych decyzji i braku uczenia się na doświadczeniach. Problemy komunikacyjne są jedną z częstszych przyczyn niepowodzeń projektów."}
{"id": "wyklad6_s3_c1", "lecture": "wyklad6", "slide": 3, "title": "PRINCE2 – definicja metodyki", "text": "PRINCE2 (Projects IN Controlled Environments) jest ustrukturyzowaną metodyką zarządzania projektami. Ma charakter ogólny i może być dostosowana do szerokiej gamy projektów oraz integrowana z metodykami specjalistycznymi.", "enriched_text": "PRINCE2 (Projects IN Controlled Environments) jest ustrukturyzowaną metodyką zarządzania projektami. Ma charakter ogólny i może być dostosowana do szerokiej gamy projektów oraz integrowana z metodykami specjalistycznymi. Metodyka ta dostarcza uporządkowanych ram zarządzania, pozostawiając elastyczność w doborze narzędzi i technik specyficznych dla danego projektu."}
{"id": "wyklad6_s3_c2", "lecture": "wyklad6", "slide": 3, "title": "Zakres zarządzania w PRINCE2", "text": "PRINCE2 koncentruje się na kontroli kosztów, terminów, jakości, zakresu projektu, ryzyka oraz osiąganych korzyści. Metodyka kładzie nacisk na utrzymanie kontroli zarządczej nad projektem.", "enriched_text": "PRINCE2 koncentruje się na kontroli kosztów, terminów, jakości, zakresu projektu, ryzyka oraz osiąganych korzyści. Metodyka kładzie nacisk na utrzymanie kontroli zarządczej nad projektem. Zakres ten obejmuje kluczowe obszary decyzyjne, które determinują powodzenie projektu z perspektywy zarządczej."}
{"id": "wyklad6_s3_c3", "lecture": "wyklad6", "slide": 3, "title": "Elementy składowe PRINCE2", "text": "PRINCE2 składa się z siedmiu pryncypiów, siedmiu tematów oraz siedmiu procesów opisujących cykl życia projektu. Czwartym elementem jest środowisko projektu, do którego metodyka musi zostać dostosowana.", "enriched_text": "PRINCE2 składa się z siedmiu pryncypiów, siedmiu tematów oraz siedmiu procesów opisujących cykl życia projektu. Czwartym elementem jest środowisko projektu, do którego metodyka musi zostać dostosowana. Struktura ta porządkuje metodykę i wskazuje, że jej stosowanie zawsze powinno uwzględniać kontekst organizacyjny."}
{"id": "wyklad6_s4_c1", "lecture": "wyklad6", "slide": 4, "title": "Zakres działań poza PRINCE2", "text": "PRINCE2 celowo nie obejmuje działań specjalistycznych, szczegółowych technik oraz zdolności przywódczych. Elementy te uznawane są za istotne, lecz zależne od branży, organizacji i specyfiki projektu.", "enriched_text": "PRINCE2 celowo nie obejmuje działań specjalistycznych, szczegółowych technik oraz zdolności przywódczych. Elementy te uznawane są za istotne, lecz zależne od branży, organizacji i specyfiki projektu. Ograniczenie zakresu metodyki pozwala zachować jej uniwersalność."}
{"id": "wyklad6_s4_c2", "lecture": "wyklad6", "slide": 4, "title": "Integracja PRINCE2 z innymi podejściami", "text": "Działania pozostawione poza zakresem PRINCE2 powinny zostać samodzielnie włączone do projektu. Pozwala to integrować metodykę z technikami inżynierskimi, planistycznymi i kompetencjami miękkimi.", "enriched_text": "Działania pozostawione poza zakresem PRINCE2 powinny zostać samodzielnie włączone do projektu. Pozwala to integrować metodykę z technikami inżynierskimi, planistycznymi i kompetencjami miękkimi. Integracja umożliwia dostosowanie sposobu pracy do realnych potrzeb projektu."}
{"id": "wyklad6_s5_c1", "lecture": "wyklad6", "slide": 5, "title": "Korzyści stosowania PRINCE2", "text": "PRINCE2 oferuje sprawdzone techniki porządkujące zarządzanie projektami oraz wspólny język komunikacji i dokumentowania. Ułatwia to współpracę i zrozumienie pomiędzy uczestnikami projektu.", "enriched_text": "PRINCE2 oferuje sprawdzone techniki porządkujące zarządzanie projektami oraz wspólny język komunikacji i dokumentowania. Ułatwia to współpracę i zrozumienie pomiędzy uczestnikami projektu. Wspólny język redukuje nieporozumienia organizacyjne w projektach."}
{"id": "wyklad6_s5_c2", "lecture": "wyklad6", "slide": 5, "title": "Kontrola i odpowiedzialność w PRINCE2", "text": "Metodyka zapewnia jasno sprecyzowane obowiązki, strukturę odpowiedzialności oraz mechanizmy delegowania i komunikacji. Wspiera zarządzanie z wykorzystaniem tolerancji i efektywne wykorzystanie czasu kadry kierowniczej.", "enriched_text": "Metodyka zapewnia jasno sprecyzowane obowiązki, strukturę odpowiedzialności oraz mechanizmy delegowania i komunikacji. Wspiera zarządzanie z wykorzystaniem tolerancji i efektywne wykorzystanie czasu kadry kierowniczej. Wyraźny podział odpowiedzialności usprawnia podejmowanie decyzji."}
{"id": "wyklad6_s5_c3", "lecture": "wyklad6", "slide": 5, "title": "Uczenie się i audyt w PRINCE2", "text": "PRINCE2 promuje uczenie się organizacji oraz ciągłe doskonalenie. Ułatwia śledzenie postępów prac i przeprowadzanie audytów projektowych.", "enriched_text": "PRINCE2 promuje uczenie się organizacji oraz ciągłe doskonalenie. Ułatwia śledzenie postępów prac i przeprowadzanie audytów projektowych. Nacisk na uczenie się sprzyja poprawie jakości kolejnych projektów."}
{"id": "wyklad6_s6_c1", "lecture": "wyklad6", "slide": 6, "title": "Pryncypia PRINCE2 – charakter", "text": "Pryncypia PRINCE2 są uniwersalne, samopotwierdzające i inspirujące. Muszą być spełnione, aby projekt był uznany za zgodny z metodyką PRINCE2.", "enriched_text": "Pryncypia PRINCE2 są uniwersalne, samopotwierdzające i inspirujące. Muszą być spełnione, aby projekt był uznany za zgodny z metodyką PRINCE2. Pryncypia stanowią fundament metodyki i warunek jej poprawnego stosowania."}
{"id": "wyklad6_s6_c2", "lecture": "wyklad6", "slide": 6, "title": "Siedem pryncypiów PRINCE2", "text": "Siedem pryncypiów PRINCE2 to: ciągła zasadność biznesowa, korzystanie z doświadczeń, zdefiniowane role i obowiązki, zarządzanie etapowe, zarządzanie z wykorzystaniem tolerancji, koncentracja na produktach oraz dostosowanie do warunków projektu.", "enriched_text": "Siedem pryncypiów PRINCE2 to: ciągła zasadność biznesowa, korzystanie z doświadczeń, zdefiniowane role i obowiązki, zarządzanie etapowe, zarządzanie z wykorzystaniem tolerancji, koncentracja na produktach oraz dostosowanie do warunków projektu. Pryncypia te wyznaczają sposób myślenia o projekcie i jego prowadzeniu."}
{"id": "wyklad6_s7_c1", "lecture": "wyklad6", "slide": 7, "title": "Ciągła zasadność biznesowa", "text": "Projekt zgodny z PRINCE2 musi posiadać uzasadniony powód rozpoczęcia oraz aktualne uzasadnienie przez cały czas trwania projektu. Uzasadnienie biznesowe jest dokumentowane, zatwierdzane i wykorzystywane w procesach decyzyjnych.", "enriched_text": "Projekt zgodny z PRINCE2 musi posiadać uzasadniony powód rozpoczęcia oraz aktualne uzasadnienie przez cały czas trwania projektu. Uzasadnienie biznesowe jest dokumentowane, zatwierdzane i wykorzystywane w procesach decyzyjnych. Zasada ta chroni organizację przed kontynuowaniem nieopłacalnych projektów."}
{"id": "wyklad6_s7_c2", "lecture": "wyklad6", "slide": 7, "title": "Zarządzanie projektem poprzez uzasadnienie biznesowe", "text": "Uzasadnienie biznesowe ukierunkowuje projekt na zgodność z celami organizacji i oczekiwanymi korzyściami. Projekt, który traci zasadność biznesową, powinien zostać przerwany, aby nie trwonić zasobów.", "enriched_text": "Uzasadnienie biznesowe ukierunkowuje projekt na zgodność z celami organizacji i oczekiwanymi korzyściami. Projekt, który traci zasadność biznesową, powinien zostać przerwany, aby nie trwonić zasobów. Uzasadnienie biznesowe pełni rolę nadrzędnego kryterium decyzyjnego."}
{"id": "wyklad6_s8_c1", "lecture": "wyklad6", "slide": 8, "title": "Korzystanie z doświadczeń – zasada", "text": "PRINCE2 zakłada aktywne korzystanie z doświadczeń z wcześniejszych projektów. Doświadczenia są wyszukiwane, analizowane, zapisywane i wykorzystywane w trakcie całego projektu.", "enriched_text": "PRINCE2 zakłada aktywne korzystanie z doświadczeń z wcześniejszych projektów. Doświadczenia są wyszukiwane, analizowane, zapisywane i wykorzystywane w trakcie całego projektu. Doświadczenia ograniczają powielanie błędów i zwiększają skuteczność działań."}
{"id": "wyklad6_s8_c2", "lecture": "wyklad6", "slide": 8, "title": "Uczenie się w cyklu życia projektu", "text": "Na początku projektu analizuje się doświadczenia z podobnych przedsięwzięć, w trakcie projektu kontynuuje się naukę, a przy zamykaniu projektu przekazuje się zgromadzone wnioski dalej.", "enriched_text": "Na początku projektu analizuje się doświadczenia z podobnych przedsięwzięć, w trakcie projektu kontynuuje się naukę, a przy zamykaniu projektu przekazuje się zgromadzone wnioski dalej. Uczenie się ma charakter ciągły i obejmuje cały cykl życia projektu."}
{"id": "wyklad6_s9_c1", "lecture": "wyklad6", "slide": 9, "title": "Zdefiniowane role i obowiązki", "text": "Projekt zgodny z PRINCE2 posiada jasno określone role i obowiązki w strukturze zarządzania. Struktura ta uwzględnia interesy biznesu, użytkowników oraz dostawców.", "enriched_text": "Projekt zgodny z PRINCE2 posiada jasno określone role i obowiązki w strukturze zarządzania. Struktura ta uwzględnia interesy biznesu, użytkowników oraz dostawców. Uwzględnienie trzech perspektyw zapewnia równowagę interesów w projekcie."}
{"id": "wyklad6_s9_c2", "lecture": "wyklad6", "slide": 9, "title": "Trzej główni interesariusze projektu", "text": "PRINCE2 wyróżnia trzy główne grupy interesariuszy: biznes, użytkowników oraz dostawców. Niespełnienie potrzeb którejkolwiek z tych grup prowadzi do porażki projektu.", "enriched_text": "PRINCE2 wyróżnia trzy główne grupy interesariuszy: biznes, użytkowników oraz dostawców. Niespełnienie potrzeb którejkolwiek z tych grup prowadzi do porażki projektu. Sukces projektu wymaga jednoczesnego uwzględnienia wszystkich trzech punktów widzenia."}
{"id": "wyklad6_s10_c1", "lecture": "wyklad6", "slide": 10, "title": "Zarządzanie etapowe", "text": "W PRINCE2 projekt jest planowany, monitorowany i kontrolowany etap po etapie. Każdy etap kończy się oceną postępów i decyzją o kontynuacji projektu.", "enriched_text": "W PRINCE2 projekt jest planowany, monitorowany i kontrolowany etap po etapie. Każdy etap kończy się oceną postępów i decyzją o kontynuacji projektu. Zarządzanie etapowe umożliwia bieżącą ocenę zasadności dalszych działań."}
{"id": "wyklad6_s10_c2", "lecture": "wyklad6", "slide": 10, "title": "Planowanie etapowe", "text": "Planowanie w PRINCE2 realizowane jest z różnym poziomem szczegółowości. Dla krótkiego okresu przygotowuje się szczegółowy plan etapu, a dla długiego okresu ogólny plan projektu.", "enriched_text": "Planowanie w PRINCE2 realizowane jest z różnym poziomem szczegółowości. Dla krótkiego okresu przygotowuje się szczegółowy plan etapu, a dla długiego okresu ogólny plan projektu. Takie podejście ogranicza nadmierne planowanie odległych etapów."}
{"id": "wyklad6_s11_c1", "lecture": "wyklad6", "slide": 11, "title": "Zarządzanie z wykorzystaniem tolerancji", "text": "PRINCE2 wykorzystuje tolerancje do delegowania uprawnień pomiędzy poziomami zarządzania. Tolerancje wyznaczają granice dopuszczalnych odchyleń od planu.", "enriched_text": "PRINCE2 wykorzystuje tolerancje do delegowania uprawnień pomiędzy poziomami zarządzania. Tolerancje wyznaczają granice dopuszczalnych odchyleń od planu. Mechanizm tolerancji zwiększa efektywność decyzyjną kierownictwa."}
{"id": "wyklad6_s11_c2", "lecture": "wyklad6", "slide": 11, "title": "Obszary tolerancji", "text": "Tolerancje w PRINCE2 definiuje się dla czasu, kosztu, jakości, zakresu, ryzyka oraz korzyści. Pozwala to jasno określić odpowiedzialność decyzyjną na poszczególnych poziomach.", "enriched_text": "Tolerancje w PRINCE2 definiuje się dla czasu, kosztu, jakości, zakresu, ryzyka oraz korzyści. Pozwala to jasno określić odpowiedzialność decyzyjną na poszczególnych poziomach. Obszary tolerancji porządkują zakres odpowiedzialności zarządczej."}
{"id": "wyklad6_s12_c1", "lecture": "wyklad6", "slide": 12, "title": "Eskalacja i mechanizmy sterowania", "text": "W przypadku przekroczenia tolerancji informacja musi zostać natychmiast przekazana na wyższy poziom zarządzania. Zapewnia to podejmowanie decyzji na odpowiednim szczeblu organizacji.", "enriched_text": "W przypadku przekroczenia tolerancji informacja musi zostać natychmiast przekazana na wyższy poziom zarządzania. Zapewnia to podejmowanie decyzji na odpowiednim szczeblu organizacji. Eskalacja chroni projekt przed niekontrolowanymi odchyleniami."}
{"id": "wyklad6_s13_c1", "lecture": "wyklad6", "slide": 13, "title": "Koncentracja na produktach", "text": "PRINCE2 koncentruje się na zdefiniowaniu i dostarczeniu produktów spełniających wymagania jakościowe. Projekt ukierunkowany jest na wyniki, a nie na same działania.", "enriched_text": "PRINCE2 koncentruje się na zdefiniowaniu i dostarczeniu produktów spełniających wymagania jakościowe. Projekt ukierunkowany jest na wyniki, a nie na same działania. Skupienie na produktach ułatwia kontrolę jakości i postępów."}
{"id": "wyklad6_s13_c2", "lecture": "wyklad6", "slide": 13, "title": "Zakres projektu a produkty", "text": "Zakres projektu w PRINCE2 jest definiowany przez zakres produktów. Uzgodnienie produktów i ich jakości stanowi podstawę planowania i kontroli projektu.", "enriched_text": "Zakres projektu w PRINCE2 jest definiowany przez zakres produktów. Uzgodnienie produktów i ich jakości stanowi podstawę planowania i kontroli projektu. Takie podejście ogranicza niejednoznaczność zakresu projektu."}
{"id": "wyklad6_s14_c1", "lecture": "wyklad6", "slide": 14, "title": "Opis Produktu", "text": "Opis Produktu definiuje przeznaczenie, skład, źródło pochodzenia, format oraz kryteria i metody sprawdzania jakości. Tworzony jest dla każdego produktu w projekcie.", "enriched_text": "Opis Produktu definiuje przeznaczenie, skład, źródło pochodzenia, format oraz kryteria i metody sprawdzania jakości. Tworzony jest dla każdego produktu w projekcie. Opis Produktu stanowi punkt odniesienia dla wytwarzania i odbioru rezultatów."}
{"id": "wyklad6_s14_c2", "lecture": "wyklad6", "slide": 14, "title": "Rola Opisów Produktów", "text": "Opisy Produktów wykorzystywane są do szacowania nakładów pracy, wymaganych zasobów, zależności oraz harmonogramowania działań. Pomagają ograniczyć spory o akceptację i niekontrolowane zmiany zakresu.", "enriched_text": "Opisy Produktów wykorzystywane są do szacowania nakładów pracy, wymaganych zasobów, zależności oraz harmonogramowania działań. Pomagają ograniczyć spory o akceptację i niekontrolowane zmiany zakresu. Dokumenty te wspierają stabilność zakresu i kontroli projektu."}
{"id": "wyklad6_s15_c1", "lecture": "wyklad6", "slide": 15, "title": "Dostosowanie metodyki do projektu", "text": "PRINCE2 musi być dostosowana do rozmiaru, złożoności, znaczenia, możliwości i ryzyka projektu. Brak dostosowania prowadzi do nieadekwatnej pracochłonności zarządzania.", "enriched_text": "PRINCE2 musi być dostosowana do rozmiaru, złożoności, znaczenia, możliwości i ryzyka projektu. Brak dostosowania prowadzi do nieadekwatnej pracochłonności zarządzania. Dostosowanie metodyki zwiększa jej efektywność w konkretnym kontekście."}
{"id": "wyklad6_s15_c2", "lecture": "wyklad6", "slide": 15, "title": "Decyzje o dostosowaniu PRINCE2", "text": "Decyzje o sposobie stosowania metodyki podejmują Kierownik Projektu i Komitet Sterujący. Wytyczne dotyczące dostosowania powinny być jasno opisane w Dokumentacji Inicjowania Projektu.", "enriched_text": "Decyzje o sposobie stosowania metodyki podejmują Kierownik Projektu i Komitet Sterujący. Wytyczne dotyczące dostosowania powinny być jasno opisane w Dokumentacji Inicjowania Projektu. Jasne decyzje w tym zakresie ograniczają niejednoznaczności organizacyjne."}
{"id": "wyklad6_s16_c1", "lecture": "wyklad6", "slide": 16, "title": "Tematy PRINCE2 – charakterystyka", "text": "Tematy PRINCE2 opisują aspekty zarządzania projektem, którymi należy zajmować się przez cały czas trwania projektu. Tematy są ze sobą powiązane i uwzględnione w procesach.", "enriched_text": "Tematy PRINCE2 opisują aspekty zarządzania projektem, którymi należy zajmować się przez cały czas trwania projektu. Tematy są ze sobą powiązane i uwzględnione w procesach. Tematy zapewniają spójność zarządzania w całym cyklu życia projektu."}
{"id": "wyklad6_s17_c1", "lecture": "wyklad6", "slide": 17, "title": "Siedem tematów PRINCE2", "text": "Siedem tematów PRINCE2 to: uzasadnienie biznesowe, organizacja, jakość, plany, ryzyko, zmiana oraz postępy. Każdy temat odpowiada na konkretne pytania dotyczące zarządzania projektem.", "enriched_text": "Siedem tematów PRINCE2 to: uzasadnienie biznesowe, organizacja, jakość, plany, ryzyko, zmiana oraz postępy. Każdy temat odpowiada na konkretne pytania dotyczące zarządzania projektem. Tematy te pokrywają kluczowe obszary decyzyjne w projekcie."}
{"id": "wyklad7_s4_c1", "lecture": "wyklad7", "slide": 4, "title": "Tematy PRINCE2 – rola", "text": "Tematy PRINCE2 opisują aspekty zarządzania projektem, którymi należy zajmować się przez cały czas jego trwania. Każdy temat odpowiada na konkretne pytanie wspierające podejmowanie decyzji zarządczych.", "enriched_text": "Tematy PRINCE2 opisują aspekty zarządzania projektem, którymi należy zajmować się przez cały czas jego trwania. Każdy temat odpowiada na konkretne pytanie wspierające podejmowanie decyzji zarządczych. Tematy zapewniają ciągłość zarządzania kluczowymi obszarami projektu niezależnie od etapu jego realizacji."}
{"id": "wyklad7_s4_c2", "lecture": "wyklad7", "slide": 4, "title": "Siedem tematów PRINCE2", "text": "Siedem tematów PRINCE2 to: uzasadnienie biznesowe, organizacja, jakość, plany, ryzyko, zmiana oraz postępy. Tematy te są ze sobą powiązane i wspólnie zapewniają pełną kontrolę nad projektem.", "enriched_text": "Siedem tematów PRINCE2 to: uzasadnienie biznesowe, organizacja, jakość, plany, ryzyko, zmiana oraz postępy. Tematy te są ze sobą powiązane i wspólnie zapewniają pełną kontrolę nad projektem. Wzajemne powiązanie tematów umożliwia spójne i całościowe sterowanie projektem."}
{"id": "wyklad7_s5_c1", "lecture": "wyklad7", "slide": 5, "title": "Organizacja w PRINCE2", "text": "Temat organizacji w PRINCE2 dotyczy ustanowienia struktury odpowiedzialności i obowiązków w projekcie. Celem jest zapewnienie ładu zarządczego oraz jasnego podziału ról na wszystkich poziomach.", "enriched_text": "Temat organizacji w PRINCE2 dotyczy ustanowienia struktury odpowiedzialności i obowiązków w projekcie. Celem jest zapewnienie ładu zarządczego oraz jasnego podziału ról na wszystkich poziomach. Jasna struktura organizacyjna ogranicza niejednoznaczność decyzyjną w projekcie."}
{"id": "wyklad7_s6_c1", "lecture": "wyklad7", "slide": 6, "title": "Poziomy zarządzania projektem", "text": "W PRINCE2 wyróżnia się cztery poziomy zarządzania projektem: kierownictwo organizacji lub programu, zarządzanie strategiczne realizowane przez Komitet Sterujący, zarządzanie operacyjne prowadzone przez Kierownika Projektu oraz dostarczanie produktów przez zespoły.", "enriched_text": "W PRINCE2 wyróżnia się cztery poziomy zarządzania projektem: kierownictwo organizacji lub programu, zarządzanie strategiczne realizowane przez Komitet Sterujący, zarządzanie operacyjne prowadzone przez Kierownika Projektu oraz dostarczanie produktów przez zespoły. Podział na poziomy umożliwia delegowanie odpowiedzialności i zachowanie kontroli strategicznej."}
{"id": "wyklad7_s7_c1", "lecture": "wyklad7", "slide": 7, "title": "Struktura ról w projekcie PRINCE2", "text": "Struktura organizacyjna projektu obejmuje m.in. Komitet Sterujący, Głównego Użytkownika, Przewodniczącego, Głównego Dostawcę, Nadzór Projektu, Kierownika Projektu, Kierowników Zespołów oraz Zespół. Role te mogą występować w jednej lub wielu osobach.", "enriched_text": "Struktura organizacyjna projektu obejmuje m.in. Komitet Sterujący, Głównego Użytkownika, Przewodniczącego, Głównego Dostawcę, Nadzór Projektu, Kierownika Projektu, Kierowników Zespołów oraz Zespół. Role te mogą występować w jednej lub wielu osobach. Elastyczność obsadzania ról pozwala dostosować strukturę do skali projektu."}
{"id": "wyklad7_s8_c1", "lecture": "wyklad7", "slide": 8, "title": "Rola Kierownika Projektu", "text": "Kierownik Projektu odpowiada za codzienne zarządzanie projektem. Jego zadania obejmują planowanie, kontrolę kosztów i harmonogramu, zarządzanie zmianami, jakością, komunikację z interesariuszami oraz monitorowanie postępów.", "enriched_text": "Kierownik Projektu odpowiada za codzienne zarządzanie projektem. Jego zadania obejmują planowanie, kontrolę kosztów i harmonogramu, zarządzanie zmianami, jakością, komunikację z interesariuszami oraz monitorowanie postępów. Rola ta koncentruje się na operacyjnym utrzymaniu projektu w granicach planu."}
{"id": "wyklad7_s9_c1", "lecture": "wyklad7", "slide": 9, "title": "Zasady łączenia ról w PRINCE2", "text": "PRINCE2 dopuszcza łączenie niektórych ról, pod warunkiem zachowania właściwego nadzoru. Przewodniczący nie może być Kierownikiem Projektu, a odpowiedzialności decyzyjnych nie wolno delegować na inne osoby.", "enriched_text": "PRINCE2 dopuszcza łączenie niektórych ról, pod warunkiem zachowania właściwego nadzoru. Przewodniczący nie może być Kierownikiem Projektu, a odpowiedzialności decyzyjnych nie wolno delegować na inne osoby. Zasady te chronią projekt przed konfliktem interesów i utratą kontroli."}
{"id": "wyklad7_s10_c1", "lecture": "wyklad7", "slide": 10, "title": "Uzasadnienie biznesowe – cel", "text": "Uzasadnienie Biznesowe służy ocenie, czy projekt jest korzystny, wykonalny i potrzebny. Stanowi podstawę decyzji o rozpoczęciu, kontynuowaniu lub zakończeniu projektu.", "enriched_text": "Uzasadnienie Biznesowe służy ocenie, czy projekt jest korzystny, wykonalny i potrzebny. Stanowi podstawę decyzji o rozpoczęciu, kontynuowaniu lub zakończeniu projektu. Dokument ten jest nadrzędnym kryterium decyzyjnym w PRINCE2."}
{"id": "wyklad7_s10_c2", "lecture": "wyklad7", "slide": 10, "title": "Odpowiedzialność za Uzasadnienie Biznesowe", "text": "Główny Użytkownik odpowiada za określenie i realizację korzyści, Przewodniczący za zapewnienie zgodności korzyści z celami organizacji, a Główny Dostawca za wykonalność produktów. Opracowanie dokumentu może być delegowane, lecz odpowiedzialność pozostaje.", "enriched_text": "Główny Użytkownik odpowiada za określenie i realizację korzyści, Przewodniczący za zapewnienie zgodności korzyści z celami organizacji, a Główny Dostawca za wykonalność produktów. Opracowanie dokumentu może być delegowane, lecz odpowiedzialność pozostaje. Rozdział odpowiedzialności zapewnia równowagę perspektyw biznesowych i technicznych."}
{"id": "wyklad7_s11_c1", "lecture": "wyklad7", "slide": 11, "title": "Znaczenie korzyści biznesowych", "text": "Produkty projektu umożliwiają zmiany biznesowe, które prowadzą do osiągania korzyści. Korzyści mogą mieć również skutki uboczne i długofalowe konsekwencje, dlatego muszą być analizowane i potwierdzane w czasie.", "enriched_text": "Produkty projektu umożliwiają zmiany biznesowe, które prowadzą do osiągania korzyści. Korzyści mogą mieć również skutki uboczne i długofalowe konsekwencje, dlatego muszą być analizowane i potwierdzane w czasie. Korzyści nie zawsze są natychmiastowe i wymagają dalszego monitorowania po projekcie."}
{"id": "wyklad7_s11_c2", "lecture": "wyklad7", "slide": 11, "title": "Plan Przeglądu Korzyści", "text": "Plan Przeglądu Korzyści określa, które korzyści mogą zostać potwierdzone w trakcie projektu, a które po jego zakończeniu. Odpowiedzialność za potwierdzanie korzyści po projekcie jest przekazywana do organizacji.", "enriched_text": "Plan Przeglądu Korzyści określa, które korzyści mogą zostać potwierdzone w trakcie projektu, a które po jego zakończeniu. Odpowiedzialność za potwierdzanie korzyści po projekcie jest przekazywana do organizacji. Plan ten porządkuje ocenę efektów projektu w dłuższej perspektywie."}
{"id": "wyklad7_s12_c1", "lecture": "wyklad7", "slide": 12, "title": "Zawartość Uzasadnienia Biznesowego", "text": "Dokument Uzasadnienie Biznesowe zawiera m.in. powody podjęcia projektu, możliwe warianty rozwiązań, oczekiwane korzyści, niepożądane skutki, terminy, koszty, ocenę inwestycji oraz główne ryzyka.", "enriched_text": "Dokument Uzasadnienie Biznesowe zawiera m.in. powody podjęcia projektu, możliwe warianty rozwiązań, oczekiwane korzyści, niepożądane skutki, terminy, koszty, ocenę inwestycji oraz główne ryzyka. Zakres dokumentu umożliwia kompleksową ocenę zasadności projektu."}
{"id": "wyklad7_s13_c1", "lecture": "wyklad7", "slide": 13, "title": "Jakość w PRINCE2 – cel", "text": "Temat jakości w PRINCE2 dotyczy określenia i wdrożenia środków zapewniających, że produkty spełniają swoje przeznaczenie. Jakość ma umożliwić osiągnięcie oczekiwanych korzyści biznesowych.", "enriched_text": "Temat jakości w PRINCE2 dotyczy określenia i wdrożenia środków zapewniających, że produkty spełniają swoje przeznaczenie. Jakość ma umożliwić osiągnięcie oczekiwanych korzyści biznesowych. Jakość jest postrzegana jako środek do realizacji korzyści, a nie cel sam w sobie."}
{"id": "wyklad7_s14_c1", "lecture": "wyklad7", "slide": 14, "title": "Nadzór jakości", "text": "W PRINCE2 zaleca się ustanowienie niezależnego Nadzoru Jakości po stronie organizacji. Zapewnia on zgodność projektu ze standardami organizacyjnymi i polityką jakości.", "enriched_text": "W PRINCE2 zaleca się ustanowienie niezależnego Nadzoru Jakości po stronie organizacji. Zapewnia on zgodność projektu ze standardami organizacyjnymi i polityką jakości. Niezależność nadzoru zwiększa obiektywność oceny jakości."}
{"id": "wyklad7_s15_c1", "lecture": "wyklad7", "slide": 15, "title": "Planowanie i kontrola jakości", "text": "Planowanie jakości obejmuje oczekiwania klienta, kryteria akceptacji, Opisy Produktów oraz metody jakości. Kontrola jakości realizowana jest poprzez rejestry jakości, zapisy przeglądów i akceptacji produktów.", "enriched_text": "Planowanie jakości obejmuje oczekiwania klienta, kryteria akceptacji, Opisy Produktów oraz metody jakości. Kontrola jakości realizowana jest poprzez rejestry jakości, zapisy przeglądów i akceptacji produktów. Połączenie planowania i kontroli zapewnia spójne zarządzanie jakością."}
{"id": "wyklad7_s16_c1", "lecture": "wyklad7", "slide": 16, "title": "Kryteria jakości i akceptacji", "text": "Kryteria jakości powinny być skupione wokół oczekiwań klienta i uszczegółowione w Opisach Produktów wraz z tolerancjami. Akceptacja produktów potwierdza spełnienie ustalonych wymagań jakościowych.", "enriched_text": "Kryteria jakości powinny być skupione wokół oczekiwań klienta i uszczegółowione w Opisach Produktów wraz z tolerancjami. Akceptacja produktów potwierdza spełnienie ustalonych wymagań jakościowych. Akceptacja formalizuje zakończenie prac nad produktem."}
{"id": "wyklad7_s17_c1", "lecture": "wyklad7", "slide": 17, "title": "Plany w PRINCE2", "text": "Temat planów w PRINCE2 służy komunikacji i sterowaniu projektem poprzez określenie sposobu dostarczania produktów. Planowanie oparte jest na produktach, a nie wyłącznie na działaniach.", "enriched_text": "Temat planów w PRINCE2 służy komunikacji i sterowaniu projektem poprzez określenie sposobu dostarczania produktów. Planowanie oparte jest na produktach, a nie wyłącznie na działaniach. Planowanie produktowe zwiększa przejrzystość zakresu i odpowiedzialności."}
{"id": "wyklad7_s18_c1", "lecture": "wyklad7", "slide": 18, "title": "Rodzaje planów", "text": "W PRINCE2 wyróżnia się Plan Projektu, Plany Etapów, Plany Zespołów oraz Plany Nadzwyczajne. Różnią się one poziomem szczegółowości i przeznaczeniem zarządczym.", "enriched_text": "W PRINCE2 wyróżnia się Plan Projektu, Plany Etapów, Plany Zespołów oraz Plany Nadzwyczajne. Różnią się one poziomem szczegółowości i przeznaczeniem zarządczym. Różne typy planów wspierają zarządzanie na odmiennych poziomach szczegółowości."}
{"id": "wyklad7_s19_c1", "lecture": "wyklad7", "slide": 19, "title": "Plan Projektu", "text": "Plan Projektu określa docelowe terminy, koszty, zakres, jakość oraz główne produkty i zasoby. Stanowi punkt odniesienia dla Komitetu Sterującego przy ocenie postępów.", "enriched_text": "Plan Projektu określa docelowe terminy, koszty, zakres, jakość oraz główne produkty i zasoby. Stanowi punkt odniesienia dla Komitetu Sterującego przy ocenie postępów. Plan Projektu pełni funkcję bazową dla nadzoru strategicznego."}
{"id": "wyklad7_s20_c1", "lecture": "wyklad7", "slide": 20, "title": "Plany Etapów", "text": "Plany Etapów są bardziej szczegółowe niż Plan Projektu i obejmują wybrany zakres prac. Służą Kierownikowi Projektu do bieżącej kontroli realizacji etapu.", "enriched_text": "Plany Etapów są bardziej szczegółowe niż Plan Projektu i obejmują wybrany zakres prac. Służą Kierownikowi Projektu do bieżącej kontroli realizacji etapu. Szczegółowość planów etapów wspiera operacyjne zarządzanie projektem."}
{"id": "wyklad7_s22_c1", "lecture": "wyklad7", "slide": 22, "title": "Plany Nadzwyczajne", "text": "Plan Nadzwyczajny jest przygotowywany w przypadku przekroczenia tolerancji. Po zatwierdzeniu zastępuje Plan Projektu lub Plan Etapu, którego dotyczy.", "enriched_text": "Plan Nadzwyczajny jest przygotowywany w przypadku przekroczenia tolerancji. Po zatwierdzeniu zastępuje Plan Projektu lub Plan Etapu, którego dotyczy. Plany nadzwyczajne umożliwiają kontrolowane reagowanie na odchylenia."}
{"id": "wyklad7_s24_c1", "lecture": "wyklad7", "slide": 24, "title": "Ryzyko w PRINCE2", "text": "Zarządzanie ryzykiem w PRINCE2 polega na identyfikacji, ocenie i sterowaniu niepewnością. Stosowane jest na różnych poziomach: strategicznym, operacyjnym, programu i projektu.", "enriched_text": "Zarządzanie ryzykiem w PRINCE2 polega na identyfikacji, ocenie i sterowaniu niepewnością. Stosowane jest na różnych poziomach: strategicznym, operacyjnym, programu i projektu. Podejście to zapewnia spójność zarządzania ryzykiem w całej organizacji."}
{"id": "wyklad7_s26_c1", "lecture": "wyklad7", "slide": 26, "title": "Strategia Zarządzania Ryzykiem", "text": "Każdy projekt PRINCE2 posiada Strategię Zarządzania Ryzykiem oraz Rejestr Ryzyk. Strategia określa podejście do ryzyka, w tym tolerancje i akceptowalny poziom ryzyka.", "enriched_text": "Każdy projekt PRINCE2 posiada Strategię Zarządzania Ryzykiem oraz Rejestr Ryzyk. Strategia określa podejście do ryzyka, w tym tolerancje i akceptowalny poziom ryzyka. Strategia wyznacza ramy decyzyjne dla działań związanych z ryzykiem."}
{"id": "wyklad7_s27_c1", "lecture": "wyklad7", "slide": 27, "title": "Zarządzanie zmianą – cel", "text": "Zarządzanie zmianą w PRINCE2 polega na identyfikacji, ocenie i sterowaniu wszystkimi zmianami wpływającymi na zatwierdzone aspekty projektu. Celem jest zachowanie kontroli i reagowanie na potrzeby interesariuszy.", "enriched_text": "Zarządzanie zmianą w PRINCE2 polega na identyfikacji, ocenie i sterowaniu wszystkimi zmianami wpływającymi na zatwierdzone aspekty projektu. Celem jest zachowanie kontroli i reagowanie na potrzeby interesariuszy. Formalizacja zmian ogranicza niekontrolowane modyfikacje projektu."}
{"id": "wyklad7_s29_c1", "lecture": "wyklad7", "slide": 29, "title": "Rodzaje zagadnień", "text": "W PRINCE2 wyróżnia się trzy rodzaje zagadnień: wniosek o zmianę, odstępstwo oraz problem lub obawę. Każde zagadnienie podlega formalnej procedurze oceny i decyzji.", "enriched_text": "W PRINCE2 wyróżnia się trzy rodzaje zagadnień: wniosek o zmianę, odstępstwo oraz problem lub obawę. Każde zagadnienie podlega formalnej procedurze oceny i decyzji. Klasyfikacja zagadnień ułatwia ich właściwą obsługę decyzyjną."}
{"id": "wyklad7_s31_c1", "lecture": "wyklad7", "slide": 31, "title": "Procedura zarządzania zmianą", "text": "Procedura zarządzania zmianą obejmuje rejestrację zagadnienia, analizę wpływu, proponowanie rozwiązań, podjęcie decyzji oraz wdrożenie działań korygujących.", "enriched_text": "Procedura zarządzania zmianą obejmuje rejestrację zagadnienia, analizę wpływu, proponowanie rozwiązań, podjęcie decyzji oraz wdrożenie działań korygujących. Procedura ta zapewnia przejrzystość i kontrolę procesu zmian."}
{"id": "wyklad7_s35_c1", "lecture": "wyklad7", "slide": 35, "title": "Postępy w PRINCE2", "text": "Postęp oznacza stopień realizacji planu na poziomie zadań, etapów i całego projektu. Monitorowanie postępów umożliwia utrzymanie kontroli i ciągłej zasadności biznesowej projektu.", "enriched_text": "Postęp oznacza stopień realizacji planu na poziomie zadań, etapów i całego projektu. Monitorowanie postępów umożliwia utrzymanie kontroli i ciągłej zasadności biznesowej projektu. Ocena postępów wspiera wczesne wykrywanie odchyleń od planu."}
{"id": "wyklad7_s36_c1", "lecture": "wyklad7", "slide": 36, "title": "Obszary tolerancji", "text": "W PRINCE2 wyróżnia się sześć obszarów tolerancji: czas, koszty, zakres, ryzyko, jakość oraz korzyści. Przekroczenie tolerancji skutkuje eskalacją decyzji.", "enriched_text": "W PRINCE2 wyróżnia się sześć obszarów tolerancji: czas, koszty, zakres, ryzyko, jakość oraz korzyści. Przekroczenie tolerancji skutkuje eskalacją decyzji. Tolerancje określają granice samodzielności decyzyjnej."}
{"id": "wyklad7_s39_c1", "lecture": "wyklad7", "slide": 39, "title": "Metody oceny postępów", "text": "Do oceny postępów w PRINCE2 stosuje się m.in. diagramy kamieni milowych, krzywą S oraz metodę wartości wypracowanej. Pozwalają one porównywać wyniki planowane i faktyczne.", "enriched_text": "Do oceny postępów w PRINCE2 stosuje się m.in. diagramy kamieni milowych, krzywą S oraz metodę wartości wypracowanej. Pozwalają one porównywać wyniki planowane i faktyczne. Metody te wspierają obiektywną ocenę realizacji projektu."}
{"id": "wyklad7_s43_c1", "lecture": "wyklad7", "slide": 43, "title": "Procesy PRINCE2", "text": "PRINCE2 definiuje siedem procesów obejmujących pełny cykl życia projektu, od przygotowania i inicjowania po sterowanie etapami i zamknięcie projektu.", "enriched_text": "PRINCE2 definiuje siedem procesów obejmujących pełny cykl życia projektu, od przygotowania i inicjowania po sterowanie etapami i zamknięcie projektu. Procesy porządkują przebieg projektu od początku do zakończenia."}
{"id": "wyklad7_s47_c1", "lecture": "wyklad7", "slide": 47, "title": "Przygotowanie Projektu", "text": "Proces Przygotowania Projektu służy sprawdzeniu, czy projekt jest zasadny i wykonalny. Jego celem jest uniknięcie inicjowania projektów opartych na błędnych założeniach.", "enriched_text": "Proces Przygotowania Projektu służy sprawdzeniu, czy projekt jest zasadny i wykonalny. Jego celem jest uniknięcie inicjowania projektów opartych na błędnych założeniach. Proces ten ogranicza ryzyko nieuzasadnionych inicjatyw."}
{"id": "wyklad7_s48_c1", "lecture": "wyklad7", "slide": 48, "title": "Zarządzanie Strategiczne Projektem", "text": "Proces Zarządzania Strategicznego Projektem umożliwia Komitetowi Sterującemu sprawowanie kontroli nad projektem. Zapewnia ciągłą zasadność biznesową i delegowanie bieżącego zarządzania.", "enriched_text": "Proces Zarządzania Strategicznego Projektem umożliwia Komitetowi Sterującemu sprawowanie kontroli nad projektem. Zapewnia ciągłą zasadność biznesową i delegowanie bieżącego zarządzania. Komitet Sterujący pełni kluczową rolę nadzorczą w projekcie."}
{"id": "wyklad7_s49_c1", "lecture": "wyklad7", "slide": 49, "title": "Inicjowanie Projektu", "text": "Inicjowanie Projektu tworzy solidne podstawy do realizacji projektu poprzez ustalenie zakresu, produktów, kosztów, harmonogramu, jakości oraz zasad zarządzania.", "enriched_text": "Inicjowanie Projektu tworzy solidne podstawy do realizacji projektu poprzez ustalenie zakresu, produktów, kosztów, harmonogramu, jakości oraz zasad zarządzania. Etap ten porządkuje wszystkie kluczowe ustalenia projektowe."}
{"id": "wyklad7_s50_c1", "lecture": "wyklad7", "slide": 50, "title": "Sterowanie Etapem", "text": "Sterowanie Etapem polega na przydzielaniu pracy, monitorowaniu wykonania oraz reagowaniu na zagadnienia i odchylenia. Celem jest utrzymanie etapu w granicach tolerancji.", "enriched_text": "Sterowanie Etapem polega na przydzielaniu pracy, monitorowaniu wykonania oraz reagowaniu na zagadnienia i odchylenia. Celem jest utrzymanie etapu w granicach tolerancji. Sterowanie etapem zapewnia bieżącą kontrolę realizacji."}
{"id": "wyklad7_s51_c1", "lecture": "wyklad7", "slide": 51, "title": "Zarządzanie Dostarczaniem Produktów", "text": "Proces Zarządzania Dostarczaniem Produktów reguluje współpracę pomiędzy Kierownikiem Projektu a zespołami. Zapewnia, że produkty są dostarczane zgodnie z uzgodnieniami.", "enriched_text": "Proces Zarządzania Dostarczaniem Produktów reguluje współpracę pomiędzy Kierownikiem Projektu a zespołami. Zapewnia, że produkty są dostarczane zgodnie z uzgodnieniami. Proces ten porządkuje relację między zarządzaniem a wykonawstwem."}
{"id": "wyklad7_s52_c1", "lecture": "wyklad7", "slide": 52, "title": "Zarządzanie Końcem Etapu", "text": "Proces Zarządzania Końcem Etapu dostarcza Komitetowi Sterującemu informacji do zatwierdzenia kolejnego etapu. Obejmuje przegląd osiągnięć, planów i zasadności biznesowej.", "enriched_text": "Proces Zarządzania Końcem Etapu dostarcza Komitetowi Sterującemu informacji do zatwierdzenia kolejnego etapu. Obejmuje przegląd osiągnięć, planów i zasadności biznesowej. Umożliwia świadomą decyzję o kontynuacji projektu."}
{"id": "wyklad7_s53_c1", "lecture": "wyklad7", "slide": 53, "title": "Zamykanie Projektu", "text": "Zamykanie Projektu polega na formalnym potwierdzeniu akceptacji produktów i osiągnięcia celów. Obejmuje ocenę efektów, korzyści i zaplanowanie działań następczych.", "enriched_text": "Zamykanie Projektu polega na formalnym potwierdzeniu akceptacji produktów i osiągnięcia celów. Obejmuje ocenę efektów, korzyści i zaplanowanie działań następczych. Zamykanie porządkuje zakończenie projektu i przekazanie odpowiedzialności."}
{"id": "wyklad7_s54_c1", "lecture": "wyklad7", "slide": 54, "title": "Dostosowanie PRINCE2 do projektu", "text": "PRINCE2 nie jest stosowana wybiórczo, lecz dostosowywana do skali i złożoności projektu. Pryncypia są zawsze obowiązkowe, natomiast tematy, role i procesy mogą być adaptowane.", "enriched_text": "PRINCE2 nie jest stosowana wybiórczo, lecz dostosowywana do skali i złożoności projektu. Pryncypia są zawsze obowiązkowe, natomiast tematy, role i procesy mogą być adaptowane. Dostosowanie metodyki zapewnia jej adekwatność i efektywność w praktyce."}
{"id": "wyklad10_s3_c1", "lecture": "wyklad10", "slide": 3, "title": "Metodyki zwinne – istota", "text": "Metodyki zwinne stanowią alternatywę dla tradycyjnego, kaskadowego podejścia do zarządzania projektami. Ich celem jest lepsze dostosowanie procesu wytwórczego do zmiennych warunków i potrzeb klienta.", "enriched_text": "Metodyki zwinne stanowią alternatywę dla tradycyjnego, kaskadowego podejścia do zarządzania projektami. Ich celem jest lepsze dostosowanie procesu wytwórczego do zmiennych warunków i potrzeb klienta. Podejście zwinne zakłada akceptację zmienności jako naturalnej cechy projektów, szczególnie w obszarze wytwarzania oprogramowania."}
{"id": "wyklad10_s3_c2", "lecture": "wyklad10", "slide": 3, "title": "Manifest Agile", "text": "Nazwa Agile przyjęła się w 2001 roku wraz z opublikowaniem Manifestu Agile. Dokument ten sformułował podstawowe wartości wspólne dla metodyk zwinnych.", "enriched_text": "Nazwa Agile przyjęła się w 2001 roku wraz z opublikowaniem Manifestu Agile. Dokument ten sformułował podstawowe wartości wspólne dla metodyk zwinnych. Manifest stanowi wspólny punkt odniesienia dla różnych metodyk zwinnych."}
{"id": "wyklad10_s3_c3", "lecture": "wyklad10", "slide": 3, "title": "Cztery wartości Agile", "text": "Metodyki zwinne opierają się na czterech wartościach: ludzie i interakcje są ważniejsze niż procesy i narzędzia, działające oprogramowanie jest ważniejsze niż obszerna dokumentacja, współpraca z klientem jest ważniejsza niż sztywne umowy oraz szybka reakcja na zmiany jest ważniejsza niż konsekwentna realizacja pierwotnego planu.", "enriched_text": "Metodyki zwinne opierają się na czterech wartościach: ludzie i interakcje są ważniejsze niż procesy i narzędzia, działające oprogramowanie jest ważniejsze niż obszerna dokumentacja, współpraca z klientem jest ważniejsza niż sztywne umowy oraz szybka reakcja na zmiany jest ważniejsza niż konsekwentna realizacja pierwotnego planu. Wartości te wskazują priorytety decyzyjne w sytuacjach konfliktu między formalizmem a elastycznością."}
{"id": "wyklad10_s4_c1", "lecture": "wyklad10", "slide": 4, "title": "Geneza metodyk zwinnych", "text": "Metodyki zwinne powstały jako reakcja na niezadowolenie ze sztywnych i silnie sformalizowanych metodyk zarządzania projektami i wytwarzania oprogramowania. Krytykowano je za niedopasowanie do realnych możliwości technik programistycznych oraz marnowanie zasobów.", "enriched_text": "Metodyki zwinne powstały jako reakcja na niezadowolenie ze sztywnych i silnie sformalizowanych metodyk zarządzania projektami i wytwarzania oprogramowania. Krytykowano je za niedopasowanie do realnych możliwości technik programistycznych oraz marnowanie zasobów. Geneza Agile pokazuje potrzebę lepszego dopasowania metodyki do praktyki inżynierskiej."}
{"id": "wyklad10_s4_c2", "lecture": "wyklad10", "slide": 4, "title": "Wpływ Agile na inne metodyki", "text": "Manifest Agile odniósł duży sukces, a jego założenia zaczęły być uwzględniane także w nowszych wersjach metodyk tradycyjnych. Spowodowało to powstawanie podejść hybrydowych.", "enriched_text": "Manifest Agile odniósł duży sukces, a jego założenia zaczęły być uwzględniane także w nowszych wersjach metodyk tradycyjnych. Spowodowało to powstawanie podejść hybrydowych. Wpływ Agile doprowadził do stopniowego łagodzenia sztywności klasycznych metodyk."}
{"id": "wyklad10_s5_c1", "lecture": "wyklad10", "slide": 5, "title": "Cechy metodyk zwinnych – zalety", "text": "Metodyki zwinne koncentrują się na kliencie i wymagają z nim ciągłego kontaktu. Charakteryzują się szybką reakcją na zmiany, łatwością modyfikacji zakresu projektu oraz szybkim dostarczaniem gotowych funkcjonalności przy zachowaniu ustalonego poziomu jakości.", "enriched_text": "Metodyki zwinne koncentrują się na kliencie i wymagają z nim ciągłego kontaktu. Charakteryzują się szybką reakcją na zmiany, łatwością modyfikacji zakresu projektu oraz szybkim dostarczaniem gotowych funkcjonalności przy zachowaniu ustalonego poziomu jakości. Zalety te zwiększają zdolność projektu do adaptacji w dynamicznym otoczeniu."}
{"id": "wyklad10_s5_c2", "lecture": "wyklad10", "slide": 5, "title": "Cechy metodyk zwinnych – ograniczenia", "text": "Do ograniczeń metodyk zwinnych należą problemy z dokumentacją, brak dokładnej analizy na początku projektu oraz trudności w precyzyjnym określeniu budżetu i końcowego terminu realizacji.", "enriched_text": "Do ograniczeń metodyk zwinnych należą problemy z dokumentacją, brak dokładnej analizy na początku projektu oraz trudności w precyzyjnym określeniu budżetu i końcowego terminu realizacji. Ograniczenia te utrudniają stosowanie Agile w projektach o wysokich wymaganiach formalnych."}
{"id": "wyklad10_s6_c1", "lecture": "wyklad10", "slide": 6, "title": "PRINCE2 a Agile – podejście hybrydowe", "text": "Metodyki hybrydowe, takie jak PRINCE2 Agile, łączą procesy zarządcze PRINCE2 z elementami metodyk zwinnych, domyślnie Scrum. Pozwala to zachować kontrolę zarządczą przy jednoczesnym zwiększeniu elastyczności.", "enriched_text": "Metodyki hybrydowe, takie jak PRINCE2 Agile, łączą procesy zarządcze PRINCE2 z elementami metodyk zwinnych, domyślnie Scrum. Pozwala to zachować kontrolę zarządczą przy jednoczesnym zwiększeniu elastyczności. Podejście hybrydowe próbuje pogodzić stabilność zarządczą z adaptacyjnością zespołów."}
{"id": "wyklad10_s6_c2", "lecture": "wyklad10", "slide": 6, "title": "Elementy zwinne w PRINCE2 Agile", "text": "PRINCE2 Agile wykorzystuje zwinne zachowania, takie jak przejrzystość, samoorganizacja i zaufanie, a także frameworki i techniki, m.in. Scrum, Kanban, XP, user stories czy wykresy wypalenia.", "enriched_text": "PRINCE2 Agile wykorzystuje zwinne zachowania, takie jak przejrzystość, samoorganizacja i zaufanie, a także frameworki i techniki, m.in. Scrum, Kanban, XP, user stories czy wykresy wypalenia. Elementy zwinne wspierają bieżącą współpracę zespołu i interesariuszy."}
{"id": "wyklad10_s6_c3", "lecture": "wyklad10", "slide": 6, "title": "Tolerancje i zwinnometr", "text": "W PRINCE2 Agile inaczej definiuje się tolerancje, rozróżniając elementy sztywne, częściowo elastyczne i elastyczne. Do oceny stopnia zwinności projektu stosuje się narzędzie zwane zwinnometrem.", "enriched_text": "W PRINCE2 Agile inaczej definiuje się tolerancje, rozróżniając elementy sztywne, częściowo elastyczne i elastyczne. Do oceny stopnia zwinności projektu stosuje się narzędzie zwane zwinnometrem. Zwinność projektu może być stopniowana w zależności od jego charakteru."}
{"id": "wyklad10_s7_c1", "lecture": "wyklad10", "slide": 7, "title": "Scrum – charakterystyka", "text": "Scrum jest iteracyjną i przyrostową metodyką zarządzania tworzeniem produktu. Zakłada częste zmiany wymagań oraz brak możliwości pełnej analizy problemu na początku projektu.", "enriched_text": "Scrum jest iteracyjną i przyrostową metodyką zarządzania tworzeniem produktu. Zakłada częste zmiany wymagań oraz brak możliwości pełnej analizy problemu na początku projektu. Scrum zakłada uczenie się o produkcie w trakcie jego wytwarzania."}
{"id": "wyklad10_s7_c2", "lecture": "wyklad10", "slide": 7, "title": "Założenia pracy zespołowej w Scrum", "text": "Scrum opiera się na ciągłym kontakcie z klientem lub jego reprezentantem, wysokiej motywacji zespołu oraz jego wewnętrznej samoorganizacji.", "enriched_text": "Scrum opiera się na ciągłym kontakcie z klientem lub jego reprezentantem, wysokiej motywacji zespołu oraz jego wewnętrznej samoorganizacji. Założenia te przesuwają odpowiedzialność operacyjną na zespół."}
{"id": "wyklad10_s8_c1", "lecture": "wyklad10", "slide": 8, "title": "Filary Scrum", "text": "Scrum opiera się na trzech filarach: przejrzystości, inspekcji oraz adaptacji. Filary te umożliwiają bieżącą kontrolę postępów i szybkie reagowanie na odchylenia.", "enriched_text": "Scrum opiera się na trzech filarach: przejrzystości, inspekcji oraz adaptacji. Filary te umożliwiają bieżącą kontrolę postępów i szybkie reagowanie na odchylenia. Filary te tworzą mechanizm ciągłego doskonalenia pracy zespołu."}
{"id": "wyklad10_s8_c2", "lecture": "wyklad10", "slide": 8, "title": "Znaczenie inspekcji i adaptacji", "text": "Inspekcja polega na częstym sprawdzaniu artefaktów i postępów, lecz nie na tyle często, aby zakłócać pracę zespołu. Adaptacja oznacza szybkie wprowadzanie korekt w przypadku wykrycia nieakceptowalnych odchyleń.", "enriched_text": "Inspekcja polega na częstym sprawdzaniu artefaktów i postępów, lecz nie na tyle często, aby zakłócać pracę zespołu. Adaptacja oznacza szybkie wprowadzanie korekt w przypadku wykrycia nieakceptowalnych odchyleń. Inspekcja i adaptacja zapobiegają narastaniu problemów w projekcie."}
{"id": "wyklad10_s9_c1", "lecture": "wyklad10", "slide": 9, "title": "Wartości Scrum", "text": "Scrum promuje pięć wartości: zaangażowanie, odwagę, skupienie, otwartość oraz poszanowanie. Wartości te wpływają na sposób współpracy zespołu i podejmowania decyzji.", "enriched_text": "Scrum promuje pięć wartości: zaangażowanie, odwagę, skupienie, otwartość oraz poszanowanie. Wartości te wpływają na sposób współpracy zespołu i podejmowania decyzji. Wartości Scrum wspierają budowanie zaufania w zespole."}
{"id": "wyklad10_s10_c1", "lecture": "wyklad10", "slide": 10, "title": "Role w Scrum", "text": "Zespół Scrumowy składa się z trzech ról: Właściciela Produktu, Scrum Mastera oraz Zespołu Developerskiego. Role te obejmują całość odpowiedzialności niezbędnych do wytwarzania produktu.", "enriched_text": "Zespół Scrumowy składa się z trzech ról: Właściciela Produktu, Scrum Mastera oraz Zespołu Developerskiego. Role te obejmują całość odpowiedzialności niezbędnych do wytwarzania produktu. Podział ról porządkuje odpowiedzialność bez rozbudowanej hierarchii."}
{"id": "wyklad10_s11_c1", "lecture": "wyklad10", "slide": 11, "title": "Artefakty Scrum", "text": "Podstawowe artefakty Scrum to Product Backlog, Sprint Backlog oraz Przyrost. Dodatkowo stosuje się elementy wspierające, takie jak wykresy wypalenia, spike czy tablice Kanban.", "enriched_text": "Podstawowe artefakty Scrum to Product Backlog, Sprint Backlog oraz Przyrost. Dodatkowo stosuje się elementy wspierające, takie jak wykresy wypalenia, spike czy tablice Kanban. Artefakty zapewniają przejrzystość stanu prac i produktu."}
{"id": "wyklad10_s12_c1", "lecture": "wyklad10", "slide": 12, "title": "Tablica Kanban", "text": "Tablica Kanban służy do wizualizacji przepływu pracy poprzez kolejne stany realizacji zadań. Ułatwia identyfikację wąskich gardeł i kontrolę postępów.", "enriched_text": "Tablica Kanban służy do wizualizacji przepływu pracy poprzez kolejne stany realizacji zadań. Ułatwia identyfikację wąskich gardeł i kontrolę postępów. Wizualizacja pracy wspiera zarządzanie przepływem zadań."}
{"id": "wyklad10_s13_c1", "lecture": "wyklad10", "slide": 13, "title": "Spotkania w Scrum", "text": "Scrum wykorzystuje zestaw regularnych spotkań, w tym planowanie sprintu, daily scrum, przegląd sprintu oraz retrospekcję. Spotkania te wspierają inspekcję, adaptację i komunikację w zespole.", "enriched_text": "Scrum wykorzystuje zestaw regularnych spotkań, w tym planowanie sprintu, daily scrum, przegląd sprintu oraz retrospekcję. Spotkania te wspierają inspekcję, adaptację i komunikację w zespole. Regularność spotkań sprzyja synchronizacji pracy zespołu."}
{"id": "wyklad10_s14_c1", "lecture": "wyklad10", "slide": 14, "title": "Extreme Programming – charakterystyka", "text": "Extreme Programming jest zwinną metodyką inżynierii oprogramowania zaproponowaną przez Kenta Becka. Jej celem jest podniesienie jakości oprogramowania oraz skuteczna reakcja na zmieniające się wymagania użytkownika.", "enriched_text": "Extreme Programming jest zwinną metodyką inżynierii oprogramowania zaproponowaną przez Kenta Becka. Jej celem jest podniesienie jakości oprogramowania oraz skuteczna reakcja na zmieniające się wymagania użytkownika. XP koncentruje się silnie na praktykach technicznych zespołu."}
{"id": "wyklad10_s15_c1", "lecture": "wyklad10", "slide": 15, "title": "Cele Extreme Programming", "text": "Celem XP jest zmniejszenie kosztu i uciążliwości wprowadzania zmian poprzez krótkie cykle rozwojowe. Metodyka zakłada, że zmiany są naturalne i należy się na nie przygotować.", "enriched_text": "Celem XP jest zmniejszenie kosztu i uciążliwości wprowadzania zmian poprzez krótkie cykle rozwojowe. Metodyka zakłada, że zmiany są naturalne i należy się na nie przygotować. XP traktuje zmiany jako stały element procesu wytwórczego."}
{"id": "wyklad10_s16_c1", "lecture": "wyklad10", "slide": 16, "title": "XP – znaczenie kodu i testowania", "text": "W XP kod jest najważniejszym nośnikiem wiedzy o systemie. Metodyka kładzie silny nacisk na testowanie, w tym testy jednostkowe i akceptacyjne, realizowane na bieżąco.", "enriched_text": "W XP kod jest najważniejszym nośnikiem wiedzy o systemie. Metodyka kładzie silny nacisk na testowanie, w tym testy jednostkowe i akceptacyjne, realizowane na bieżąco. Testowanie pełni rolę mechanizmu kontroli jakości i dokumentacji."}
{"id": "wyklad10_s17_c1", "lecture": "wyklad10", "slide": 17, "title": "XP – słuchanie i projektowanie", "text": "XP podkreśla znaczenie zrozumienia logiki biznesowej klienta oraz projektowania prostych i luźno powiązanych modułów. Projektowanie ma zapobiegać nadmiernej złożoności systemu.", "enriched_text": "XP podkreśla znaczenie zrozumienia logiki biznesowej klienta oraz projektowania prostych i luźno powiązanych modułów. Projektowanie ma zapobiegać nadmiernej złożoności systemu. Prostota projektowa ułatwia późniejsze modyfikacje systemu."}
{"id": "wyklad10_s18_c1", "lecture": "wyklad10", "slide": 18, "title": "Wartości Extreme Programming", "text": "XP opiera się na pięciu wartościach: komunikacji, prostocie, informacji zwrotnej, odwadze oraz szacunku. Wartości te determinują sposób pracy zespołu i podejmowania decyzji technicznych.", "enriched_text": "XP opiera się na pięciu wartościach: komunikacji, prostocie, informacji zwrotnej, odwadze oraz szacunku. Wartości te determinują sposób pracy zespołu i podejmowania decyzji technicznych. Wartości XP wspierają bliską współpracę zespołu i klienta."}
{"id": "wyklad10_s19_c1", "lecture": "wyklad10", "slide": 19, "title": "Planning Game w XP", "text": "Planning Game jest głównym procesem planowania w XP i odbywa się raz na iterację. Klient definiuje wymagania w postaci user stories, które są oceniane, priorytetyzowane i planowane wspólnie z zespołem.", "enriched_text": "Planning Game jest głównym procesem planowania w XP i odbywa się raz na iterację. Klient definiuje wymagania w postaci user stories, które są oceniane, priorytetyzowane i planowane wspólnie z zespołem. Proces ten łączy perspektywę biznesową i techniczną."}
{"id": "wyklad10_s20_c1", "lecture": "wyklad10", "slide": 20, "title": "Realizacja iteracji w XP", "text": "W ramach iteracji programiści wybierają zadania, szacują ich czas oraz wyrównują obciążenie pracy w zespole. Implementacja realizowana jest m.in. z wykorzystaniem podejścia TDD.", "enriched_text": "W ramach iteracji programiści wybierają zadania, szacują ich czas oraz wyrównują obciążenie pracy w zespole. Implementacja realizowana jest m.in. z wykorzystaniem podejścia TDD. Iteracje umożliwiają szybkie dostarczanie przyrostów funkcjonalności."}
{"id": "wyklad10_s21_c1", "lecture": "wyklad10", "slide": 21, "title": "Programowanie w parach", "text": "Programowanie w parach polega na wspólnej pracy dwóch osób przy jednym komputerze. Jedna osoba pełni rolę kierowcy, a druga nawigatora, co zwiększa jakość kodu i wymianę wiedzy.", "enriched_text": "Programowanie w parach polega na wspólnej pracy dwóch osób przy jednym komputerze. Jedna osoba pełni rolę kierowcy, a druga nawigatora, co zwiększa jakość kodu i wymianę wiedzy. Praktyka ta ogranicza liczbę błędów i wspiera uczenie się zespołu."}
{"id": "wyklad10_s22_c1", "lecture": "wyklad10", "slide": 22, "title": "Praktyki techniczne XP", "text": "XP wykorzystuje praktyki takie jak ciągłe przeglądy kodu, testy jednostkowe, prosty i czytelny kod oraz unikanie implementacji niepotrzebnych funkcjonalności.", "enriched_text": "XP wykorzystuje praktyki takie jak ciągłe przeglądy kodu, testy jednostkowe, prosty i czytelny kod oraz unikanie implementacji niepotrzebnych funkcjonalności. Praktyki te wspierają utrzymanie wysokiej jakości kodu."}
{"id": "wyklad10_s23_c1", "lecture": "wyklad10", "slide": 23, "title": "Refaktoryzacja i wspólna odpowiedzialność", "text": "W XP kod jest stale integrowany i refaktoryzowany w celu uproszczenia architektury. Zespół ponosi wspólną odpowiedzialność za kod, co umożliwia szybkie poprawki i zmiany.", "enriched_text": "W XP kod jest stale integrowany i refaktoryzowany w celu uproszczenia architektury. Zespół ponosi wspólną odpowiedzialność za kod, co umożliwia szybkie poprawki i zmiany. Wspólna odpowiedzialność zmniejsza zależność od pojedynczych osób."}
{"id": "wyklad10_s24_c1", "lecture": "wyklad10", "slide": 24, "title": "Dodatkowe elementy XP", "text": "XP zakłada m.in. krótkie czasy budowania systemu, stosowanie bufora zadań o niskim priorytecie oraz ograniczoną liczbę ról w projekcie. Elementy te wspierają elastyczność i stabilność pracy zespołu.", "enriched_text": "XP zakłada m.in. krótkie czasy budowania systemu, stosowanie bufora zadań o niskim priorytecie oraz ograniczoną liczbę ról w projekcie. Elementy te wspierają elastyczność i stabilność pracy zespołu. Elementy te pomagają utrzymać płynność pracy zespołu."}
{"id": "wyklad10_s25_c1", "lecture": "wyklad10", "slide": 25, "title": "Cechy Extreme Programming", "text": "Extreme Programming zakłada stałą dostępność klienta i przyrostowe ustalanie wymagań. Metodyka wiąże się jednak z ryzykiem pełzania zakresu, problemami skalowalności oraz dużą improwizacją.", "enriched_text": "Extreme Programming zakłada stałą dostępność klienta i przyrostowe ustalanie wymagań. Metodyka wiąże się jednak z ryzykiem pełzania zakresu, problemami skalowalności oraz dużą improwizacją. Cechy te ograniczają zastosowanie XP w dużych projektach."}
{"id": "wyklad10_s26_c1", "lecture": "wyklad10", "slide": 26, "title": "Problemy Extreme Programming", "text": "XP wymaga doświadczonych programistów oraz odpowiedniej kultury organizacyjnej. Trudności sprawiają m.in. intensywne praktyki techniczne, konieczność przeszkolenia całego zespołu oraz ograniczona możliwość pozornego stosowania metodyki.", "enriched_text": "XP wymaga doświadczonych programistów oraz odpowiedniej kultury organizacyjnej. Trudności sprawiają m.in. intensywne praktyki techniczne, konieczność przeszkolenia całego zespołu oraz ograniczona możliwość pozornego stosowania metodyki. Skuteczne wdrożenie XP wymaga dojrzałości zespołu i organizacji."}
{"id": "wyklad11_s3_c1", "lecture": "wyklad11", "slide": 3, "title": "Design Thinking – geneza", "text": "Design Thinking wywodzi się z nurtu kreatywnego rozwiązywania problemów rozwijanego od lat 60. do 90. XX wieku. Duży wpływ na popularyzację podejścia miała książka „Change by Design” autorstwa Tima Browna z IDEO.", "enriched_text": "Design Thinking wywodzi się z nurtu kreatywnego rozwiązywania problemów rozwijanego od lat 60. do 90. XX wieku. Duży wpływ na popularyzację podejścia miała książka „Change by Design” autorstwa Tima Browna z IDEO. Podejście to łączy metody projektowe z myśleniem systemowym i pracą zespołową."}
{"id": "wyklad11_s3_c2", "lecture": "wyklad11", "slide": 3, "title": "Design Thinking – orientacja na użytkownika", "text": "Design Thinking jest podejściem skoncentrowanym na użytkowniku i jego problemach, nawet jeśli użytkownik nie potrafi ich jasno zdefiniować. Celem jest odkrycie zarówno znanych, jak i nieznanych aspektów sytuacji problemowej.", "enriched_text": "Design Thinking jest podejściem skoncentrowanym na użytkowniku i jego problemach, nawet jeśli użytkownik nie potrafi ich jasno zdefiniować. Celem jest odkrycie zarówno znanych, jak i nieznanych aspektów sytuacji problemowej. Silny nacisk na perspektywę użytkownika pozwala lepiej zrozumieć rzeczywiste potrzeby."}
{"id": "wyklad11_s3_c3", "lecture": "wyklad11", "slide": 3, "title": "Iteracyjny charakter Design Thinking", "text": "Design Thinking ma charakter iteracyjny, a odkrywane rozwiązania stanowią punkt wyjścia do kolejnych iteracji. Początkowe założenia są wielokrotnie redefiniowane w trakcie procesu.", "enriched_text": "Design Thinking ma charakter iteracyjny, a odkrywane rozwiązania stanowią punkt wyjścia do kolejnych iteracji. Początkowe założenia są wielokrotnie redefiniowane w trakcie procesu. Iteracyjność umożliwia uczenie się na podstawie kolejnych przybliżeń rozwiązania."}
{"id": "wyklad11_s4_c1", "lecture": "wyklad11", "slide": 4, "title": "Proces Design Thinking (Stanford d.school)", "text": "Proces Design Thinking według Stanford d.school obejmuje etapy: empatyzowanie, definiowanie problemu, generowanie pomysłów, prototypowanie oraz testowanie. Etapy te są powiązane iteracyjnie, a nie realizowane liniowo.", "enriched_text": "Proces Design Thinking według Stanford d.school obejmuje etapy: empatyzowanie, definiowanie problemu, generowanie pomysłów, prototypowanie oraz testowanie. Etapy te są powiązane iteracyjnie, a nie realizowane liniowo. Proces ten wspiera eksplorację problemu i stopniowe zawężanie rozwiązań."}
{"id": "wyklad11_s5_c1", "lecture": "wyklad11", "slide": 5, "title": "Myślenie rozbieżne i zbieżne", "text": "Design Thinking łączy myślenie rozbieżne, polegające na generowaniu wielu możliwych rozwiązań, z myśleniem zbieżnym, którego celem jest wybór jednego rozwiązania końcowego.", "enriched_text": "Design Thinking łączy myślenie rozbieżne, polegające na generowaniu wielu możliwych rozwiązań, z myśleniem zbieżnym, którego celem jest wybór jednego rozwiązania końcowego. Naprzemienne stosowanie obu trybów sprzyja kreatywności i decyzyjności."}
{"id": "wyklad11_s5_c2", "lecture": "wyklad11", "slide": 5, "title": "Analiza i synteza w Design Thinking", "text": "Proces Design Thinking wykorzystuje zarówno analizę, czyli rozkładanie problemu na części, jak i syntezę, polegającą na łączeniu elementów w spójną całość.", "enriched_text": "Proces Design Thinking wykorzystuje zarówno analizę, czyli rozkładanie problemu na części, jak i syntezę, polegającą na łączeniu elementów w spójną całość. Połączenie analizy i syntezy pozwala lepiej zrozumieć złożone problemy."}
{"id": "wyklad11_s6_c1", "lecture": "wyklad11", "slide": 6, "title": "Cechy podejścia Design Thinking", "text": "Design Thinking kładzie duży nacisk na burzę mózgów, nieszablonowe myślenie oraz intensywną pracę zespołową. Istotne są koncentracja na problemach użytkownika, ciekawość oraz wytrwałość w poszukiwaniu rozwiązań.", "enriched_text": "Design Thinking kładzie duży nacisk na burzę mózgów, nieszablonowe myślenie oraz intensywną pracę zespołową. Istotne są koncentracja na problemach użytkownika, ciekawość oraz wytrwałość w poszukiwaniu rozwiązań. Podejście sprzyja eksplorowaniu problemów z wielu perspektyw."}
{"id": "wyklad11_s6_c2", "lecture": "wyklad11", "slide": 6, "title": "Prototypowanie i akceptacja porażki", "text": "W Design Thinking ważne jest szybkie prototypowanie oraz zasada „it’s OK to fail”. Podejście promuje działanie i eksperymentowanie zamiast długotrwałych dyskusji teoretycznych.", "enriched_text": "W Design Thinking ważne jest szybkie prototypowanie oraz zasada „it’s OK to fail”. Podejście promuje działanie i eksperymentowanie zamiast długotrwałych dyskusji teoretycznych. Porażki traktowane są jako źródło wiedzy, a nie niepowodzenie."}
{"id": "wyklad11_s6_c3", "lecture": "wyklad11", "slide": 6, "title": "Wicked problems", "text": "Design Thinking jest szczególnie użyteczne w przypadku tzw. wicked problems, czyli problemów, w których na początku nie jest jasne ani właściwe sformułowanie problemu, ani możliwe rozwiązania.", "enriched_text": "Design Thinking jest szczególnie użyteczne w przypadku tzw. wicked problems, czyli problemów, w których na początku nie jest jasne ani właściwe sformułowanie problemu, ani możliwe rozwiązania. Takie problemy wymagają eksploracyjnego i iteracyjnego podejścia."}
{"id": "wyklad11_s7_c1", "lecture": "wyklad11", "slide": 7, "title": "Narzędzia Design Thinking", "text": "Do narzędzi Design Thinking należą m.in. technika pięciu pytań „dlaczego”, drzewa logiczne typu „jak” i „dlaczego” oraz intensywna praca z wykorzystaniem karteczek, tablic i materiałów prototypowych.", "enriched_text": "Do narzędzi Design Thinking należą m.in. technika pięciu pytań „dlaczego”, drzewa logiczne typu „jak” i „dlaczego” oraz intensywna praca z wykorzystaniem karteczek, tablic i materiałów prototypowych. Narzędzia te wspierają strukturyzowanie myślenia zespołu."}
{"id": "wyklad11_s8_c1", "lecture": "wyklad11", "slide": 8, "title": "Pretotypy w Design Thinking", "text": "W Design Thinking stosuje się tzw. pretotypy, czyli bardzo proste i często niedoskonałe modele rozwiązań. Ich celem jest szybkie sprawdzenie założeń i uzyskanie informacji zwrotnej, a nie estetyka wykonania.", "enriched_text": "W Design Thinking stosuje się tzw. pretotypy, czyli bardzo proste i często niedoskonałe modele rozwiązań. Ich celem jest szybkie sprawdzenie założeń i uzyskanie informacji zwrotnej, a nie estetyka wykonania. Pretotypy minimalizują koszt wczesnych błędów projektowych."}
{"id": "wyklad11_s9_c1", "lecture": "wyklad11", "slide": 9, "title": "Przykład zastosowania Design Thinking", "text": "Przykładem zastosowania Design Thinking jest hackathon „Szczurza Sztafeta” organizowany przez Design Factory Global Network. Wydarzenie obejmowało zespoły z wielu miast i kontynentów oraz pracę w sześciu etapach po sześć godzin.", "enriched_text": "Przykładem zastosowania Design Thinking jest hackathon „Szczurza Sztafeta” organizowany przez Design Factory Global Network. Wydarzenie obejmowało zespoły z wielu miast i kontynentów oraz pracę w sześciu etapach po sześć godzin. Przykład pokazuje skalowalność i zespołowy charakter podejścia."}
{"id": "wyklad11_s12_c1", "lecture": "wyklad11", "slide": 12, "title": "Czarne łabędzie – przykłady", "text": "Czarne łabędzie to rzadkie, nieprzewidywalne zdarzenia o dużych konsekwencjach. Przykłady obejmują pandemię COVID-19, wojny, katastrofy technologiczne, nagłe zmiany prawne oraz przełomowe innowacje technologiczne.", "enriched_text": "Czarne łabędzie to rzadkie, nieprzewidywalne zdarzenia o dużych konsekwencjach. Przykłady obejmują pandemię COVID-19, wojny, katastrofy technologiczne, nagłe zmiany prawne oraz przełomowe innowacje technologiczne. Zdarzenia te znacząco zaburzają planowanie oparte na danych historycznych."}
{"id": "wyklad11_s13_c1", "lecture": "wyklad11", "slide": 13, "title": "Czwarty kwadrat – klasyfikacja wiedzy", "text": "Czwarty kwadrat opisuje podział wiedzy na known knowns, known unknowns oraz unknown unknowns. Klasyfikacja ta została spopularyzowana przez Donalda Rumsfelda w 2002 roku.", "enriched_text": "Czwarty kwadrat opisuje podział wiedzy na known knowns, known unknowns oraz unknown unknowns. Klasyfikacja ta została spopularyzowana przez Donalda Rumsfelda w 2002 roku. Model ten podkreśla istnienie obszarów niepewności poznawczej."}
{"id": "wyklad11_s14_c1", "lecture": "wyklad11", "slide": 14, "title": "Unknown knowns i intuicja", "text": "Do czwartego kwadrantu zalicza się także unknown knowns, czyli wiedzę opartą na doświadczeniu, z której nie zdajemy sobie w pełni świadomie sprawy. Często określa się ją mianem intuicji.", "enriched_text": "Do czwartego kwadrantu zalicza się także unknown knowns, czyli wiedzę opartą na doświadczeniu, z której nie zdajemy sobie w pełni świadomie sprawy. Często określa się ją mianem intuicji. Intuicja może wspierać decyzje w warunkach braku danych."}
{"id": "wyklad11_s15_c1", "lecture": "wyklad11", "slide": 15, "title": "Czwarty kwadrat a statystyka", "text": "Zjawiska czwartego kwadrantu często charakteryzują się rozkładami o grubych ogonach oraz skalowalnymi wynikami. Powoduje to ograniczoną skuteczność klasycznych metod statystycznych.", "enriched_text": "Zjawiska czwartego kwadrantu często charakteryzują się rozkładami o grubych ogonach oraz skalowalnymi wynikami. Powoduje to ograniczoną skuteczność klasycznych metod statystycznych. Ograniczenia statystyki wymagają ostrożności w prognozowaniu."}
{"id": "wyklad11_s16_c1", "lecture": "wyklad11", "slide": 16, "title": "Szare nosorożce i inne metafory", "text": "Szare nosorożce to wysoce prawdopodobne zagrożenia o dużych skutkach, które są często lekceważone mimo widocznych symptomów. Wśród innych metafor wymienia się purpurowe krowy oraz zielone żaby, różniące się dynamiką zmian.", "enriched_text": "Szare nosorożce to wysoce prawdopodobne zagrożenia o dużych skutkach, które są często lekceważone mimo widocznych symptomów. Wśród innych metafor wymienia się purpurowe krowy oraz zielone żaby, różniące się dynamiką zmian. Metafory pomagają obrazować różne typy ryzyk i zmian."}
{"id": "wyklad11_s17_c1", "lecture": "wyklad11", "slide": 17, "title": "VUCA – charakterystyka środowiska", "text": "VUCA opisuje środowisko jako zmienne, niepewne, złożone i niejednoznaczne. W takich warunkach trudne jest poleganie na danych historycznych oraz jednoznacznych relacjach przyczynowo-skutkowych.", "enriched_text": "VUCA opisuje środowisko jako zmienne, niepewne, złożone i niejednoznaczne. W takich warunkach trudne jest poleganie na danych historycznych oraz jednoznacznych relacjach przyczynowo-skutkowych. VUCA podkreśla potrzebę adaptacyjnych metod zarządzania."}
{"id": "wyklad11_s17_c2", "lecture": "wyklad11", "slide": 17, "title": "Błędy poznawcze i organizacyjne", "text": "W środowisku VUCA częste są błędy pomiaru, survivor bias, fałszywe wnioskowanie oparte na korelacji oraz odrzucanie anomalii sprzecznych ze zdrowym rozsądkiem.", "enriched_text": "W środowisku VUCA częste są błędy pomiaru, survivor bias, fałszywe wnioskowanie oparte na korelacji oraz odrzucanie anomalii sprzecznych ze zdrowym rozsądkiem. Błędy te mogą prowadzić do błędnych decyzji strategicznych."}
{"id": "wyklad11_s19_c1", "lecture": "wyklad11", "slide": 19, "title": "Krytyka Agile", "text": "Erik Meijer w 2015 roku sformułował ostrą krytykę Agile, wskazując m.in. na nadmiar spotkań, ograniczenie realnego programowania oraz utratę spojrzenia na całość systemu wskutek krótkoterminowych celów.", "enriched_text": "Erik Meijer w 2015 roku sformułował ostrą krytykę Agile, wskazując m.in. na nadmiar spotkań, ograniczenie realnego programowania oraz utratę spojrzenia na całość systemu wskutek krótkoterminowych celów. Krytyka zwraca uwagę na ryzyka niewłaściwego stosowania Agile."}
{"id": "wyklad11_s20_c1", "lecture": "wyklad11", "slide": 20, "title": "Agile BS", "text": "Pojęcie „Agile BS” odnosi się do powierzchownego stosowania Agile w organizacjach, które ma niewiele wspólnego z Manifestem Agile. Pogląd ten podziela znacząca część sygnatariuszy manifestu.", "enriched_text": "Pojęcie „Agile BS” odnosi się do powierzchownego stosowania Agile w organizacjach, które ma niewiele wspólnego z Manifestem Agile. Pogląd ten podziela znacząca część sygnatariuszy manifestu. Termin ten podkreśla rozbieżność między ideą a praktyką."}
{"id": "wyklad11_s21_c1", "lecture": "wyklad11", "slide": 21, "title": "Krytyka Design Thinking", "text": "Design Thinking bywa krytykowane za brak krytycznej refleksji, nadmiar interesariuszy oraz niski współczynnik sukcesu. Wskazuje się także na przesadną kodyfikację procesu i odejście od realnych potrzeb użytkowników na rzecz wygody organizacyjnej.", "enriched_text": "Design Thinking bywa krytykowane za brak krytycznej refleksji, nadmiar interesariuszy oraz niski współczynnik sukcesu. Wskazuje się także na przesadną kodyfikację procesu i odejście od realnych potrzeb użytkowników na rzecz wygody organizacyjnej. Krytyka ta wskazuje na ryzyko formalizacji kosztem autentycznej empatii."}
{"id": "wyklad12_s4_c1", "lecture": "wyklad12", "slide": 4, "title": "Wynalazek a innowacja – różnica", "text": "Wynalazek odnosi się do stworzenia nowego rozwiązania technicznego lub koncepcji. Innowacja natomiast oznacza wdrożenie nowości w taki sposób, aby tworzyła ona realną wartość, najczęściej biznesową lub społeczną.", "enriched_text": "Wynalazek odnosi się do stworzenia nowego rozwiązania technicznego lub koncepcji. Innowacja natomiast oznacza wdrożenie nowości w taki sposób, aby tworzyła ona realną wartość, najczęściej biznesową lub społeczną. Kluczowa różnica polega na praktycznym zastosowaniu i użyteczności rozwiązania."}
{"id": "wyklad12_s4_c2", "lecture": "wyklad12", "slide": 4, "title": "Dwa wymiary innowacji", "text": "Innowacja posiada dwa kluczowe wymiary: kreowanie nowości oraz kreowanie wartości. Sama nowość bez wartości użytkowej nie jest uznawana za innowację.", "enriched_text": "Innowacja posiada dwa kluczowe wymiary: kreowanie nowości oraz kreowanie wartości. Sama nowość bez wartości użytkowej nie jest uznawana za innowację. Oba wymiary muszą wystąpić jednocześnie, aby mówić o innowacji."}
{"id": "wyklad12_s5_c1", "lecture": "wyklad12", "slide": 5, "title": "Internet Rzeczy jako przykład innowacji", "text": "Internet Rzeczy jest przykładem koncepcji, która łączy istniejące technologie w nowy sposób. Jego znaczenie wynika nie tylko z samego wynalazku, ale z szerokiego zastosowania i generowanej wartości.", "enriched_text": "Internet Rzeczy jest przykładem koncepcji, która łączy istniejące technologie w nowy sposób. Jego znaczenie wynika nie tylko z samego wynalazku, ale z szerokiego zastosowania i generowanej wartości. Wartość IoT wynika z integracji technologii i ich praktycznego użycia."}
{"id": "wyklad12_s6_c1", "lecture": "wyklad12", "slide": 6, "title": "Typy innowacji według Oslo Manual", "text": "Oslo Manual wyróżnia cztery typy innowacji: produktowe, procesowe, organizacyjne oraz marketingowe. Klasyfikacja ta jest prosta i jednocześnie wyczerpująca z punktu widzenia praktyki biznesowej.", "enriched_text": "Oslo Manual wyróżnia cztery typy innowacji: produktowe, procesowe, organizacyjne oraz marketingowe. Klasyfikacja ta jest prosta i jednocześnie wyczerpująca z punktu widzenia praktyki biznesowej. Podział ten ułatwia analizę innowacji w organizacjach."}
{"id": "wyklad12_s7_c1", "lecture": "wyklad12", "slide": 7, "title": "Źródła innowacji – ujęcie Druckera", "text": "Źródła innowacji można podzielić na wewnętrzne i zewnętrzne. Podział zaproponowany przez Druckera porządkuje różnorodne impulsy prowadzące do powstawania innowacji.", "enriched_text": "Źródła innowacji można podzielić na wewnętrzne i zewnętrzne. Podział zaproponowany przez Druckera porządkuje różnorodne impulsy prowadzące do powstawania innowacji. Pozwala to systematycznie identyfikować potencjalne impulsy innowacyjne."}
{"id": "wyklad12_s7_c2", "lecture": "wyklad12", "slide": 7, "title": "Wewnętrzne źródła innowacji", "text": "Do wewnętrznych źródeł innowacji należą m.in. nieoczekiwane wydarzenia, niezgodność pomiędzy wyobrażeniami a rzeczywistością, zmiany w strukturze organizacji oraz potrzeby procesów.", "enriched_text": "Do wewnętrznych źródeł innowacji należą m.in. nieoczekiwane wydarzenia, niezgodność pomiędzy wyobrażeniami a rzeczywistością, zmiany w strukturze organizacji oraz potrzeby procesów. Źródła te wynikają z obserwacji własnej działalności organizacji."}
{"id": "wyklad12_s7_c3", "lecture": "wyklad12", "slide": 7, "title": "Zewnętrzne źródła innowacji", "text": "Zewnętrzne źródła innowacji obejmują zmiany demograficzne, zmiany w postrzeganiu i wartościach oraz nową wiedzę powstającą w nauce i technologii.", "enriched_text": "Zewnętrzne źródła innowacji obejmują zmiany demograficzne, zmiany w postrzeganiu i wartościach oraz nową wiedzę powstającą w nauce i technologii. Czynniki te znajdują się poza bezpośrednią kontrolą organizacji."}
{"id": "wyklad12_s8_c1", "lecture": "wyklad12", "slide": 8, "title": "Nieoczekiwane zdarzenia jako źródło innowacji", "text": "Nieoczekiwane powodzenie lub niepowodzenie może stać się impulsem dla innowacji. Zjawiska negatywne często generują istotne innowacje, jeśli organizacja potrafi szybko zareagować.", "enriched_text": "Nieoczekiwane powodzenie lub niepowodzenie może stać się impulsem dla innowacji. Zjawiska negatywne często generują istotne innowacje, jeśli organizacja potrafi szybko zareagować. Szybka reakcja pozwala przekształcić problem w szansę."}
{"id": "wyklad12_s9_c1", "lecture": "wyklad12", "slide": 9, "title": "Niezgodność rzeczywistości i wyobrażeń", "text": "Innowacje mogą wynikać z sytuacji, w których produkt nie sprzedaje się mimo istniejącego popytu. Przyczynami bywają m.in. błędne kanały dystrybucji, problemy funkcjonalne, stereotypy klientów lub niewłaściwa identyfikacja rynku.", "enriched_text": "Innowacje mogą wynikać z sytuacji, w których produkt nie sprzedaje się mimo istniejącego popytu. Przyczynami bywają m.in. błędne kanały dystrybucji, problemy funkcjonalne, stereotypy klientów lub niewłaściwa identyfikacja rynku. Analiza takich rozbieżności może ujawnić nowe kierunki zmian."}
{"id": "wyklad12_s10_c1", "lecture": "wyklad12", "slide": 10, "title": "Zmiany w strukturze rynku", "text": "Zmiany w strukturze przemysłu lub rynku, często będące zaskoczeniem, tworzą okazje do innowacji. Wymagają one szybkiego działania, redefinicji działalności oraz dostosowania do nowych trendów i zachowań klientów.", "enriched_text": "Zmiany w strukturze przemysłu lub rynku, często będące zaskoczeniem, tworzą okazje do innowacji. Wymagają one szybkiego działania, redefinicji działalności oraz dostosowania do nowych trendów i zachowań klientów. Elastyczność organizacji sprzyja wykorzystaniu takich okazji."}
{"id": "wyklad12_s11_c1", "lecture": "wyklad12", "slide": 11, "title": "Potrzeby procesu jako źródło innowacji", "text": "Wiele innowacji powstaje poprzez stopniowe ulepszanie procesów. Impulsem są słabe lub brakujące ogniwa, powszechna świadomość nieoptymalności rozwiązania oraz jasno określony cel usprawnienia.", "enriched_text": "Wiele innowacji powstaje poprzez stopniowe ulepszanie procesów. Impulsem są słabe lub brakujące ogniwa, powszechna świadomość nieoptymalności rozwiązania oraz jasno określony cel usprawnienia. Innowacje procesowe często mają charakter ewolucyjny."}
{"id": "wyklad12_s12_c1", "lecture": "wyklad12", "slide": 12, "title": "Demografia a innowacje", "text": "Zmiany demograficzne są najbardziej przewidywalnym zewnętrznym źródłem innowacji. Wpływają one na strukturę klientów, dostępność pracowników oraz to, jakie produkty będą kupowane i w jakich cenach.", "enriched_text": "Zmiany demograficzne są najbardziej przewidywalnym zewnętrznym źródłem innowacji. Wpływają one na strukturę klientów, dostępność pracowników oraz to, jakie produkty będą kupowane i w jakich cenach. Pozwalają planować innowacje w dłuższym horyzoncie czasu."}
{"id": "wyklad12_s13_c1", "lecture": "wyklad12", "slide": 13, "title": "Zmiany w postrzeganiu i wartościach", "text": "Innowacje mogą wynikać ze zmiany interpretacji faktów, mimo że same fakty pozostają niezmienione. Trudność polega na nieprzewidywalności tego, jak społeczeństwo zacznie postrzegać dane zjawiska.", "enriched_text": "Innowacje mogą wynikać ze zmiany interpretacji faktów, mimo że same fakty pozostają niezmienione. Trudność polega na nieprzewidywalności tego, jak społeczeństwo zacznie postrzegać dane zjawiska. Zmiana percepcji może całkowicie zmienić wartość produktu."}
{"id": "wyklad12_s14_c1", "lecture": "wyklad12", "slide": 14, "title": "Nowa wiedza naukowa", "text": "Nowa wiedza naukowa i techniczna jest źródłem innowacji o wysokim ryzyku, dużych kosztach i długim okresie dojrzewania. Wymaga stworzenia użytkownikowi zupełnie nowej wartości.", "enriched_text": "Nowa wiedza naukowa i techniczna jest źródłem innowacji o wysokim ryzyku, dużych kosztach i długim okresie dojrzewania. Wymaga stworzenia użytkownikowi zupełnie nowej wartości. Tego typu innowacje są najbardziej niepewne, ale potencjalnie przełomowe."}
{"id": "wyklad12_s16_c1", "lecture": "wyklad12", "slide": 16, "title": "Innowacyjność, ryzyko i zysk", "text": "Innowacyjność jest silnie powiązana z ryzykiem oraz potencjalnym zyskiem. Im większa innowacyjność, tym zazwyczaj wyższe ryzyko, ale również większa możliwość osiągnięcia ponadprzeciętnych korzyści.", "enriched_text": "Innowacyjność jest silnie powiązana z ryzykiem oraz potencjalnym zyskiem. Im większa innowacyjność, tym zazwyczaj wyższe ryzyko, ale również większa możliwość osiągnięcia ponadprzeciętnych korzyści. Relacja ta wymaga świadomego zarządzania portfelem innowacji."}
{"id": "wyklad12_s17_c1", "lecture": "wyklad12", "slide": 17, "title": "Patenty – istota i problemy", "text": "Patent jest formą ochrony wynalazku, jednak bywa kosztowny, zawodny i nie zawsze skutecznie chroni własność intelektualną. Różnice prawne między krajami dodatkowo komplikują jego stosowanie.", "enriched_text": "Patent jest formą ochrony wynalazku, jednak bywa kosztowny, zawodny i nie zawsze skutecznie chroni własność intelektualną. Różnice prawne między krajami dodatkowo komplikują jego stosowanie. Ochrona patentowa wiąże się z istotnymi ograniczeniami praktycznymi."}
{"id": "wyklad12_s17_c2", "lecture": "wyklad12", "slide": 17, "title": "Patenty a rynek", "text": "Patenty mogą hamować rozwój rynku i innowacyjność. Przykładem pozytywnego nieopatentowania jest decyzja Tima Bernersa-Lee o udostępnieniu technologii WWW bez ograniczeń.", "enriched_text": "Patenty mogą hamować rozwój rynku i innowacyjność. Przykładem pozytywnego nieopatentowania jest decyzja Tima Bernersa-Lee o udostępnieniu technologii WWW bez ograniczeń. Brak patentu może sprzyjać szybkiemu upowszechnieniu innowacji."}
{"id": "wyklad12_s19_c1", "lecture": "wyklad12", "slide": 19, "title": "Trolle i piraci patentowi", "text": "Trolle patentowe i piraci koncentrują się na agresywnym egzekwowaniu praw patentowych, często bez realnego wkładu w rozwój technologii. Obejmuje to patentowanie cudzych rozwiązań, absurdalnie ogólne patenty oraz próby czerpania zysków spoza rzeczywistego zakresu ochrony.", "enriched_text": "Trolle patentowe i piraci koncentrują się na agresywnym egzekwowaniu praw patentowych, często bez realnego wkładu w rozwój technologii. Obejmuje to patentowanie cudzych rozwiązań, absurdalnie ogólne patenty oraz próby czerpania zysków spoza rzeczywistego zakresu ochrony. Zjawisko to zaburza mechanizmy uczciwej konkurencji."}
{"id": "wyklad12_s20_c1", "lecture": "wyklad12", "slide": 20, "title": "Imitacje – problem i kontrowersje", "text": "Imitacja polega na naśladowaniu istniejących rozwiązań. Choć bywa uznawana za zjawisko negatywne, w praktyce może przyczyniać się do rozpowszechniania innowacji i obniżania kosztów.", "enriched_text": "Imitacja polega na naśladowaniu istniejących rozwiązań. Choć bywa uznawana za zjawisko negatywne, w praktyce może przyczyniać się do rozpowszechniania innowacji i obniżania kosztów. Imitacja może pełnić rolę katalizatora dyfuzji innowacji."}
{"id": "wyklad12_s22_c1", "lecture": "wyklad12", "slide": 22, "title": "Dyfuzja innowacji", "text": "Dyfuzja innowacji opisuje proces rozprzestrzeniania się nowych rozwiązań wśród użytkowników. Przykładem są flagowe telefony, które z czasem stają się standardem rynkowym.", "enriched_text": "Dyfuzja innowacji opisuje proces rozprzestrzeniania się nowych rozwiązań wśród użytkowników. Przykładem są flagowe telefony, które z czasem stają się standardem rynkowym. Proces ten prowadzi do upowszechnienia technologii."}
{"id": "wyklad12_s23_c1", "lecture": "wyklad12", "slide": 23, "title": "Komodytyzacja innowacji", "text": "Komodytyzacja polega na upowszechnieniu innowacji do poziomu dobra podstawowego. Prowadzi to do presji na niską cenę, standaryzację oraz poszukiwanie alternatywnych źródeł zysku.", "enriched_text": "Komodytyzacja polega na upowszechnieniu innowacji do poziomu dobra podstawowego. Prowadzi to do presji na niską cenę, standaryzację oraz poszukiwanie alternatywnych źródeł zysku. Innowacja traci unikalność, ale zyskuje masowy charakter."}
{"id": "wyklad12_s24_c1", "lecture": "wyklad12", "slide": 24, "title": "Komercjalizacja innowacji", "text": "Komercjalizacja polega na przekształceniu potencjału innowacji w realny zysk. Może mieć charakter bezpośredni lub pośredni i wymaga przekonania klientów do płatności za dane rozwiązanie.", "enriched_text": "Komercjalizacja polega na przekształceniu potencjału innowacji w realny zysk. Może mieć charakter bezpośredni lub pośredni i wymaga przekonania klientów do płatności za dane rozwiązanie. Jest to kluczowy etap łączący innowację z rynkiem."}
{"id": "wyklad12_s25_c1", "lecture": "wyklad12", "slide": 25, "title": "Modele generowania innowacji", "text": "Model Technology Push zakłada powstawanie innowacji w wyniku badań i rozwoju, natomiast Market Pull wynika z potrzeb rynku. W pierwszym przypadku produkt często pojawia się szybciej, w drugim łatwiej go sprzedać.", "enriched_text": "Model Technology Push zakłada powstawanie innowacji w wyniku badań i rozwoju, natomiast Market Pull wynika z potrzeb rynku. W pierwszym przypadku produkt często pojawia się szybciej, w drugim łatwiej go sprzedać. Modele te różnią się źródłem impulsu innowacyjnego."}
{"id": "wyklad12_s26_c1", "lecture": "wyklad12", "slide": 26, "title": "Komercjalizacja – startupy i spin-offy", "text": "Komercjalizacja innowacji może odbywać się poprzez startupy lub struktury spin-off i spin-out. Modele te różnią się stopniem powiązania z organizacją macierzystą oraz poziomem ryzyka.", "enriched_text": "Komercjalizacja innowacji może odbywać się poprzez startupy lub struktury spin-off i spin-out. Modele te różnią się stopniem powiązania z organizacją macierzystą oraz poziomem ryzyka. Wybór modelu wpływa na tempo i sposób rozwoju innowacji."}
{"id": "wyklad12_s28_c1", "lecture": "wyklad12", "slide": 28, "title": "Strategie technologiczne", "text": "Strategie technologiczne obejmują m.in. podejście błękitnego i czerwonego oceanu, nisze innowacji, sieci i klastry innowacyjne, innowację otwartą oraz strategie naśladowcze i elitarystyczne.", "enriched_text": "Strategie technologiczne obejmują m.in. podejście błękitnego i czerwonego oceanu, nisze innowacji, sieci i klastry innowacyjne, innowację otwartą oraz strategie naśladowcze i elitarystyczne. Strategia determinuje sposób konkurowania poprzez innowacje."}
{"id": "wyklad12_s29_c1", "lecture": "wyklad12", "slide": 29, "title": "Toksyczne modele biznesowe", "text": "Toksyczne modele biznesowe generują krótkoterminowe korzyści kosztem użytkowników, rynku lub społeczeństwa. Ich analiza stanowi ważny element krytycznego spojrzenia na innowacyjność.", "enriched_text": "Toksyczne modele biznesowe generują krótkoterminowe korzyści kosztem użytkowników, rynku lub społeczeństwa. Ich analiza stanowi ważny element krytycznego spojrzenia na innowacyjność. Pozwalają ocenić długofalowe skutki innowacji."}
{"id": "wyklad13_s3_c1", "lecture": "wyklad13", "slide": 3, "title": "Czym jest wiedza", "text": "Wiedza jest pojęciem szerszym niż informacja i obejmuje zrozumienie, kontekst oraz zdolność do działania. Nie każda poprawna informacja automatycznie staje się wiedzą użytkową.", "enriched_text": "Wiedza jest pojęciem szerszym niż informacja i obejmuje zrozumienie, kontekst oraz zdolność do działania. Nie każda poprawna informacja automatycznie staje się wiedzą użytkową. Wiedza zakłada możliwość praktycznego wykorzystania informacji w konkretnych sytuacjach decyzyjnych."}
{"id": "wyklad13_s3_c2", "lecture": "wyklad13", "slide": 3, "title": "Przykład wiedzy – równanie F=m*a", "text": "Równanie F=m*a samo w sobie jest informacją, natomiast wiedzą staje się dopiero wtedy, gdy rozumiemy jego znaczenie i potrafimy je zastosować w praktyce.", "enriched_text": "Równanie F=m*a samo w sobie jest informacją, natomiast wiedzą staje się dopiero wtedy, gdy rozumiemy jego znaczenie i potrafimy je zastosować w praktyce. Zastosowanie wzoru wymaga interpretacji fizycznej i kontekstu problemu."}
{"id": "wyklad13_s3_c3", "lecture": "wyklad13", "slide": 3, "title": "Piramida DIKW", "text": "Piramida DIKW opisuje przejście od danych przez informacje i wiedzę do mądrości. Każdy kolejny poziom wymaga interpretacji, zrozumienia i kontekstu decyzyjnego.", "enriched_text": "Piramida DIKW opisuje przejście od danych przez informacje i wiedzę do mądrości. Każdy kolejny poziom wymaga interpretacji, zrozumienia i kontekstu decyzyjnego. Model ten pokazuje, że sama akumulacja danych nie prowadzi automatycznie do mądrych decyzji."}
{"id": "wyklad13_s4_c1", "lecture": "wyklad13", "slide": 4, "title": "Wiedza ukryta – definicja", "text": "Wiedza ukryta, opisana przez Polanyiego, jest trudna do formalnego zapisania i przekazywania. Często wynika z doświadczenia i praktyki, a nie z dokumentów.", "enriched_text": "Wiedza ukryta, opisana przez Polanyiego, jest trudna do formalnego zapisania i przekazywania. Często wynika z doświadczenia i praktyki, a nie z dokumentów. Jej przekazywanie wymaga bezpośredniego kontaktu i wspólnej pracy."}
{"id": "wyklad13_s4_c2", "lecture": "wyklad13", "slide": 4, "title": "Problemy z wiedzą ukrytą", "text": "Do problemów związanych z wiedzą ukrytą należą trudności kodyfikacji, osobisty charakter wiedzy, konieczność uczenia się przez doświadczenie oraz przekonanie, że pewne rzeczy są tak oczywiste, iż nie wymagają wyjaśnienia.", "enriched_text": "Do problemów związanych z wiedzą ukrytą należą trudności kodyfikacji, osobisty charakter wiedzy, konieczność uczenia się przez doświadczenie oraz przekonanie, że pewne rzeczy są tak oczywiste, iż nie wymagają wyjaśnienia. Problemy te utrudniają skalowanie wiedzy w organizacji."}
{"id": "wyklad13_s6_c1", "lecture": "wyklad13", "slide": 6, "title": "Wiedza a czwarty kwadrat", "text": "Model czwartego kwadratu dzieli wiedzę na known knowns, known unknowns, unknown unknowns oraz unknown knowns. Umożliwia on analizę luk poznawczych i źródeł niepewności.", "enriched_text": "Model czwartego kwadratu dzieli wiedzę na known knowns, known unknowns, unknown unknowns oraz unknown knowns. Umożliwia on analizę luk poznawczych i źródeł niepewności. Pomaga świadomie zarządzać niepewnością i ryzykiem decyzyjnym."}
{"id": "wyklad13_s6_c2", "lecture": "wyklad13", "slide": 6, "title": "Unknown knowns i intuicja", "text": "Unknown knowns to wiedza oparta na doświadczeniu, z której nie zdajemy sobie w pełni świadomie sprawy. Często określa się ją mianem intuicji i trudno ją formalnie opisać.", "enriched_text": "Unknown knowns to wiedza oparta na doświadczeniu, z której nie zdajemy sobie w pełni świadomie sprawy. Często określa się ją mianem intuicji i trudno ją formalnie opisać. Intuicja bywa istotnym wsparciem decyzji eksperckich."}
{"id": "wyklad13_s7_c1", "lecture": "wyklad13", "slide": 7, "title": "Zarządzanie wiedzą – istota", "text": "Zarządzanie wiedzą dotyczy systematycznego pozyskiwania, przechowywania, udostępniania i wykorzystywania wiedzy w organizacji. Jego celem jest zwiększenie wartości firmy i efektywności działania.", "enriched_text": "Zarządzanie wiedzą dotyczy systematycznego pozyskiwania, przechowywania, udostępniania i wykorzystywania wiedzy w organizacji. Jego celem jest zwiększenie wartości firmy i efektywności działania. Zakłada traktowanie wiedzy jako strategicznego zasobu organizacji."}
{"id": "wyklad13_s7_c2", "lecture": "wyklad13", "slide": 7, "title": "Rozwój i kryzys zarządzania wiedzą", "text": "Zarządzanie wiedzą przeżywało dynamiczny rozwój na początku lat 90., m.in. w firmie Skandia. W latach 2002–2005 pojawił się kryzys koncepcji, wynikający z trudności mierzenia efektów i nadmiernej formalizacji.", "enriched_text": "Zarządzanie wiedzą przeżywało dynamiczny rozwój na początku lat 90., m.in. w firmie Skandia. W latach 2002–2005 pojawił się kryzys koncepcji, wynikający z trudności mierzenia efektów i nadmiernej formalizacji. Kryzys ujawnił ograniczenia podejścia czysto procesowego."}
{"id": "wyklad13_s7_c3", "lecture": "wyklad13", "slide": 7, "title": "Model SECI Nonaki", "text": "Model SECI opisuje cztery procesy tworzenia wiedzy: socjalizację, eksternalizację, kombinację i internalizację. Zakłada on ciągłą spiralę przechodzenia wiedzy ukrytej i jawnej.", "enriched_text": "Model SECI opisuje cztery procesy tworzenia wiedzy: socjalizację, eksternalizację, kombinację i internalizację. Zakłada on ciągłą spiralę przechodzenia wiedzy ukrytej i jawnej. Model podkreśla dynamiczny charakter tworzenia wiedzy."}
{"id": "wyklad13_s8_c1", "lecture": "wyklad13", "slide": 8, "title": "Strategia kodyfikacji (push)", "text": "Strategia push polega na aktywnym kodyfikowaniu wiedzy i tworzeniu repozytoriów, z których inni mogą korzystać. Skupia się na dokumentach, bazach danych i procedurach.", "enriched_text": "Strategia push polega na aktywnym kodyfikowaniu wiedzy i tworzeniu repozytoriów, z których inni mogą korzystać. Skupia się na dokumentach, bazach danych i procedurach. Ułatwia skalowanie wiedzy, ale może tracić kontekst."}
{"id": "wyklad13_s8_c2", "lecture": "wyklad13", "slide": 8, "title": "Strategia personalizacji (pull)", "text": "Strategia pull opiera się na bezpośrednim kontakcie z ekspertami i przekazywaniu wiedzy w relacjach interpersonalnych. Jej celem jest osiągnięcie głębokiego zrozumienia problemu.", "enriched_text": "Strategia pull opiera się na bezpośrednim kontakcie z ekspertami i przekazywaniu wiedzy w relacjach interpersonalnych. Jej celem jest osiągnięcie głębokiego zrozumienia problemu. Sprawdza się szczególnie w złożonych i niejednoznacznych problemach."}
{"id": "wyklad13_s9_c1", "lecture": "wyklad13", "slide": 9, "title": "Narzędzia zarządzania wiedzą", "text": "Zarządzanie wiedzą wspierają m.in. kultura dzielenia się wiedzą, retrospektywy i AAR, repozytoria wiedzy, mentoring, coaching oraz systemy informatyczne takie jak wiki i bazy ekspertów.", "enriched_text": "Zarządzanie wiedzą wspierają m.in. kultura dzielenia się wiedzą, retrospektywy i AAR, repozytoria wiedzy, mentoring, coaching oraz systemy informatyczne takie jak wiki i bazy ekspertów. Skuteczność narzędzi zależy od kultury organizacyjnej."}
{"id": "wyklad13_s12_c1", "lecture": "wyklad13", "slide": 12, "title": "Business Model Canvas – charakterystyka", "text": "Business Model Canvas jest zwinnym szablonem do zarządzania początkiem i strategią projektu. Bazowy model składa się z dziewięciu elementów pogrupowanych w cztery obszary: klientów, ofertę, finanse i infrastrukturę.", "enriched_text": "Business Model Canvas jest zwinnym szablonem do zarządzania początkiem i strategią projektu. Bazowy model składa się z dziewięciu elementów pogrupowanych w cztery obszary: klientów, ofertę, finanse i infrastrukturę. Umożliwia szybkie testowanie i modyfikowanie założeń biznesowych."}
{"id": "wyklad13_s13_c1", "lecture": "wyklad13", "slide": 13, "title": "BMC – infrastruktura", "text": "Obszar infrastruktury w Business Model Canvas obejmuje kluczowe działania, kluczowych partnerów oraz kluczowe zasoby niezbędne do wytworzenia wartości.", "enriched_text": "Obszar infrastruktury w Business Model Canvas obejmuje kluczowe działania, kluczowych partnerów oraz kluczowe zasoby niezbędne do wytworzenia wartości. Definiuje zaplecze operacyjne modelu biznesowego."}
{"id": "wyklad13_s14_c1", "lecture": "wyklad13", "slide": 14, "title": "BMC – propozycja wartości", "text": "Propozycja wartości opisuje korzyści oferowane klientowi przez produkty lub usługi. Może obejmować m.in. nowość, jakość, niezawodność, cenę, bezpieczeństwo, dostępność lub wygodę.", "enriched_text": "Propozycja wartości opisuje korzyści oferowane klientowi przez produkty lub usługi. Może obejmować m.in. nowość, jakość, niezawodność, cenę, bezpieczeństwo, dostępność lub wygodę. Jest centralnym elementem całego modelu biznesowego."}
{"id": "wyklad13_s15_c1", "lecture": "wyklad13", "slide": 15, "title": "BMC – klienci", "text": "Obszar klientów obejmuje segmenty klientów, kanały dystrybucji oraz relacje z klientami. Określa, do kogo kierowana jest oferta, jak jest dostarczana oraz jak budowana jest długoterminowa relacja.", "enriched_text": "Obszar klientów obejmuje segmenty klientów, kanały dystrybucji oraz relacje z klientami. Określa, do kogo kierowana jest oferta, jak jest dostarczana oraz jak budowana jest długoterminowa relacja. Pozwala dopasować ofertę do konkretnych grup odbiorców."}
{"id": "wyklad13_s16_c1", "lecture": "wyklad13", "slide": 16, "title": "BMC – finanse", "text": "Obszar finansów w Business Model Canvas obejmuje strukturę kosztów oraz strumienie przychodów. Pozwala określić, ile model biznesowy kosztuje i w jaki sposób generuje dochody.", "enriched_text": "Obszar finansów w Business Model Canvas obejmuje strukturę kosztów oraz strumienie przychodów. Pozwala określić, ile model biznesowy kosztuje i w jaki sposób generuje dochody. Umożliwia ocenę opłacalności modelu biznesowego."}
{"id": "wyklad13_s18_c1", "lecture": "wyklad13", "slide": 18, "title": "Narzędzia wspomagające zarządzanie projektem", "text": "Narzędzia wspomagające zarządzanie projektem służą planowaniu, monitorowaniu i koordynacji pracy zespołu. Oferują korzyści w postaci przejrzystości i kontroli, ale mogą generować koszty i narzut organizacyjny.", "enriched_text": "Narzędzia wspomagające zarządzanie projektem służą planowaniu, monitorowaniu i koordynacji pracy zespołu. Oferują korzyści w postaci przejrzystości i kontroli, ale mogą generować koszty i narzut organizacyjny. Ich dobór powinien być proporcjonalny do skali projektu."}
{"id": "wyklad13_s19_c1", "lecture": "wyklad13", "slide": 19, "title": "Asana – charakterystyka", "text": "Asana jest narzędziem do zarządzania zadaniami i projektami, umożliwiającym śledzenie postępów, delegowanie zadań i komunikację zespołową. Oferuje wersję darmową i płatne rozszerzenia funkcjonalne.", "enriched_text": "Asana jest narzędziem do zarządzania zadaniami i projektami, umożliwiającym śledzenie postępów, delegowanie zadań i komunikację zespołową. Oferuje wersję darmową i płatne rozszerzenia funkcjonalne. Sprawdza się głównie w lekkich i średnich projektach."}
{"id": "wyklad13_s21_c1", "lecture": "wyklad13", "slide": 21, "title": "Notion – zalety i wady", "text": "Notion umożliwia prostą organizację wiedzy i projektów przy niskich kosztach. Jego ograniczenia obejmują brak rozbudowanego raportowania, kontroli wersji i słabą skalowalność dla dużych zbiorów danych.", "enriched_text": "Notion umożliwia prostą organizację wiedzy i projektów przy niskich kosztach. Jego ograniczenia obejmują brak rozbudowanego raportowania, kontroli wersji i słabą skalowalność dla dużych zbiorów danych. Łączy cechy narzędzia projektowego i bazy wiedzy."}
{"id": "wyklad13_s22_c1", "lecture": "wyklad13", "slide": 22, "title": "Kompleksowe narzędzia PM", "text": "Kompleksowe narzędzia do zarządzania projektami oferują planowanie, przydział zadań, monitorowanie postępów oraz raportowanie. Wspierają zarówno metodyki tradycyjne, jak i zwinne.", "enriched_text": "Kompleksowe narzędzia do zarządzania projektami oferują planowanie, przydział zadań, monitorowanie postępów oraz raportowanie. Wspierają zarówno metodyki tradycyjne, jak i zwinne. Zapewniają wysoką kontrolę kosztem złożoności."}
{"id": "wyklad13_s26_c1", "lecture": "wyklad13", "slide": 26, "title": "JIRA – charakterystyka", "text": "JIRA jest narzędziem skoncentrowanym na metodykach zwinnych, takich jak Scrum i Kanban. Oferuje tablice, raportowanie i śledzenie błędów, ale charakteryzuje się wysokim progiem wejścia i ograniczeniami poza Agile.", "enriched_text": "JIRA jest narzędziem skoncentrowanym na metodykach zwinnych, takich jak Scrum i Kanban. Oferuje tablice, raportowanie i śledzenie błędów, ale charakteryzuje się wysokim progiem wejścia i ograniczeniami poza Agile. Najlepiej sprawdza się w zespołach programistycznych."}
{"id": "wyklad13_s28_c1", "lecture": "wyklad13", "slide": 28, "title": "LiquidPlanner", "text": "LiquidPlanner jest narzędziem chmurowym wspierającym planowanie oparte na priorytetach. Automatycznie reaguje na zmiany zasobów i priorytetów, ale posiada ograniczenia w wersjonowaniu dokumentów.", "enriched_text": "LiquidPlanner jest narzędziem chmurowym wspierającym planowanie oparte na priorytetach. Automatycznie reaguje na zmiany zasobów i priorytetów, ale posiada ograniczenia w wersjonowaniu dokumentów. Wspiera dynamiczne zarządzanie harmonogramem."}
{"id": "wyklad13_s29_c1", "lecture": "wyklad13", "slide": 29, "title": "Monday.com", "text": "Monday.com to rozbudowane narzędzie online wspierające zarówno metodyki sztywne, jak i zwinne. Oferuje zaawansowane raportowanie i bazę wiedzy, lecz bywa kosztowne i ma ograniczenia językowe.", "enriched_text": "Monday.com to rozbudowane narzędzie online wspierające zarówno metodyki sztywne, jak i zwinne. Oferuje zaawansowane raportowanie i bazę wiedzy, lecz bywa kosztowne i ma ograniczenia językowe. Często wykorzystywane w środowiskach korporacyjnych."}
{"id": "wyklad13_s30_c1", "lecture": "wyklad13", "slide": 30, "title": "Pakiet Microsoft – wady", "text": "MS Project, SharePoint, TFS i Teams oferują szeroką funkcjonalność, lecz słabo wspierają metodyki zwinne, są kosztowne i ograniczają integrację z narzędziami innych producentów.", "enriched_text": "MS Project, SharePoint, TFS i Teams oferują szeroką funkcjonalność, lecz słabo wspierają metodyki zwinne, są kosztowne i ograniczają integrację z narzędziami innych producentów. Pakiet jest silnie powiązany z ekosystemem Microsoft."}
{"id": "wyklad13_s31_c1", "lecture": "wyklad13", "slide": 31, "title": "Oracle Primavera", "text": "Oracle Primavera jest rozbudowanym narzędziem do zarządzania projektami, lepiej dostosowanym do metodyk tradycyjnych. Charakteryzuje się wysoką ceną, ograniczoną integracją i problemami technicznymi.", "enriched_text": "Oracle Primavera jest rozbudowanym narzędziem do zarządzania projektami, lepiej dostosowanym do metodyk tradycyjnych. Charakteryzuje się wysoką ceną, ograniczoną integracją i problemami technicznymi. Stosowane głównie w dużych projektach infrastrukturalnych."}
{"id": "wyklad13_s35_c1", "lecture": "wyklad13", "slide": 35, "title": "Trello", "text": "Trello jest prostym narzędziem opartym na kanbanie, dobrym na start i małe zespoły. Jego ograniczenia dotyczą raportowania i zaawansowanego zarządzania projektami.", "enriched_text": "Trello jest prostym narzędziem opartym na kanbanie, dobrym na start i małe zespoły. Jego ograniczenia dotyczą raportowania i zaawansowanego zarządzania projektami. Sprawdza się jako narzędzie wprowadzające do pracy projektowej."}
{"id": "wyklad13_s36_c1", "lecture": "wyklad13", "slide": 36, "title": "Wrike", "text": "Wrike oferuje integrację poczty z zadaniami i podstawowe planowanie. Ograniczenia obejmują problemy z eksportem danych, niepełny Gantt oraz wysokie koszty wersji płatnych.", "enriched_text": "Wrike oferuje integrację poczty z zadaniami i podstawowe planowanie. Ograniczenia obejmują problemy z eksportem danych, niepełny Gantt oraz wysokie koszty wersji płatnych. Narzędzie łączy cechy task managera i PM."}
{"id": "wyklad13_s37_c1", "lecture": "wyklad13", "slide": 37, "title": "Zoho Projects", "text": "Zoho Projects zapewnia szeroki zakres funkcji, w tym planowanie, raportowanie i zarządzanie dokumentami. Interfejs bywa mało intuicyjny, a pełna funkcjonalność wiąże się z wysokimi kosztami.", "enriched_text": "Zoho Projects zapewnia szeroki zakres funkcji, w tym planowanie, raportowanie i zarządzanie dokumentami. Interfejs bywa mało intuicyjny, a pełna funkcjonalność wiąże się z wysokimi kosztami. Część większego ekosystemu narzędzi Zoho."}
{"id": "wyklad13_s38_c1", "lecture": "wyklad13", "slide": 38, "title": "Wybór narzędzia PM", "text": "Nie istnieje jedno najlepsze narzędzie do zarządzania projektami. Wybór zależy od metodyki, skali projektu, zespołu, budżetu oraz wymagań organizacyjnych.", "enriched_text": "Nie istnieje jedno najlepsze narzędzie do zarządzania projektami. Wybór zależy od metodyki, skali projektu, zespołu, budżetu oraz wymagań organizacyjnych. Dobór narzędzia powinien wspierać, a nie komplikować pracę zespołu."}
